var kisekaeskn = [
	["ユニオン","駆逐","ラフィー","Laffey","33娘","その他","","日本未実装","通常","","","2017年6月23日","大陸限定bilibiliコラボ"],
	["ロイヤル","駆逐","ジャベリン","Javelin","22娘","その他","","日本未実装","通常","","","2017年6月23日","大陸限定bilibiliコラボ"],
	["ユニオン","軽母","ロング・アイランド","Long_Island","干物三連！","居間着","","キャラスト","通常","","","2017年6月23日",""],
	["ロイヤル","駆逐","ヴァンパイア","Vampire","エロイの祝福","ケッコン","600","指輪を贈る","通常","","","2017年7月14日",""],
	["ロイヤル","空母","イラストリアス","Illustrious","愛と希望の暁星","ケッコン","600","指輪を贈る","通常","","","2017年7月14日",""],
	["重桜","空母","赤城","Akagi","真紅の雛罌粟","ケッコン","600","指輪を贈る","通常","","","2017年7月14日",""],
	["ロイヤル","砲艦","エレバス","Erebus","幻の幸福","その他","800","常設販売","通常","","","2017年8月28日",""],
	["重桜","軽母","鳳翔","Houshou","宵の夢","その他","","限定イベ","通常","","","2017年8月28日",""],
	["ユニオン","駆逐","ハムマン","Hammann","ハムマン改","改造","","近代化改修","通常","","","2017年9月13日",""],
	["ロイヤル","駆逐","フォーチュン","Fortune","フォーチュン改","改造","","近代化改修","通常","","","2017年9月14日",""],
	["ロイヤル","重巡","サフォーク","Suffolk","サフォーク改","改造","","近代化改修","通常","","","2017年9月14日",""],
	["ユニオン","軽母","ボーグ","Bogue","ボーグ改","改造","","近代化改修","通常","","","2017年9月14日",""],
	["ユニオン","軽母","ラングレー","Langley","ラングレー改","改造","","近代化改修","通常","","","2017年9月14日",""],
	["ロイヤル","駆逐","シグニット","Cygnet","シグニット改","改造","","近代化改修","通常","","","2017年9月21日",""],
	["ユニオン","軽母","レンジャー","Ranger","レンジャー改","改造","","近代化改修","通常","","","2017年9月21日",""],
	["ロイヤル","巡戦","フッド","Hood","日差しの淑女","水着","800","常設販売","通常","通常背景","","2017年9月21日",""],
	["ロイヤル","戦艦","ロドニー","Rodney","未来の海浜大将","水着","800","常設販売","通常","通常背景","","2017年9月21日",""],
	["ユニオン","駆逐","ハムマン","Hammann","ひねくれサマー","水着","600","常設販売","通常","通常背景","","2017年9月21日",""],
	["ユニオン","空母","サラトガ","Saratoga","大洋の休日","水着","600","常設販売","通常","通常背景","","2017年9月21日",""],
	["東煌","軽巡","平海","Ping_Hai","遊興の夏？","水着","500","常設販売","通常","通常背景","","2017年9月21日",""],
	["重桜","戦艦","山城","Yamashiro","夏の大作戦？","水着","","常設イベ","通常","通常背景","","2017年9月21日",""],
	["重桜","重巡","高雄","Takao","夏のラプソディー","水着","700","常設販売","通常","通常背景","","2017年9月28日",""],
	["重桜","重巡","愛宕","Atago","真夏のパレード","水着","700","常設販売","L2D","通常背景","","2017年9月28日",""],
	["ロイヤル","戦艦","プリンス・オブ・ウェールズ","Prince_of_Wales","ウィンザー・サン","水着","700","常設販売","通常","通常背景","","2017年9月28日",""],
	["鉄血","重巡","プリンツ・オイゲン","Prinz_Eugen","色褪せない笑顔","水着","","常設販売","通常","通常背景","","2017年9月28日",""],
	["重桜","軽母","祥鳳","Shouhou","祥鳳改","改造","","近代化改修","通常","","","2017年9月28日",""],
	["東煌","軽巡","寧海","Ning_Hai","月宮の玉兎","その他","800","常設販売","通常","","","2017年9月28日",""],
	["東煌","軽巡","平海","Ping_Hai","モクセイラビット","その他","800","常設販売","通常","","","2017年9月28日",""],
	["ロイヤル","駆逐","シグニット","Cygnet","海辺の十字星","水着","","常設イベ","通常","通常背景","","2017年10月1日",""],
	["ロイヤル","軽巡","リアンダー","Leander","リアンダー改","改造","","近代化改修","通常","","","2017年10月12日",""],
	["ロイヤル","軽巡","エイジャックス","Ajax","エイジャックス改","改造","","近代化改修","通常","","","2017年10月12日",""],
	["ユニオン","軽母","ロング・アイランド","Long_Island","ロング・アイランド改","改造","","近代化改修","通常","","","2017年10月12日",""],
	["東煌","軽巡","寧海","Ning_Hai","食欲の夏！","水着","800","常設販売","通常","通常背景","","2017年10月19日",""],
	["重桜","空母","赤城","Akagi","楽園の彼岸花","水着","600","常設販売","通常","通常背景","","2017年10月19日",""],
	["重桜","空母","加賀","Kaga","常夏の殺生石","水着","600","常設販売","通常","通常背景","","2017年10月19日",""],
	["重桜","駆逐","時雨","Shigure","進め！伊490","水着","500","常設販売","通常","通常背景","","2017年10月19日",""],
	["重桜","軽巡","阿武隈","Abukuma","阿武隈改","改造","","近代化改修","通常","","","2017年10月19日",""],
	["ユニオン","軽巡","クリーブランド","Cleveland","デビルフィーバー","ハロウィン","800","常設販売","通常","","","2017年10月26日",""],
	["重桜","駆逐","綾波","Ayanami","宵闇待ちの魔女","ハロウィン","700","常設販売","通常","","","2017年10月26日",""],
	["重桜","駆逐","陽炎","Kagerou","南瓜諸聖祭じゃ！","ハロウィン","600","常設販売","通常","","","2017年10月26日",""],
	["重桜","軽母","祥鳳","Shouhou","夜回りウィッチ","ハロウィン","600","常設販売","通常","","","2017年10月26日",""],
	["ロイヤル","駆逐","ジャベリン","Javelin","ジャベリン改","改造","","近代化改修","通常","","","2017年10月27日",""],
	["重桜","戦艦","山城","Yamashiro","山城改","改造","","近代化改修","通常","","","2017年10月27日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","小さな星の歌姫","その他","","コラボイベ","通常","","","2017年11月2日","中国VOCALOID「星尘（シンチェン）」コラボ"],
	["ロイヤル","巡戦","フッド","Hood","薔薇恋詩","ケッコン","600","指輪を贈る","通常","","","2017年11月9日",""],
	["重桜","重巡","古鷹","Furutaka","古鷹改","改造","","近代化改修","通常","","","2017年11月9日",""],
	["重桜","重巡","加古","Kako","加古改","改造","","近代化改修","通常","","","2017年11月9日",""],
	["重桜","駆逐","浜風","Hamakaze","浜風改","改造","","近代化改修","通常","","","2017年11月23日",""],
	["ロイヤル","空母","イラストリアス","Illustrious","終わらないお茶会","その他","800","常設販売","通常","","","2017年11月23日",""],
	["重桜","駆逐","雷","Ikazuchi","サクラブレイク","その他","650","常設販売","通常","","","2017年11月23日",""],
	["重桜","駆逐","電","Inazuma","バニラプリン","その他","650","常設販売","通常","","","2017年11月23日",""],
	["ユニオン","駆逐","カッシン","Cassin","カッシン改","改造","","近代化改修","通常","","","2017年11月30日",""],
	["ユニオン","駆逐","ダウンズ","Downes","ダウンズ改","改造","","近代化改修","通常","","","2017年11月30日",""],
	["重桜","駆逐","綾波","Ayanami","ニコニコ","その他","","コラボイベ","通常","","","2017年11月30日","ニコニコ動画コラボ"],
	["鉄血","駆逐","Z23","Z23","哲学講師","その他","","常設イベ","通常","","","2017年11月30日",""],
	["重桜","駆逐","綾波","Ayanami","綾波改","改造","","近代化改修","通常","","","2017年12月7日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","トナカイマスター","クリスマス","880","常設販売","通常","通常背景","","2017年12月15日",""],
	["ユニオン","駆逐","エルドリッジ","Eldridge","聖夜のだっこ","クリスマス","780","常設販売","通常","通常背景","","2017年12月15日",""],
	["ロイヤル","駆逐","シグニット","Cygnet","聖夜の賛美歌","クリスマス","680","常設販売","通常","通常背景","","2017年12月15日",""],
	["ユニオン","軽巡","サンディエゴ","San_Diego","メリクリディエゴ！","クリスマス","680","常設販売","通常","通常背景","","2017年12月15日",""],
	["重桜","戦艦","山城","Yamashiro","聖夜の大作戦？","クリスマス","680","常設販売","通常","通常背景","","2017年12月15日",""],
	["重桜","駆逐","睦月","Mutsuki","トナカイさん発進！","クリスマス","600","常設販売","通常","通常背景","","2017年12月15日",""],
	["ロイヤル","駆逐","コメット","Comet","コメット改","改造","","近代化改修","通常","","","2017年12月15日",""],
	["ロイヤル","駆逐","クレセント","Crescent","クレセント改","改造","","近代化改修","通常","","","2017年12月15日",""],
	["ユニオン","駆逐","グリッドレイ","Gridley","聖夜撮影会！","クリスマス","","常設イベ","通常","通常背景","","2017年12月15日",""],
	["鉄血","軽巡","カールスルーエ","Karlsruhe","カールスルーエ改","改造","","近代化改修","通常","","","2017年12月26日",""],
	["鉄血","重巡","プリンツ・オイゲン","Prinz_Eugen","百花繚乱","お正月","880","常設販売","通常","通常背景","","2017年12月29日",""],
	["重桜","空母","赤城","Akagi","梅と雪","お正月","880","常設販売","通常","通常背景","","2017年12月29日",""],
	["重桜","空母","加賀","Kaga","白狐賀正","お正月","880","常設販売","通常","通常背景","","2017年12月29日",""],
	["重桜","駆逐","夕立","Yuudachi","新年雪合戦","お正月","780","常設販売","通常","通常背景","","2017年12月29日",""],
	["重桜","重巡","愛宕","Atago","冬の風物詩","お正月","780","常設販売","通常","通常背景","","2017年12月29日",""],
	["重桜","工作","明石","Akashi","あかしのあかじにゃ！","お正月","780","常設販売","通常","通常背景","","2017年12月29日",""],
	["ユニオン","駆逐","ラフィー","Laffey","雪うさぎとりんご飴","お正月","680","常設販売","通常","通常背景","","2017年12月29日",""],
	["重桜","空母","蒼龍","Souryuu","松に鶴","お正月","680","常設販売","通常","通常背景","","2017年12月29日",""],
	["重桜","駆逐","如月","Kisaragi","正月のお願い","お正月","","限定イベ","通常","通常背景","","2017年12月29日",""],
	["ユニオン","駆逐","ベイリー","Bailey","ベイリー改","改造","","近代化改修","通常","","","2018年1月12日",""],
	["重桜","駆逐","谷風","Tanikaze","谷風改","改造","","近代化改修","通常","","","2018年1月12日",""],
	["重桜","軽巡","神通","Jintsuu","神通改","改造","","近代化改修","通常","","","2018年1月19日",""],
	["鉄血","重巡","ドイッチュラント","Deutschland","漆黒の魔姫","パーティー","","コアデータ","通常","","","2018年1月26日",""],
	["ネプテューヌ","駆逐","ホワイトハート","White_Heart","女神のはじらい","その他","880","限定販売","通常","通常背景","","2018年2月6日","ネプテューヌコラボ"],
	["ネプテューヌ","軽巡","パープルハート","Purple_Heart","女神との約束","その他","880","限定販売","通常","通常背景","","2018年2月6日","ネプテューヌコラボ"],
	["ネプテューヌ","重巡","ブラックハート","Black_Heart","女神の微笑み","その他","880","限定販売","通常","通常背景","","2018年2月6日","ネプテューヌコラボ"],
	["ネプテューヌ","空母","グリーンハート","Green_Heart","女神とのひと時","その他","880","限定販売","通常","通常背景","","2018年2月6日","ネプテューヌコラボ"],
	["東煌","軽巡","寧海","Ning_Hai","寧海改","改造","","近代化改修","通常","","","2018年2月12日",""],
	["東煌","軽巡","平海","Ping_Hai","平海改","改造","","近代化改修","通常","","","2018年2月12日",""],
	["ユニオン","重巡","ポートランド","Portland","ポートランド改","改造","","近代化改修","通常","","","2018年2月12日",""],
	["ロイヤル","駆逐","ヴァンパイア","Vampire","春の風","東煌風","880","常設販売","通常","通常背景","","2018年2月12日",""],
	["ユニオン","軽巡","セントルイス","St_Louis","春の華","東煌風","880","常設販売","L2D","通常背景","","2018年2月12日",""],
	["ロイヤル","軽巡","オーロラ","Aurora","春の語り","東煌風","880","常設販売","通常","通常背景","","2018年2月12日",""],
	["重桜","重巡","高雄","Takao","春の習い","東煌風","880","常設販売","通常","通常背景","","2018年2月12日",""],
	["東煌","駆逐","長春","Chang_Chun","春季仕様","東煌風","780","常設販売","通常","通常背景","","2018年2月12日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","春の贈り物","東煌風","780","常設販売","通常","通常背景","","2018年2月12日",""],
	["重桜","戦艦","扶桑","Fuso","春の祝い","東煌風","680","常設販売","通常","通常背景","","2018年2月12日",""],
	["ロイヤル","駆逐","フォックスハウンド","Foxhound","フォックスハウンド改","改造","","近代化改修","通常","","","2018年2月26日",""],
	["ユニオン","駆逐","ニコラス","Nicholas","ニコナース","ホスピタル","700","常設販売","通常","","","2018年3月15日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","マリースター","ケッコン","600","指輪を贈る","通常","","","2018年3月15日",""],
	["重桜","駆逐","神風","Kamikaze","神風改","改造","","近代化改修","通常","","","2018年3月15日",""],
	["重桜","駆逐","松風","Matsukaze","松風改","改造","","近代化改修","通常","","","2018年3月15日",""],
	["ユニオン","駆逐","ラフィー","Laffey","ラフィー改","改造","","近代化改修","通常","","","2018年3月27日",""],
	["重桜","軽巡","最上","Mogami","最上改","改造","","近代化改修","通常","","","2018年3月27日",""],
	["ユニオン","駆逐","エルドリッジ","Eldridge","空き教室の不思議","学園","880","常設販売","通常","通常背景","","2018年3月29日",""],
	["ユニオン","軽巡","ホノルル","Honolulu","日傘のカノジョ","学園","880","常設販売","通常","通常背景","","2018年3月29日",""],
	["重桜","駆逐","吹雪","Fubuki","遅刻五分前","学園","780","常設販売","通常","通常背景","","2018年3月29日",""],
	["鉄血","駆逐","Z1","Z1","反逆のフィアツェーン","学園","780","常設販売","通常","通常背景","","2018年3月29日",""],
	["ロイヤル","軽巡","エディンバラ","Edinburgh","図書室の妖精さん","学園","780","常設販売","通常","通常背景","","2018年3月29日",""],
	["重桜","空母","蒼龍","Souryuu","廊下の風紀委員","学園","780","常設販売","通常","通常背景","","2018年3月29日",""],
	["重桜","空母","飛龍","Hiryuu","放課後スケバンガール","学園","780","常設販売","通常","通常背景","","2018年3月29日",""],
	["重桜","駆逐","雪風","Yukikaze","ブランコ様","その他","700","常設販売","通常","","","2018年3月29日",""],
	["ユニオン","駆逐","クレイヴン","Craven","場外のチアリーダー","学園","","常設イベ","通常","通常背景","","2018年4月1日",""],
	["ロイヤル","軽巡","アキリーズ","Achilles","アキリーズ改","改造","","近代化改修","通常","","","2018年4月10日",""],
	["ロイヤル","重巡","エクセター","Exeter","エクセター改","改造","","近代化改修","通常","","","2018年4月10日",""],
	["鉄血","重巡","アドミラル・グラーフ・シュペー","Admiral_Graf.Spee","少女の日曜日","学園","800","常設販売","通常","通常背景","","2018年4月12日",""],
	["重桜","駆逐","睦月","Mutsuki","睦月改","改造","","近代化改修","通常","","","2018年4月19日",""],
	["重桜","軽巡","川内","Sendai","川内改","改造","","近代化改修","通常","","","2018年4月19日",""],
	["重桜","駆逐","白露","Shiratsuyu","ご注文はギョライですか？","メイド","780","常設販売","通常","通常背景","","2018年4月26日",""],
	["重桜","駆逐","夕暮","Yuugure","見習いはメイドさん！","メイド","780","常設販売","通常","通常背景","","2018年4月26日",""],
	["重桜","駆逐","不知火","Shiranui","不知火改","改造","","近代化改修","通常","","","2018年4月26日",""],
	["ユニオン","戦艦","オクラホマ","Oklahoma","オクラホマ改","改造","","近代化改修","通常","","","2018年4月26日",""],
	["重桜","駆逐","綾波","Ayanami","ROCK'n KIJIN","その他","800","常設販売","通常","","","2018年4月26日",""],
	["重桜","駆逐","卯月","Uzuki","眠たがりのうづき","居間着","700","常設販売","通常","","","2018年5月10日",""],
	["重桜","駆逐","谷風","Tanikaze","はぐれ少女と迷路蝶","その他","700","常設販売","通常","","","2018年5月10日",""],
	["重桜","戦艦","扶桑","Fuso","扶桑改","改造","","近代化改修","通常","","","2018年5月10日",""],
	["ロイヤル","空母","グロリアス","Glorious","栄光なる学園生活","学園","780","常設販売","通常","通常背景","","2018年5月18日",""],
	["ロイヤル","駆逐","アカスタ","Acasta","お出かけスタイル","その他","700","常設販売","通常","","","2018年5月18日",""],
	["ロイヤル","駆逐","アカスタ","Acasta","アカスタ改","改造","","近代化改修","通常","","","2018年5月18日",""],
	["ロイヤル","駆逐","アーデント","Ardent","アーデント改","改造","","近代化改修","通常","","","2018年5月18日",""],
	["重桜","巡戦","霧島","Kirishima","放課後砲撃タイム","学園","880","限定販売","通常","通常背景","","2018年5月31日",""],
	["重桜","駆逐","朝潮","Asashio","花舞う季節の転校生","学園","880","常設販売","通常","通常背景","","2018年6月7日",""],
	["重桜","巡戦","榛名","Haruna","授業前休憩ブレイク","学園","880","常設販売","通常","通常背景","","2018年6月7日",""],
	["ロイヤル","戦艦","モナーク","Monarch","ブラック・ジェラード","パーティー","800","常設販売","通常","通常背景","","2018年6月7日",""],
	["重桜","駆逐","文月","Fumizuki","ねぼけてフェアリー","居間着","700","常設販売","通常","","","2018年6月7日",""],
	["ロイヤル","軽巡","ベルファスト","Belfast","クラダリングの誓い","ケッコン","600","指輪を贈る","通常","","","2018年6月7日",""],
	["重桜","戦艦","長門","Nagato","御狐の白装束","ケッコン","600","指輪を贈る","通常","","","2018年6月7日",""],
	["重桜","駆逐","江風","Kawakaze","間奏モノクローム","その他","800","常設販売","通常","","","2018年6月7日",""],
	["ユニオン","空母","サラトガ","Saratoga","サラトガ改","改造","","近代化改修","通常","","","2018年6月14日",""],
	["重桜","重巡","高雄","Takao","学園ロマンチカ","学園","880","常設販売","通常","通常背景","","2018年6月21日",""],
	["重桜","重巡","愛宕","Atago","学園トロイメライ","学園","880","常設販売","通常","通常背景","","2018年6月21日",""],
	["重桜","潜水","伊19","I19","旅立ちのそよ風","学園","880","常設販売","通常","通常背景","","2018年6月21日",""],
	["重桜","潜水","伊26","I26","ウサギと深海魚","学園","780","常設販売","通常","通常背景","","2018年6月21日",""],
	["ユニオン","戦艦","ネバダ","Nevada","ネバダ改","改造","","近代化改修","通常","","","2018年6月21日",""],
	["鉄血","駆逐","Z46","Z46","ファーストサマー","水着","1180","常設販売","L2D","通常背景","","2018年6月28日",""],
	["鉄血","空母","グラーフ・ツェッペリン","Graf_Zeppelin","砂浜のウルズ","水着","1180","常設販売","L2D","通常背景","","2018年6月28日",""],
	["鉄血","駆逐","Z25","Z25","暑夏の涼風","水着","780","常設販売","通常","通常背景","","2018年6月28日",""],
	["鉄血","重巡","プリンツ・オイゲン","Prinz_Eugen","運命シンフォニック","ケッコン","600","指輪を贈る","通常","","","2018年6月28日",""],
	["鉄血","潜水","U-47","U-47","ビギナーライダー","私服","880","常設販売","通常","通常背景","","2018年6月28日",""],
	["鉄血","駆逐","Z23","Z23","Z23改","改造","","近代化改修","通常","","","2018年6月28日",""],
	["ユニオン","重巡","アストリア","Astoria","純情ギャル？","学園","780","常設販売","通常","通常背景","","2018年7月17日",""],
	["ユニオン","重巡","クインシー","Quincy","炎夏の涼風","水着","780","常設販売","通常","通常背景","","2018年7月17日",""],
	["ユニオン","重巡","ヴィンセンス","Vincennes","スイートドリーム","居間着","700","常設販売","通常","","","2018年7月17日",""],
	["ユニオン","駆逐","ニコラス","Nicholas","ニコラス改","改造","","近代化改修","通常","","","2018年7月17日",""],
	["アイリス","軽巡","エミール・ベルタン","Emile_Bertin","Côte d'Azur","水着","1080","常設販売","L2D","通常背景","","2018年7月26日",""],
	["ヴィシア","巡戦","ダンケルク","Dunkerque","夏のシュクレ","水着","1080","常設販売","L2D","通常背景","","2018年7月26日",""],
	["ヴィシア","駆逐","ル・マルス","Le_Mars","エテ・ブリリアント","水着","","限定イベ","通常","通常背景","","2018年7月26日",""],
	["アイリス","駆逐","フォルバン","Forbin","フルール・ド・ブラン","その他","700","常設販売","通常","","","2018年7月26日",""],
	["アイリス","駆逐","フォルバン","Forbin","フォルバン改","改造","","近代化改修","通常","","","2018年7月26日",""],
	["ヴィシア","駆逐","ル・マルス","Le_Mars","ル・マルス改","改造","","近代化改修","通常","","","2018年7月26日",""],
	["鉄血","戦艦","ティルピッツ","Tirpitz","氷溶ける夏","水着","1180","常設販売","L2D","通常背景","","2018年8月9日",""],
	["ロイヤル","駆逐","ヴァンパイア","Vampire","白衣の小悪魔","ホスピタル","","常設イベ","通常","","","2018年8月9日",""],
	["ロイヤル","駆逐","ジャベリン","Javelin","ビーチピクニック！","水着","1080","常設販売","L2D","通常背景","","2018年8月15日",""],
	["ロイヤル","空母","アーク・ロイヤル","Ark_Royal","コーストウォッチャー","水着","780","常設販売","通常","通常背景","","2018年8月15日",""],
	["重桜","駆逐","陽炎","Kagerou","陽炎改","改造","","近代化改修","通常","","","2018年8月15日",""],
	["重桜","戦艦","三笠","Mikasa","桜都の風","学園","880","限定販売","通常","通常背景","","2018年8月30日",""],
	["重桜","駆逐","浜風","Hamakaze","ザ・優等生","学園","780","限定販売","通常","通常背景","","2018年8月30日",""],
	["ロイヤル","軽母","セントー","Centaur","砂浜のウンディーネ","水着","1180","常設販売","L2D","通常背景","","2018年8月30日",""],
	["重桜","巡戦","比叡","Hiei","月花の巡礼","居間着","700","限定販売","通常","","","2018年8月30日",""],
	["重桜","戦艦","伊勢","Ise","伊勢改","改造","","近代化改修","通常","","","2018年8月30日",""],
	["重桜","戦艦","日向","Hyuuga","日向改","改造","","近代化改修","通常","","","2018年8月30日",""],
	["鉄血","重巡","ドイッチュラント","Deutschland","サービスタイム！？","水着","1080","常設販売","L2D","通常背景","","2018年9月6日",""],
	["ユニオン","工作","ヴェスタル","Vestal","清爽なヘスティアー","水着","780","常設販売","通常","通常背景","","2018年9月6日",""],
	["ロイヤル","戦艦","ロドニー","Rodney","One Day as a Trainee Clerk","その他","","日本未実装","通常","","","2018年9月6日","大陸限定ローソンコラボ"],
	["重桜","空母","大鳳","Taihou","禁断の宴","パーティー","1180","常設販売","L2D","通常背景","","2018年9月14日",""],
	["重桜","駆逐","吹雪","Fubuki","Music Pixy","パーティー","1080","常設販売","L2D","通常背景","","2018年9月14日",""],
	["ユニオン","軽巡","クリーブランド","Cleveland","ジェントリーナイト","パーティー","1080","常設販売","L2D","通常背景","","2018年9月14日",""],
	["ユニオン","戦艦","サウスダコタ","South_Dakota","ソロコンサート","パーティー","880","常設販売","通常","通常背景","","2018年9月14日",""],
	["ロイヤル","空母","イラストリアス","Illustrious","輝きの舞踏会","パーティー","880","常設販売","通常","通常背景","","2018年9月14日",""],
	["重桜","工作","明石","Akashi","黒猫来週す！","パーティー","880","常設販売","通常","通常背景","","2018年9月14日",""],
	["鉄血","潜水","U-81","U-81","静謐なセレナーデ","パーティー","880","常設販売","通常","通常背景","","2018年9月14日",""],
	["ロイヤル","駆逐","アマゾン","Amazon","リトルオーケストラ","パーティー","780","常設販売","通常","通常背景","","2018年9月14日",""],
	["ロイヤル","軽巡","エイジャックス","Ajax","パーティークイーン","パーティー","780","常設販売","通常","通常背景","","2018年9月14日",""],
	["ロイヤル","軽巡","オーロラ","Aurora","黎明に捧げる賛歌","パーティー","780","常設販売","通常","通常背景","","2018年9月14日",""],
	["ロイヤル","戦艦","クイーン・エリザベス","Queen_Elizabeth","女王さまの舞踏会","パーティー","780","常設販売","通常","通常背景","","2018年9月14日",""],
	["重桜","駆逐","綾波","Ayanami","鬼神華裳","ケッコン","600","指輪を贈る","通常","","","2018年9月21日",""],
	["重桜","駆逐","夕立","Yuudachi","ソロモンのハナヨメ","ケッコン","600","指輪を贈る","通常","","","2018年9月21日",""],
	["重桜","重巡","高雄","Takao","神護ノ風華","ケッコン","600","指輪を贈る","通常","","","2018年9月21日",""],
	["重桜","空母","加賀","Kaga","浄界の君子蘭","ケッコン","600","指輪を贈る","通常","","","2018年9月21日",""],
	["重桜","戦艦","山城","Yamashiro","盛装の黒猫","パーティー","","常設イベ","通常","通常背景","","2018年9月21日",""],
	["重桜","駆逐","暁","Akatsuki","暁、北極へ行く","その他","700","常設販売","通常","","","2018年9月28日",""],
	["ロイヤル","軽巡","ニューカッスル","Newcastle","木槿霓裳","その他","700","常設販売","通常","","","2018年9月28日",""],
	["ユニオン","軽巡","サンディエゴ","San_Diego","サンディエゴ改","改造","","近代化改修","通常","","","2018年9月28日",""],
	["ロイヤル","軽巡","ニューカッスル","Newcastle","ニューカッスル改","改造","","近代化改修","通常","","","2018年9月28日",""],
	["ユニオン","軽巡","ホノルル","Honolulu","夏の災難！？","水着","1080","常設販売","L2D","通常背景","","2018年10月11日",""],
	["重桜","軽巡","神通","Jintsuu","軍師さんは休暇中","水着","780","常設販売","通常","通常背景","","2018年10月11日",""],
	["ユニオン","重巡","ミネアポリス","Minneapolis","ワイルドステューデント","学園","880","常設販売","通常","通常背景","","2018年10月25日",""],
	["ユニオン","駆逐","ホビー","Hobby","リトルスクールスター","学園","780","常設販売","通常","通常背景","","2018年10月25日",""],
	["ユニオン","駆逐","カーク","Kalk","学園の雪妖精","学園","780","常設販売","通常","通常背景","","2018年10月25日",""],
	["重桜","軽巡","五十鈴","Isuzu","フェアリーテイルナイト","ハロウィン","700","常設販売","通常","","","2018年10月25日",""],
	["ロイヤル","戦艦","ネルソン","Nelson","月の魔女","ハロウィン","700","常設販売","通常","","","2018年10月25日",""],
	["ロイヤル","砲艦","テラー","Terror","ハロウィン・テラー","ハロウィン","700","常設販売","通常","","","2018年10月25日",""],
	["ユニオン","駆逐","ベイリー","Bailey","トリッキーベイリー","ハロウィン","","常設イベ","通常","","","2018年10月25日",""],
	["ユニオン","軽巡","コンコード","Concord","スウィーティーアップル","お正月","780","常設販売","通常","通常背景","","2018年11月14日",""],
	["うたわれるもの","駆逐","ネコネ","Nekone","ネコネ(うたわれるもの)","その他","880","限定販売","通常","通常背景","","2018年11月29日","うたわれるものコラボ"],
	["うたわれるもの","軽巡","ルルティエ","Rurutie","ルルティエ(うたわれるもの)","その他","880","限定販売","通常","通常背景","","2018年11月29日","うたわれるものコラボ"],
	["うたわれるもの","重巡","クオン","Kuon","クオン(うたわれるもの)","その他","880","限定販売","通常","通常背景","","2018年11月29日","うたわれるものコラボ"],
	["うたわれるもの","軽母","ウルゥル","Uruuru","ウルゥル(うたわれるもの)","その他","780","限定販売","通常","通常背景","","2018年11月29日","うたわれるものコラボ"],
	["うたわれるもの","軽母","サラァナ","Saraana","サラァナ(うたわれるもの)","その他","780","限定販売","通常","通常背景","","2018年11月29日","うたわれるものコラボ"],
	["うたわれるもの","空母","フミルィル","Fumiruiru","フミルィル(うたわれるもの)","その他","780","限定販売","通常","通常背景","","2018年11月29日","うたわれるものコラボ"],
	["鉄血","重巡","アドミラル・グラーフ・シュペー","Admiral_Graf.Spee","平穏な日常","私服","700","常設販売","通常","","","2018年12月14日",""],
	["ロイヤル","戦艦","ウォースパイト","Warspite","戦士からの贈り物","クリスマス","880","常設販売","通常","通常背景","","2018年12月20日",""],
	["ユニオン","駆逐","ニコラス","Nicholas","ミスパッケージング！？","クリスマス","780","常設販売","通常","通常背景","","2018年12月20日",""],
	["重桜","駆逐","浦風","Urakaze","ショーグンナタラ","クリスマス","780","常設販売","通常","通常背景","","2018年12月20日",""],
	["ユニオン","軽巡","ホノルル","Honolulu","プレゼント・ファイアレッド","クリスマス","780","常設販売","通常","通常背景","","2018年12月20日",""],
	["ロイヤル","重巡","ヨーク","York","ヨーク改","改造","","近代化改修","通常","","","2018年12月20日",""],
	["重桜","駆逐","大潮","Ooshio","トナカイさんの土産や～♪","クリスマス","","常設イベ","通常","通常背景","","2018年12月20日",""],
	["ユニオン","駆逐","エルドリッジ","Eldridge","正月のおてて","お正月","1180","常設販売","L2D","通常背景","","2018年12月27日",""],
	["重桜","重巡","伊吹","Ibuki","冬籠の夢","お正月","1180","常設販売","L2D","通常背景","","2018年12月27日",""],
	["ユニオン","軽巡","セントルイス","St_Louis","ティプシースノー","お正月","1080","常設販売","L2D","通常背景","","2018年12月27日",""],
	["ユニオン","軽巡","モントピリア","Montpelier","雪夜の華","お正月","880","常設販売","通常","通常背景","","2018年12月27日",""],
	["ロイヤル","戦艦","プリンス・オブ・ウェールズ","Prince_of_Wales","風流装束・桜","お正月","880","常設販売","通常","通常背景","","2018年12月27日",""],
	["重桜","戦艦","出雲","Izumo","出雲千本桜","お正月","880","常設販売","通常","通常背景","","2018年12月27日",""],
	["重桜","駆逐","磯風","Isokaze","新年大合戦","お正月","780","常設販売","通常","通常背景","","2018年12月27日",""],
	["ユニオン","軽巡","ヘレナ","Helena","青い鳥の正月","お正月","780","常設販売","通常","通常背景","","2018年12月27日",""],
	["重桜","重巡","足柄","Ashigara","幕間少憩","お正月","780","常設販売","通常","通常背景","","2018年12月27日",""],
	["ユニオン","軽巡","クリーブランド","Cleveland","ときめきモメント","ケッコン","600","指輪を贈る","通常","","","2018年12月27日",""],
	["重桜","重巡","愛宕","Atago","白き約束","ケッコン","600","指輪を贈る","通常","","","2018年12月27日",""],
	["重桜","空母","蒼龍","Souryuu","蒼龍改","改造","","近代化改修","通常","","","2018年12月27日",""],
	["重桜","空母","飛龍","Hiryuu","飛龍改","改造","","近代化改修","通常","","","2018年12月27日",""],
	["ロイヤル","駆逐","シグニット","Cygnet","冬のデート","お正月","","限定イベ","通常","通常背景","","2018年12月27日",""],
	["重桜","駆逐","初春","Hatsuharu","雪の初春","その他","700","常設販売","通常","","","2019年1月10日",""],
	["重桜","駆逐","夕立","Yuudachi","Meat Bun Hunter","その他","","日本未実装","通常","","","2019年1月10日","大陸限定ローソンコラボ"],
	["ユニオン","重巡","ヴィンセンス","Vincennes","イージースクール","学園","780","常設販売","通常","通常背景","","2019年1月17日",""],
	["ロイヤル","軽巡","シリアス","Sirius","ホワイトローズ","パーティー","880","常設販売","通常","通常背景","","2019年1月24日",""],
	["ロイヤル","戦艦","デューク・オブ・ヨーク","Duke_of_York","永夜のカローラ","パーティー","880","常設販売","通常","通常背景","","2019年1月24日",""],
	["ロイヤル","空母","ヴィクトリアス","Victorious","女神の休日","私服","880","常設販売","通常","通常背景","","2019年1月24日",""],
	["ロイヤル","軽巡","ジャマイカ","Jamaica","Dark Bolt","私服","780","常設販売","通常","通常背景","","2019年1月24日","ヤマハ発動機コラボ"],
	["ロイヤル","軽巡","シェフィールド","Sheffield","クローク&ダガー","その他","700","常設販売","通常","","","2019年1月24日",""],
	["ロイヤル","軽巡","ベルファスト","Belfast","彩雲の薔薇","東煌風","1180","常設販売","L2D","通常背景","","2019年1月31日",""],
	["ユニオン","駆逐","ラフィー","Laffey","春待ちウサギ","東煌風","1080","常設販売","L2D","通常背景","","2019年1月31日",""],
	["東煌","駆逐","太原","Tai_Yuan","春騒ぎの玄亀","東煌風","1080","常設販売","L2D","通常背景","","2019年1月31日",""],
	["ロイヤル","戦艦","モナーク","Monarch","ホワイト・ウォリック","東煌風","880","常設販売","通常","通常背景","","2019年1月31日",""],
	["ロイヤル","軽母","セントー","Centaur","清冽な春風","東煌風","880","常設販売","通常","通常背景","","2019年1月31日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","ブライトビオニー","東煌風","880","常設販売","通常","通常背景","","2019年1月31日",""],
	["ユニオン","駆逐","マラニー","Mullany","慶陽の手料理特訓","東煌風","780","常設販売","通常","通常背景","","2019年1月31日",""],
	["重桜","駆逐","綾波","Ayanami","波濤新歳","東煌風","780","常設販売","通常","通常背景","","2019年1月31日",""],
	["重桜","駆逐","夕暮","Yuugure","春の夕暮","東煌風","780","常設販売","通常","通常背景","","2019年1月31日",""],
	["ロイヤル","軽巡","キュラソー","Curacoa","東国の艶彩","東煌風","780","常設販売","通常","通常背景","","2019年1月31日",""],
	["ロイヤル","軽巡","カーリュー","Curlew","東国の清麗","東煌風","780","常設販売","通常","通常背景","","2019年1月31日",""],
	["ロイヤル","軽母","チェイサー","Chaser","東煌見聞録","東煌風","780","常設販売","通常","通常背景","","2019年1月31日",""],
	["ユニオン","空母","レキシントン","Lexington","春華の歌","東煌風","780","常設販売","通常","通常背景","","2019年1月31日",""],
	["ユニオン","駆逐","キンバリー","Kimberly","安陽の異文化勉強","東煌風","","コアデータ","通常","通常背景","","2019年1月31日",""],
	["重桜","駆逐","雪風","Yukikaze","ポカポカ春模様","ケッコン","600","指輪を贈る","通常","","","2019年1月31日",""],
	["ロイヤル","戦艦","ウォースパイト","Warspite","ウォースパイト改","改造","","近代化改修","通常","","","2019年1月31日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","憧れの遊園地","私服","1080","常設販売","L2D","通常背景","","2019年2月14日",""],
	["重桜","戦艦","扶桑","Fuso","モフモフ内助","居間着","780","常設販売","通常","通常背景","","2019年2月14日",""],
	["ロイヤル","駆逐","ジャベリン","Javelin","幸せのジューンブライド","ケッコン","600","指輪を贈る","通常","","","2019年2月14日",""],
	["重桜","戦艦","山城","Yamashiro","白無垢大作戦！？","ケッコン","600","指輪を贈る","通常","","","2019年2月14日",""],
	["ユニオン","駆逐","シムス","Sims","シムス改","改造","","近代化改修","通常","","","2019年2月21日",""],
	["ユニオン","空母","シャングリラ","Shangri-La","ユートピアの蒐集家","私服","880","限定販売","通常","通常背景","","2019年2月28日",""],
	["ユニオン","重巡","ポートランド","Portland","学園でインディちゃんと！","学園","780","常設販売","通常","通常背景","","2019年2月28日",""],
	["ユニオン","重巡","インディアナポリス","Indianapolis","学園でお姉ちゃんと……","学園","780","常設販売","通常","通常背景","","2019年2月28日",""],
	["ユニオン","軽母","インディペンデンス","Independence","此方の学園へ","学園","780","限定販売","通常","通常背景","","2019年2月28日",""],
	["重桜","戦艦","長門","Nagato","御狐の寝間着","居間着","880","常設販売","通常","通常背景","","2019年3月22日",""],
	["重桜","駆逐","宵月","Yoizuki","運動会の準備","スポーツ","780","常設販売","通常","通常背景","","2019年3月22日",""],
	["重桜","巡戦","金剛","Kongou","華鳥風月","お正月","780","常設販売","通常","通常背景","","2019年3月22日",""],
	["ロイヤル","空母","イラストリアス","Illustrious","異国風衣装（イラストリアス）","その他","800","常設販売","通常","","","2019年3月22日",""],
	["ロイヤル","駆逐","シグニット","Cygnet","オファーはメイドさん","メイド","780","限定販売","通常","通常背景","","2019年3月22日",""],
	["重桜","戦艦","陸奥","Mutsu","センゴク☆センカン","その他","780","常設販売","通常","通常背景","","2019年3月22日",""],
	["重桜","戦艦","三笠","Mikasa","花見日和","その他","880","限定販売","通常","通常背景","","2019年4月4日",""],
	["重桜","軽巡","夕張","Yuubari","夕張改","改造","","近代化改修","通常","","","2019年4月4日",""],
	["KizunaAI","駆逐","キズナアイ","KizunaAI","Sakura Festival","その他","780","限定販売","通常","通常背景","","2019年4月26日","KizunaAIコラボ"],
	["ユニオン","駆逐","ラフィー","Laffey","ウサウサ店員さん","その他","700","常設販売","通常","","","2019年4月26日","ココイチコラボ"],
	["ロイヤル","駆逐","ジャベリン","Javelin","制服はお揃い♪","その他","700","常設販売","通常","","","2019年4月26日","ココイチコラボ"],
	["重桜","駆逐","綾波","Ayanami","壱式給仕海軍制服","その他","700","常設販売","通常","","","2019年4月26日","ココイチコラボ"],
	["鉄血","駆逐","Z23","Z23","マニュアルスタイル","その他","700","常設販売","通常","","","2019年4月26日","ココイチコラボ"],
	["東煌","駆逐","鞍山","An_Shan","The Cornett of Peace","その他","700","限定販売","通常","","","2019年4月26日",""],
	["ユニオン","空母","サラトガ","Saratoga","バーチャルアイドル","その他","700","限定販売","通常","通常背景","","2019年4月26日","KizunaAIコラボ"],
	["重桜","駆逐","如月","Kisaragi","如月改","改造","","近代化改修","通常","","","2019年4月26日",""],
	["ユニオン","駆逐","ブッシュ","Bush","リトルペインター","私服","700","限定販売","通常","","","2019年5月9日",""],
	["ユニオン","軽巡","メンフィス","Memphis","カジュアルバケーション","私服","700","限定販売","通常","","","2019年5月9日",""],
	["ロイヤル","軽母","ハーミーズ","Hermes","ハーミーズ改","改造","","近代化改修","通常","","","2019年5月9日",""],
	["重桜","工作","明石","Akashi","島へようこそ！","その他","","限定イベ","通常","","","2019年5月20日","BOOTHコラボ"],
	["鉄血","潜水","U-556","U-556","ハッピーナイト","その他","","コアデータ","通常","","","2019年5月20日",""],
	["鉄血","潜水","U-73","U-73","理科実験タイム！","その他","","常設イベ","通常","","","2019年5月23日",""],
	["鉄血","軽巡","ケルン","Kerun","ケルン改","改造","","近代化改修","通常","","","2019年5月23日",""],
	["鉄血","戦艦","ビスマルク","Bismarck","鉄血の威光","パーティー","1180","常設販売","L2D","通常背景","","2019年5月30日",""],
	["ロイヤル","空母","アーク・ロイヤル","Ark_Royal","バンケットガーディアン","パーティー","1080","常設販売","L2D","通常背景","","2019年5月30日",""],
	["ロイヤル","戦艦","キング・ジョージ5世","King_George_V","ウィンザー・ローズ","パーティー","880","常設販売","通常","通常背景","","2019年5月30日",""],
	["ユニオン","戦艦","ジョージア","Georgia","サウスタウンパール","パーティー","800","常設販売","通常","","","2019年5月30日",""],
	["重桜","駆逐","時雨","Shigure","イブニングラッキースター","パーティー","780","常設販売","通常","通常背景","","2019年5月30日",""],
	["鉄血","駆逐","Z23","Z23","麗しきアーベントクライト","パーティー","780","常設販売","通常","通常背景","","2019年5月30日",""],
	["ユニオン","軽巡","ヘレナ","Helena","君と踊りを","パーティー","780","常設販売","通常","通常背景","","2019年5月30日",""],
	["鉄血","重巡","アドミラル・グラーフ・シュペー","Admiral_Graf.Spee","未知の記念日","パーティー","780","常設販売","通常","通常背景","","2019年5月30日",""],
	["ユニオン","空母","ヨークタウン","Yorktown","優雅と微酔の夜","パーティー","780","常設販売","通常","通常背景","","2019年5月30日",""],
	["ユニオン","空母","ホーネット","Hornet","Bubbly　Anniversary！","パーティー","780","常設販売","通常","通常背景","","2019年5月30日",""],
	["重桜","駆逐","夕暮","Yuugure","遊宴の花","パーティー","","限定イベ","通常","通常背景","","2019年5月30日",""],
	["鉄血","駆逐","Z1","Z1","Z1改","改造","","近代化改修","通常","","","2019年6月6日",""],
	["鉄血","軽巡","ライプツィヒ","Leipzig","ライプツィヒ改","改造","","近代化改修","通常","","","2019年6月6日",""],
	["ロイヤル","軽巡","スウィフトシュア","Swiftsure","自習室のシクラメン","学園","880","常設販売","通常","通常背景","","2019年6月13日",""],
	["ロイヤル","駆逐","マッチレス","Matchless","エスコートしてくださーい！","私服","780","常設販売","通常","通常背景","","2019年6月13日",""],
	["ロイヤル","軽母","チェイサー","Chaser","ゲーマースタイル","私服","780","常設販売","通常","通常背景","","2019年6月13日",""],
	["ロイヤル","軽巡","シリアス","Sirius","盛夏のセイリオス","水着","1180","限定販売","L2D","通常背景","","2019年6月13日",""],
	["ロイヤル","軽巡","フィジー","Fiji","ファッションスタイル？","私服","700","常設販売","通常","","","2019年6月13日",""],
	["ロイヤル","軽巡","キュラソー","Curacoa","キュラソー改","改造","","近代化改修","通常","","","2019年6月13日",""],
	["ロイヤル","軽巡","カーリュー","Curlew","カーリュー改","改造","","近代化改修","通常","","","2019年6月13日",""],
	["ヴィシア","駆逐","ル・マラン","Le_Malin","少女のルヴェリテ","居間着","800","常設販売","通常","","","2019年6月27日",""],
	["アイリス","駆逐","フォルバン","Forbin","エコール・ド・シュヴァリエ","学園","780","常設販売","通常","通常背景","","2019年6月27日",""],
	["ヴィシア","駆逐","ル・マルス","Le_Mars","スコレア・ウルーズ","学園","780","常設販売","通常","通常背景","","2019年6月27日",""],
	["ヴィシア","巡戦","ダンケルク","Dunkerque","昼下がりのヴィーニュス","私服","780","常設販売","通常","通常背景","","2019年6月27日",""],
	["アイリス","駆逐","ルピニャート","Lopiniatre","マホウツカイの夏","水着","780","常設販売","通常","通常背景","","2019年6月27日",""],
	["ロイヤル","駆逐","ジャベリン","Javelin","びそくぜんしんっ！","学園","","常設イベ","通常","通常背景","","2019年6月27日",""],
	["アイリス","軽巡","エミール・ベルタン","Emile_Bertin","エミール・ベルタン改","改造","","近代化改修","通常","","","2019年6月27日",""],
	["重桜","潜水","伊168","I168","今日はお祭り気分！","夏祭り","880","限定販売","通常","通常背景","","2019年7月18日",""],
	["鉄血","潜水","U-101","U-101","学園のPosaunist","学園","880","限定販売","通常","通常背景","","2019年7月18日",""],
	["重桜","潜水","伊25","I25","ウサギとサンゴ礁","学園","780","限定販売","通常","通常背景","","2019年7月18日",""],
	["ロイヤル","重巡","ロンドン","London","ロンドン改","改造","","近代化改修","通常","","","2019年7月18日",""],
	["重桜","潜水","伊56","I56","隅っこの向日葵","学園","","常設イベ","通常","通常背景","","2019年7月18日",""],
	["ユニオン","重巡","ボルチモア","Baltimore","エースの放課後","学園","880","常設販売","通常","通常背景","","2019年7月31日",""],
	["ユニオン","潜水","カヴァラ","Cavalla","コンビニ作戦！","学園","880","常設販売","通常","通常背景","","2019年7月31日",""],
	["ユニオン","軽巡","バーミンガム","Birmingham","ナイト・イン・レッド","学園","780","常設販売","通常","通常背景","","2019年7月31日",""],
	["ユニオン","軽母","バターン","Bataan","ふわふわパジャマ","居間着","780","常設販売","通常","通常背景","","2019年7月31日",""],
	["ユニオン","駆逐","エールウィン","Aylwin","サンデーアクアリウム","私服","700","常設販売","通常","","有り","2019年7月31日",""],
	["ユニオン","空母","サラトガ","Saratoga","青き海のチャリティーライブ！","その他","","コラボイベ","通常","","","2019年8月7日","世界自然保護基金コラボ"],
	["ユニオン","戦艦","ジョージア","Georgia","ラニアースワン","水着","880","限定販売","通常","通常背景","","2019年8月15日",""],
	["ヴィシア","戦艦","ガスコーニュ","Gascogne","夏期環境対応シェル","水着","880","限定販売","通常","通常背景","有り","2019年8月15日",""],
	["ユニオン","駆逐","デューイ","Dewey","夏に憧れ","水着","780","限定販売","通常","通常背景","","2019年8月15日",""],
	["ロイヤル","重巡","サセックス","Sussex","太陽とチューリップ","水着","780","限定販売","通常","通常背景","","2019年8月15日",""],
	["ロイヤル","駆逐","ジュノー(駆逐)","Juno(Destroyer)","ちょっと美味しい日","夏祭り","","チケット","通常","通常背景","有り","2019年8月22日",""],
	["ロイヤル","駆逐","ヴァンパイア","Vampire","夜姫の正装","夏祭り","1080","限定販売","L2D","通常背景","","2019年8月29日",""],
	["ユニオン","軽巡","ホノルル","Honolulu","二人のお祭り","夏祭り","1080","限定販売","L2D","通常背景","有り","2019年8月29日",""],
	["重桜","駆逐","北風","Kitakaze","会場制覇！","夏祭り","880","限定販売","通常","通常背景","有り","2019年8月29日",""],
	["重桜","空母","瑞鶴","Zuikaku","祭華の鶴","夏祭り","880","限定販売","通常","通常背景","有り","2019年8月29日",""],
	["重桜","駆逐","雷","Ikazuchi","オマツリイカツチ","夏祭り","780","限定販売","通常","通常背景","","2019年8月29日",""],
	["重桜","駆逐","電","Inazuma","オハナビイナヅマ","夏祭り","780","限定販売","通常","通常背景","","2019年8月29日",""],
	["重桜","駆逐","睦月","Mutsuki","アメさん祭り！","夏祭り","780","限定販売","通常","通常背景","","2019年8月29日",""],
	["ロイヤル","軽巡","シェフィールド","Sheffield","憩いのひととき","夏祭り","780","限定販売","通常","通常背景","有り","2019年8月29日",""],
	["重桜","潜水","伊26","I26","花火見物の前に","夏祭り","780","限定販売","通常","通常背景","有り","2019年8月29日",""],
	["重桜","巡戦","霧島","Kirishima","ブレイブリーサマー","私服","780","限定販売","通常","通常背景","","2019年9月5日",""],
	["ロイヤル","軽巡","ブラック・プリンス","Black_Prince","ホワイトプリンセス","水着","1080","限定販売","L2D","通常背景","","2019年9月5日",""],
	["サディア","駆逐","カラビニエーレ","Carabiniere","スッキリ日曜チョイス","私服","780","常設販売","通常","通常背景","","2019年9月11日",""],
	["サディア","重巡","ザラ","Zara","水辺の出逢い","水着","1180","常設販売","L2D","通常背景","","2019年9月11日",""],
	["サディア","戦艦","リットリオ","Littorio","ナポリに輝け","水着","880","常設販売","通常","通常背景","有り","2019年9月11日",""],
	["ロイヤル","空母","フォーミダブル","Formidable","ロイヤルレディの海","水着","880","常設販売","通常","通常背景","有り","2019年9月11日",""],
	["サディア","重巡","トレント","Trento","マルチプル・テンプテーション","水着","780","常設販売","通常","通常背景","有り","2019年9月11日",""],
	["サディア","戦艦","ジュリオ・チェザーレ","Giulio_Cesare","フィットネスマスター","居間着","700","常設販売","通常","","","2019年9月11日",""],
	["重桜","駆逐","不知火","Shiranui","月餅はいかが？","私服","","限定イベ","通常","通常背景","有り","2019年9月11日",""],
	["重桜","空母","翔鶴","Shoukaku","風と舞う鶴","パーティー","1180","常設販売","L2D","通常背景","","2019年9月19日",""],
	["重桜","駆逐","夕立","Yuudachi","お肉パーティー","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["ユニオン","軽巡","シアトル","Seattle","ゴージャスパーティー","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["ロイヤル","軽巡","ベルファスト","Belfast","優雅にして高貴な従者","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["重桜","重巡","伊吹","Ibuki","宴のかざばな","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["鉄血","重巡","プリンツ・オイゲン","Prinz_Eugen","ヴァイン・コーンブルメ","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["鉄血","重巡","ローン","Roon","灰と紅の微笑み","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["鉄血","戦艦","ティルピッツ","Tirpitz","鉄血の氷風","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["ヴィシア","戦艦","ジャン・バール","Jean_Bart","不羈なブラッドストーン","パーティー","880","常設販売","通常","通常背景","","2019年9月19日",""],
	["鉄血","潜水","U-47","U-47","Eigenen Raum","パーティー","880","常設販売","通常","通常背景","有り","2019年9月19日",""],
	["鉄血","重巡","ドイッチュラント","Deutschland","魔姫の夜宴","パーティー","780","常設販売","通常","通常背景","","2019年9月19日",""],
	["重桜","駆逐","吹雪","Fubuki","看板娘ブッキー","その他","","コラボイベ","通常","通常背景","","2019年9月19日","アトレ秋葉原コラボ"],
	["重桜","駆逐","大潮","Ooshio","ほろ酔いパーティー","パーティー","","常設イベ","通常","通常背景","","2019年9月19日",""],
	["重桜","戦艦","山城","Yamashiro","看板娘大作戦！","その他","","コラボイベ","通常","通常背景","","2019年9月19日","アトレ秋葉原コラボ"],
	["アイリス","潜水","シュルクーフ","Surcouf","ショッピングデイズ","私服","1080","常設販売","L2D","通常背景","","2019年9月26日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","アニバーサリードライブ！","私服","880","常設販売","通常","通常背景","","2019年9月26日",""],
	["ユニオン","空母","エセックス","Essex","ルート66の旅","私服","880","限定販売","通常","通常背景","","2019年9月26日","ヤマハ発動機コラボ"],
	["ユニオン","駆逐","バッチ","Bache","華麗なるスピードスター","私服","780","常設販売","通常","通常背景","","2019年9月26日",""],
	["重桜","駆逐","暁","Akatsuki","モーターニンジャ暁","私服","780","限定販売","通常","通常背景","","2019年9月26日","ヤマハ発動機コラボ"],
	["ユニオン","軽巡","クリーブランド","Cleveland","ロードトラベラー","私服","780","常設販売","通常","通常背景","","2019年9月26日",""],
	["重桜","駆逐","時雨","Shigure","時雨改","改造","","近代化改修","通常","","","2019年9月26日",""],
	["重桜","駆逐","夕暮","Yuugure","夕暮改","改造","","近代化改修","通常","","","2019年9月26日",""],
	["ロイヤル","軽巡","ジャマイカ","Jamaica","ハイウェイ・スター","私服","","限定イベ","通常","通常背景","","2019年9月26日","ヤマハ発動機コラボ"],
	["ロイヤル","駆逐","ジュピター","Jupiter","放送待機中","居間着","","限定イベ","通常","通常背景","","2019年9月26日",""],
	["ロイヤル","重巡","ヨーク","York","真理を求めし者","学園","780","限定販売","通常","通常背景","","2019年10月10日",""],
	["重桜","戦艦","山城","Yamashiro","制服大作戦！","学園","780","限定販売","通常","通常背景","","2019年10月10日",""],
	["鉄血","潜水","U-110","U-110","Kleiner Hai","学園","780","限定販売","通常","通常背景","","2019年10月17日",""],
	["鉄血","巡戦","グナイゼナウ","Gneisenau","サキュバスナイトメア","ハロウィン","1080","常設販売","L2D","通常背景","","2019年10月23日",""],
	["ユニオン","駆逐","スモーリー","Smalley","お菓子トランスレーター","ハロウィン","780","常設販売","通常","通常背景","","2019年10月23日",""],
	["重桜","駆逐","三日月","Mikazuki","タイヤキョンシー","ハロウィン","780","常設販売","通常","通常背景","","2019年10月23日",""],
	["ロイヤル","軽巡","エディンバラ","Edinburgh","お菓子メイド ","ハロウィン","780","常設販売","通常","通常背景","","2019年10月23日",""],
	["ロイヤル","砲艦","エレバス","Erebus","仮装のウィッチクラフト","ハロウィン","780","常設販売","通常","通常背景","","2019年10月23日",""],
	["ロイヤル","砲艦","アバークロンビー","Abercrombie","ビックリカボチャ！","ハロウィン","780","常設販売","通常","通常背景","","2019年10月23日",""],
	["ユニオン","軽巡","メンフィス","Memphis","ミスティックナイト","ハロウィン","","常設イベ","通常","通常背景","","2019年10月23日",""],
	["ユニオン","駆逐","エルドリッジ","Eldridge","ニャンニャンアイドル？","LIVE","1100","常設販売","L2D","動く背景","","2019年10月31日",""],
	["東煌","軽巡","寧海","Ning_Hai","東煌シスターズ！・N","LIVE","1100","常設販売","L2D","動く背景","","2019年10月31日",""],
	["東煌","軽巡","平海","Ping_Hai","東煌シスターズ！・P","LIVE","1100","常設販売","L2D","動く背景","","2019年10月31日",""],
	["鉄血","重巡","アドミラル・グラーフ・シュペー","Admiral_Graf.Spee","Tekketsu kawaii","LIVE","1100","常設販売","L2D","動く背景","","2019年10月31日",""],
	["ユニオン","駆逐","ラフィー","Laffey","ウサウサアイドル・てきとー","LIVE","800","常設販売","通常","動く背景","","2019年10月31日",""],
	["重桜","駆逐","綾波","Ayanami","おませアイドル・困惑中","LIVE","800","常設販売","通常","動く背景","","2019年10月31日",""],
	["鉄血","駆逐","Z23","Z23","真面目アイドル・マネージャーも兼任！？","LIVE","800","常設販売","通常","動く背景","","2019年10月31日",""],
	["ロイヤル","駆逐","ジャベリン","Javelin","元気アイドル・やる気120％！","LIVE","","コアデータ","通常","動く背景","","2019年10月31日",""],
	["重桜","駆逐","吹雪","Fubuki","スノーストーム！","LIVE","","常設イベ","通常","動く背景","","2019年10月31日",""],
	["ロイヤル","軽巡","ベルファスト","Belfast","メイド長とお買い物","私服","","コラボイベ","通常","通常背景","","2019年11月14日","大陸版ポッキーコラボ"],
	["ロイヤル","軽巡","グラスゴー","Glasgow","メイドさんは同級生","学園","780","限定販売","通常","通常背景","","2019年11月21日",""],
	["ホロライブ","潜水","湊あくあ","Minato_Aqua","マリンメイド","メイド","900","限定販売","通常","通常背景","","2019年11月27日","ホロライブコラボ"],
	["ホロライブ","駆逐","夏色まつり","Natsuiro_Matsuri","まつりの休日","私服","800","限定販売","通常","通常背景","","2019年11月27日","ホロライブコラボ"],
	["ホロライブ","軽母","紫咲シオン","Murasaki_Shion","バーチャル魔法使い","私服","800","限定販売","通常","通常背景","","2019年11月27日","ホロライブコラボ"],
	["ホロライブ","駆逐","白上フブキ","Shirakami_Fubuki","ビーチのキツネ","水着","900","限定販売","通常","通常背景","","2019年11月27日","ホロライブコラボ"],
	["ホロライブ","空母","ときのそら","Tokino_Sora","晴れた夏空の下で","水着","900","限定販売","通常","通常背景","","2019年11月27日","ホロライブコラボ"],
	["ホロライブ","重巡","百鬼あやめ","Nakiri_Ayame","夏の百鬼","水着","800","限定販売","通常","通常背景","","2019年11月27日","ホロライブコラボ"],
	["ホロライブ","空母","大神ミオ","Ookami_Mio","サマーバカンス","水着","800","限定販売","通常","通常背景","","2019年11月27日","ホロライブコラボ"],
	["ユニオン","空母","エンタープライズ","Enterprise","羽ばたける自由の翼","その他","","特典コード","通常","","","2019年12月4日",""],
	["ユニオン","軽巡","シアトル","Seattle","クリスマス納会！","クリスマス","900","常設販売","通常","動く背景","","2019年12月19日",""],
	["ロイヤル","軽巡","ネプチューン","Neptune","トナカイプリンセス","クリスマス","900","常設販売","通常","動く背景","","2019年12月19日",""],
	["ユニオン","駆逐","デューイ","Dewey","冬に感謝","クリスマス","800","常設販売","通常","動く背景","","2019年12月19日",""],
	["重桜","駆逐","清波","Kiyonami","クリスマスの赤ずきんさん？","クリスマス","800","常設販売","通常","動く背景","","2019年12月19日",""],
	["ユニオン","軽巡","コンコード","Concord","スウィーティークリスマス","クリスマス","800","常設販売","通常","動く背景","","2019年12月19日",""],
	["重桜","軽巡","五十鈴","Isuzu","ポカポカクリスマス","クリスマス","800","常設販売","通常","動く背景","","2019年12月19日",""],
	["重桜","軽巡","阿賀野","Agano","聖夜のカラカイ","クリスマス","800","常設販売","通常","動く背景","","2019年12月19日",""],
	["重桜","駆逐","若葉","Wakaba","若葉、クリスマス限定！","クリスマス","","常設イベ","通常","動く背景","","2019年12月19日",""],
	["重桜","軽巡","能代","Noshiro","祭りの秘境？","お正月","1180","常設販売","L2D","通常背景","","2019年12月26日",""],
	["重桜","戦艦","駿河","Suruga","百花の慶雲","お正月","1180","常設販売","L2D","通常背景","","2019年12月26日",""],
	["重桜","軽母","龍鳳","Ryuuhou","鳳舞う正月","お正月","1180","常設販売","L2D","通常背景","","2019年12月26日",""],
	["重桜","戦艦","長門","Nagato","御狐の輝振袖","お正月","880","常設販売","通常","通常背景","","2019年12月26日",""],
	["鉄血","戦艦","フリードリヒ・デア・グローセ","Friedrich_der_Grosse","雅楽の闇衣","お正月","880","常設販売","通常","通常背景","有り","2019年12月26日",""],
	["重桜","駆逐","綾波","Ayanami","年越しの鼓動","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["重桜","駆逐","響","Hibiki","正月デビル響ちゃん","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["重桜","駆逐","霞","Kasumi","ぽかぽか正月","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["鉄血","駆逐","Z35","Z35","Projekt Kirschblüte","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["ユニオン","軽巡","クリーブランド","Cleveland","お正月バーサス！","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["ロイヤル","軽巡","サウサンプトン","Southampton","お正月のリトルナイト","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["重桜","巡戦","霧島","Kirishima","着流し烈光","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","祈りのウメとスノー","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["ロイヤル","空母","アーク・ロイヤル","Ark_Royal","正月の守護者","お正月","780","常設販売","通常","通常背景","","2019年12月26日",""],
	["ユニオン","駆逐","ラフィー","Laffey","ウサウサブライド","ケッコン","600","指輪を贈る","通常","","","2019年12月26日",""],
	["重桜","駆逐","江風","Kawakaze","甘夢のアーキテクチャ","ケッコン","600","指輪を贈る","通常","","","2019年12月26日",""],
	["重桜","駆逐","初春","Hatsuharu","初春改","改造","","近代化改修","通常","","","2019年12月26日",""],
	["重桜","軽巡","鬼怒","Kinu","鬼怒改","改造","","近代化改修","通常","","","2019年12月26日",""],
	["重桜","軽巡","鬼怒","Kinu","正月の剣鬼","お正月","","チケット","通常","通常背景","","2019年12月26日",""],
	["重桜","軽巡","阿賀野","Agano","デートゲーム？","私服","780","限定販売","通常","通常背景","","2020年1月16日",""],
	["重桜","駆逐","雪風","Yukikaze","冬のユキカゼ","東煌風","1200","常設販売","L2D","動く背景","","2020年1月21日",""],
	["重桜","空母","大鳳","Taihou","春の暁に鳳歌う","東煌風","1200","常設販売","L2D","動く背景","","2020年1月21日",""],
	["重桜","超巡","吾妻","Azuma","語らいの春霞","東煌風","1200","常設販売","L2D","動く背景","","2020年1月21日",""],
	["ロイヤル","軽巡","シリアス","Sirius","青雲映す碧波","東煌風","900","常設販売","通常","動く背景","","2020年1月21日",""],
	["ロイヤル","軽巡","スウィフトシュア","Swiftsure","白玉の佳麗","東煌風","900","常設販売","通常","動く背景","","2020年1月21日",""],
	["重桜","重巡","伊吹","Ibuki","桃符を執りて","東煌風","900","常設販売","通常","動く背景","","2020年1月21日",""],
	["ロイヤル","空母","イラストリアス","Illustrious","オトメユリの輝き","東煌風","900","常設販売","通常","動く背景","","2020年1月21日",""],
	["ユニオン","駆逐","ハルゼー・パウエル","Halsey_Powell","春節のラッキースター","東煌風","800","常設販売","通常","動く背景","","2020年1月21日",""],
	["ユニオン","軽巡","ビロクシ","Biloxi","麗人ギャング","東煌風","800","常設販売","通常","通常背景","有り","2020年1月21日",""],
	["ロイヤル","軽巡","ブラック・プリンス","Black_Prince","フェアメイド・スプリング","東煌風","800","常設販売","通常","動く背景","","2020年1月21日",""],
	["ロイヤル","軽巡","グロスター","Gloucester","ピオレ・ブリリアント","東煌風","800","常設販売","通常","通常背景","有り","2020年1月21日",""],
	["鉄血","重巡","ドイッチュラント","Deutschland","灯華の支配者","東煌風","800","常設販売","通常","動く背景","","2020年1月21日",""],
	["重桜","巡戦","比叡","Hiei","垂香の紅梅","東煌風","800","常設販売","通常","動く背景","","2020年1月21日",""],
	["鉄血","巡戦","シャルンホルスト","Scharnhorst","パンツァープフラオメ","東煌風","800","常設販売","通常","動く背景","","2020年1月21日",""],
	["東煌","軽巡","寧海","Ning_Hai","新年旅行in重桜","東煌風","780","常設販売","通常","通常背景","","2020年1月21日",""],
	["東煌","軽巡","平海","Ping_Hai","グルメ大遠征in重桜","東煌風","780","常設販売","通常","通常背景","","2020年1月21日",""],
	["重桜","駆逐","睦月","Mutsuki","春節アメさん！","東煌風","","限定イベ","通常","動く背景","","2020年1月21日",""],
	["東煌","軽巡","逸仙","Yat_Sen","鳳冠霞帔","ケッコン","600","指輪を贈る","通常","","","2020年1月21日",""],
	["ロイヤル","駆逐","アマゾン","Amazon","アマゾン改","改造","","近代化改修","通常","","","2020年1月21日",""],
	["ロイヤル","軽巡","ベルファスト","Belfast","凛冽なりし鋼の従者","その他","","特典コード","通常","","","2020年1月22日",""],
	["ロイヤル","駆逐","アカスタ","Acasta","元宵の灯籠祭","その他","780","常設販売","通常","通常背景","","2020年2月6日",""],
	["ロイヤル","軽巡","オーロラ","Aurora","渝城秘技","その他","1100","限定販売","L2D","動く背景","","2020年2月13日",""],
	["重桜","駆逐","浦波","Uranami","スノーヴァンガード","その他","700","限定販売","通常","通常背景","","2020年2月13日",""],
	["重桜","駆逐","長月","Nagatsuki","ニャンニャンメイド","メイド","780","常設販売","通常","通常背景","","2020年2月13日",""],
	["ユニオン","軽巡","コロンビア","Columbia","下校前のオデット","学園","780","常設販売","通常","通常背景","","2020年2月13日",""],
	["ロイヤル","駆逐","アーデント","Ardent","バレンタインの熱心","学園","780","常設販売","通常","通常背景","","2020年2月14日",""],
	["ロイヤル","駆逐","ジャベリン","Javelin","枕投げ大戦！","居間着","","特典コード","通常","通常背景","","2020年2月19日",""],
	["重桜","軽巡","長良","Nagara","春風ゆらり","東煌風","","限定イベ","通常","通常背景","","2020年2月21日",""],
	["北連","駆逐","グロズヌイ","Grozny","攫われた危険ウサギ","特殊演習","1080","常設販売","L2D","通常背景","","2020年2月27日",""],
	["北連","駆逐","タシュケント","Tashkent","解かされし巡洋艦","特殊演習","880","常設販売","通常","通常背景","","2020年2月27日",""],
	["北連","軽巡","アヴローラ","Avrora","囚われた曙光姫","特殊演習","880","常設販売","通常","通常背景","有り","2020年2月27日",""],
	["北連","軽巡","チャパエフ","Chapayev","縛られし白騎兵","特殊演習","880","常設販売","通常","通常背景","有り","2020年2月27日",""],
	["北連","戦艦","ソビエツカヤ・ロシア","Sovetskaya_Rossiya","怠けぬ監視者","特殊演習","880","常設販売","通常","通常背景","有り","2020年2月27日",""],
	["北連","駆逐","ミンスク","Minsk","雷閃めく監獄長","特殊演習","780","常設販売","通常","通常背景","","2020年2月27日",""],
	["北連","軽巡","パーミャチ・メルクーリヤ","Pamiat_Merkuria","挫かれし生意気","特殊演習","780","常設販売","通常","通常背景","","2020年2月27日",""],
	["北連","戦艦","ガングート","Gangut","立ちはだかる執行者","特殊演習","780","常設販売","通常","通常背景","","2020年2月27日",""],
	["重桜","工作","明石","Akashi","ソフマップへようこそ！","その他","","限定イベ","通常","","","2020年3月12日","ソフマップコラボ"],
	["重桜","軽母","龍驤","Ryuujou","ヒモノサムライ","居間着","780","常設販売","通常","通常背景","","2020年3月12日",""],
	["重桜","駆逐","綾波","Ayanami","特殊潜入作戦雨覆（マント）","その他","","特典コード","通常","","有り","2020年3月18日",""],
	["鉄血","駆逐","Z46","Z46","スカベンジハントレス","スポーツ","1180","常設販売","L2D","通常背景","","2020年3月19日",""],
	["ユニオン","駆逐","クーパー","Cooper","烈日のテニスバトル","スポーツ","1100","常設販売","L2D","動く背景","","2020年3月19日",""],
	["ユニオン","軽巡","リノ","Reno","波濤のチアリーダー","スポーツ","900","常設販売","通常","動く背景","","2020年3月19日",""],
	["ユニオン","重巡","ミネアポリス","Minneapolis","エクストリームゲームX","スポーツ","900","常設販売","通常","動く背景","","2020年3月19日",""],
	["ユニオン","重巡","ボルチモア","Baltimore","ブラックエース","スポーツ","900","常設販売","通常","動く背景","","2020年3月19日",""],
	["ユニオン","空母","イントレピッド","Intrepid","恐れなき一投","スポーツ","900","常設販売","通常","動く背景","","2020年3月19日",""],
	["ユニオン","重巡","ブレマートン","Bremerton","熱々トレーニング","スポーツ","880","常設販売","通常","通常背景","","2020年3月19日",""],
	["ユニオン","駆逐","バッチ","Bache","絢爛なるスポーツスター","スポーツ","800","常設販売","通常","動く背景","","2020年3月19日",""],
	["ユニオン","軽母","カサブランカ","Casablanca","応援団の休憩タイム","スポーツ","800","常設販売","通常","動く背景","","2020年3月19日",""],
	["ユニオン","潜水","ブルーギル","Bluegill","見習いエースフィルダー","スポーツ","800","常設販売","通常","動く背景","","2020年3月19日",""],
	["ユニオン","空母","サラトガ","Saratoga","異国風衣装（サラトガ）","その他","","常設イベ","通常","","","2020年3月19日",""],
	["ロイヤル","駆逐","シグニット","Cygnet","ロイヤルチアリング","スポーツ","780","常設販売","通常","通常背景","","2020年3月19日",""],
	["ユニオン","軽巡","マーブルヘッド","Marblehead","ボクシングギャル","スポーツ","700","常設販売","通常","","","2020年3月19日",""],
	["その他","駆逐","汎用型ブリ","Universal_Bulin","汎用型強化兵装（工作用）＋α","その他","","限定イベ","通常","","","2020年4月1日",""],
	["ユニオン","駆逐","ラフィー","Laffey","ピクニック・ハプニング！","私服","","特典コード","通常","通常背景","","2020年4月15日",""],
	["重桜","戦艦","土佐","Tosa","鳴子小夏","水着","880","常設販売","通常","通常背景","","2020年4月23日",""],
	["重桜","駆逐","花月","Hanazuki","白昼月、海辺の華","水着","780","常設販売","通常","通常背景","","2020年4月23日",""],
	["重桜","軽巡","那珂","Naka","浪華サマーフォクシー","水着","780","常設販売","通常","通常背景","","2020年4月23日",""],
	["重桜","重巡","足柄","Ashigara","色とりどりの夏","水着","780","常設販売","通常","通常背景","","2020年4月23日",""],
	["重桜","巡戦","比叡","Hiei","白浜の瑰麗","水着","780","常設販売","通常","通常背景","","2020年4月23日",""],
	["重桜","駆逐","巻波","Makinami","学園へGO！","学園","780","常設販売","通常","通常背景","","2020年4月23日",""],
	["重桜","駆逐","長波","Naganami","幸せのロングウェーブ","メイド","780","常設販売","通常","通常背景","","2020年4月23日",""],
	["重桜","軽巡","五十鈴","Isuzu","五十鈴改","改造","","近代化改修","通常","","","2020年4月23日",""],
	["ヴィシア","駆逐","タルテュ","Tartu","考えゴトの多い夏","水着","780","限定販売","通常","通常背景","有り","2020年5月7日",""],
	["アイリス","駆逐","ル・テメレール","Le_Temeraire","サマー・ルーちゃん！","水着","780","限定販売","通常","通常背景","","2020年5月14日",""],
	["鉄血","駆逐","Z23","Z23","新設基地・体験喫茶制服","その他","","特典コード","通常","","有り","2020年5月20日",""],
	["アイリス","軽巡","エミール・ベルタン","Emile_Bertin","Fantastiqueメイド","メイド","1080","常設販売","L2D","通常背景","","2020年5月21日",""],
	["ヴィシア","駆逐","ル・マラン","Le_Malin","隠れ家のマルコディ","水着","1180","常設販売","L2D","通常背景","","2020年5月21日",""],
	["アイリス","戦艦","リシュリュー","Richelieu","潮風のfleuron","水着","1180","常設販売","L2D","通常背景","有り","2020年5月21日",""],
	["ヴィシア","戦艦","ジャン・バール","Jean_Bart","秘密のAprès midi","水着","1180","常設販売","L2D","通常背景","有り","2020年5月21日",""],
	["アイリス","軽巡","ジャンヌ・ダルク","Jeanne_Darc","蒼浪の映画聖女","水着","880","常設販売","通常","通常背景","有り","2020年5月21日",""],
	["ヴィシア","重巡","アルジェリー","Algerie","白浜ヘヴンズフィール","水着","880","常設販売","通常","通常背景","有り","2020年5月21日",""],
	["鉄血","駆逐","Z23","Z23","ツーマンセルマッチ！","水着","780","常設販売","通常","通常背景","","2020年5月21日",""],
	["ヴィシア","駆逐","ヴォークラン","Vauquelin","天然純真サマーナイト","水着","780","常設販売","通常","通常背景","有り","2020年5月21日",""],
	["ロイヤル","軽巡","ベルファスト","Belfast","完璧すぎる代理店長","その他","800","限定販売","通常","","","2020年5月21日","ピザハットコラボ"],
	["ヴィシア","軽巡","ラ・ガリソニエール","La_Galissonniere","無垢なるPiscine","水着","780","常設販売","通常","通常背景","","2020年5月21日",""],
	["アイリス","空母","ベアルン","Bearn","アイリス・ライフガード","水着","780","常設販売","通常","通常背景","有り","2020年5月21日",""],
	["重桜","駆逐","吹雪","Fubuki","ドタバタウェイトレス！","その他","","限定イベ","通常","","","2020年5月21日","ピザハットコラボ"],
	["東煌","軽巡","平海","Ping_Hai","デリシャス・クリムゾン","パーティー","1100","常設販売","L2D","通常背景","有り","2020年5月28日",""],
	["ユニオン","軽巡","セントルイス","St_Louis","Luxury Handle","パーティー","1080","常設販売","L2D","通常背景","","2020年5月28日",""],
	["ロイヤル","軽巡","ダイドー","Dido","多感なるBisqueDoll","パーティー","900","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["ユニオン","戦艦","マサチューセッツ","Massachusetts","ドレッシービューティー","パーティー","900","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","英雄の儀典礼装","パーティー","900","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["ユニオン","潜水","アルバコア","Albacore","ミッション・アカンプリス","パーティー","900","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["サディア","戦艦","リットリオ","Littorio","カラブリア・アウレア","パーティー","880","常設販売","通常","通常背景","","2020年5月28日",""],
	["ユニオン","駆逐","ハムマン","Hammann","ポニデレ・キャッツンイヤー","パーティー","800","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["アイリス","駆逐","フォルバン","Forbin","フェット・シャンパーニュ","パーティー","800","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["ユニオン","軽巡","ビロクシ","Biloxi","羅府エンプレス","パーティー","800","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["重桜","軽巡","阿賀野","Agano","蒼き告白モルフォ","パーティー","800","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["東煌","軽巡","寧海","Ning_Hai","ゴージャス・ヴァイオレット","パーティー","800","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["ロイヤル","重巡","サセックス","Sussex","ワインと赤薔薇","パーティー","800","常設販売","通常","通常背景","有り","2020年5月28日",""],
	["ユニオン","潜水","カヴァラ","Cavalla","カラフルセレモニー！","パーティー","","常設イベ","通常","有り","","2020年5月28日",""],
	["ロイヤル","駆逐","エスキモー","Eskimo","アティギの問題児？","水着","780","常設販売","通常","通常背景","","2020年6月3日",""],
	["ユニオン","軽巡","サンディエゴ","San_Diego","ジューンブライドNo.1！","ケッコン","600","指輪を贈る","通常","","","2020年6月3日",""],
	["ユニオン","重巡","ミネアポリス","Minneapolis","トラッパーホワイト","ケッコン","600","指輪を贈る","通常","","","2020年6月3日",""],
	["鉄血","戦艦","フリードリヒ・デア・グローセ","Friedrich_der_Grosse","ユリカゴのセレモニー","ケッコン","600","指輪を贈る","通常","","","2020年6月3日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","純白なる夢の誓い","ケッコン","600","指輪を贈る","通常","","","2020年6月3日",""],
	["重桜","駆逐","初霜","Hatsushimo","初霜改","改造","","近代化改修","通常","","","2020年6月3日",""],
	["ユニオン","軽巡","ヘレナ","Helena","ヘレナ改","改造","","近代化改修","通常","","","2020年6月3日",""],
	["重桜","重巡","高雄","Takao","魅惑のフルドライブ","レースクイーン","900","常設販売","通常","通常背景","有り","2020年6月24日",""],
	["重桜","重巡","愛宕","Atago","凄艶のマックススピード","レースクイーン","900","常設販売","通常","通常背景","有り","2020年6月24日",""],
	["ロイヤル","戦艦","プリンス・オブ・ウェールズ","Prince_of_Wales","栄冠のビクトリーレーシング","レースクイーン","900","常設販売","通常","通常背景","有り","2020年6月24日",""],
	["ロイヤル","戦艦","デューク・オブ・ヨーク","Duke_of_York","誉笏のグロリアスフォーミュラ","レースクイーン","900","常設販売","通常","通常背景","","2020年6月24日",""],
	["重桜","空母","翔鶴","Shoukaku","疾翔の姉羽","レースクイーン","900","常設販売","通常","通常背景","有り","2020年6月24日",""],
	["重桜","空母","瑞鶴","Zuikaku","瞬速の真名","レースクイーン","900","常設販売","通常","通常背景","有り","2020年6月24日",""],
	["重桜","空母","大鳳","Taihou","恋情のコンパニオン","レースクイーン","900","常設販売","通常","通常背景","有り","2020年6月24日",""],
	["重桜","潜水","伊19","I19","おまくら天国","居間着","880","限定販売","通常","通常背景","","2020年6月24日",""],
	["ユニオン","空母","シャングリラ","Shangri-La","ロストワールドの探検者","私服","800","限定販売","通常","","有り","2020年6月24日",""],
	["ユニオン","軽巡","シアトル","Seattle","サンフィッシュスペル！","水着","880","限定販売","通常","通常背景","","2020年7月9日",""],
	["ロイヤル","軽巡","ハーマイオニー","Hermione","ピュアホワイトエンジェル","ホスピタル","1180","常設販売","L2D","通常背景","有り","2020年7月23日",""],
	["ロイヤル","戦艦","ハウ","Howe","ノーブルラウンジ","私服","880","常設販売","通常","通常背景","有り","2020年7月23日",""],
	["ロイヤル","軽母","パーシュース","Perseus","ナーセリー勤務タイム","ホスピタル","880","常設販売","通常","通常背景","有り","2020年7月23日",""],
	["重桜","巡戦","金剛","Kongou","タレント・ホスピタル","ホスピタル","780","常設販売","通常","通常背景","有り","2020年7月23日",""],
	["ロイヤル","戦艦","ヴァリアント","Valiant","リトルナースタイム","ホスピタル","780","常設販売","通常","通常背景","","2020年7月23日",""],
	["ロイヤル","空母","イーグル","Eagle","イーグルズ・クリニック","ホスピタル","780","常設販売","通常","通常背景","","2020年7月23日",""],
	["ロイヤル","駆逐","イカルス","Icarus","医療施設体験週？","ホスピタル","700","常設販売","通常","通常背景","","2020年7月23日",""],
	["鉄血","潜水","U-96","U-96","秘密の遊戯タイム","居間着","880","常設販売","通常","通常背景","","2020年8月20日",""],
	["ロイヤル","重巡","チェシャー","Cheshire","デーティングサマー！","水着","880","限定販売","通常","通常背景","有り","2020年8月20日",""],
	["ロイヤル","重巡","ドレイク","Drake","黄金鹿の無聊タイム","水着","880","限定販売","通常","通常背景","","2020年8月20日",""],
	["ロイヤル","重巡","ヨーク","York","碧波を召喚せしもの","水着","780","限定販売","通常","通常背景","","2020年8月20日",""],
	["鉄血","駆逐","Z26","Z26","友情シェアタイム","居間着","780","常設販売","通常","通常背景","有り","2020年8月20日",""],
	["ロイヤル","軽巡","ハーマイオニー","Hermione","ピュアホワイトホリデー","水着","1180","限定販売","L2D","通常背景","有り","2020年9月17日",""],
	["アイリス","潜水","シュルクーフ","Surcouf","Loisirs balnéaires","水着","1080","限定販売","L2D","通常背景","有り","2020年9月17日",""],
	["重桜","運送","樫野","Kashino","湯上がりプレシュアタイム","水着","1080","限定販売","L2D","通常背景","有り","2020年9月17日",""],
	["重桜","駆逐","涼月","Suzutsuki","涼月、浜辺にてお相手致す！","水着","880","限定販売","通常","通常背景","有り","2020年9月17日",""],
	["ユニオン","軽巡","リノ","Reno","サマー・スピンオフ","水着","880","限定販売","通常","通常背景","有り","2020年9月17日",""],
	["ロイヤル","軽巡","スウィフトシュア","Swiftsure","プライド・サービス","水着","880","限定販売","通常","通常背景","有り","2020年9月17日",""],
	["重桜","巡戦","天城","Amagi","走水静蓮","水着","880","限定販売","通常","通常背景","有り","2020年9月17日",""],
	["重桜","戦艦","紀伊","Kii","水辺への誘い","水着","880","限定販売","通常","通常背景","有り","2020年9月17日",""],
	["ユニオン","駆逐","ニコラス","Nicholas","夏の清掃ボランティア","水着","780","限定販売","通常","通常背景","","2020年9月17日",""],
	["ロイヤル","駆逐","イカルス","Icarus","ネレウス・デスカバリー","水着","780","限定販売","通常","","有り","2020年9月17日",""],
	["重桜","重巡","熊野","Kumano","ファンシーウェーブ","水着","780","限定販売","通常","通常背景","","2020年9月17日",""],
	["重桜","軽母","千歳","Chitose","夏陽燦々千歳","水着","780","限定販売","通常","通常背景","有り","2020年9月17日",""],
	["重桜","軽母","千代田","Chiyoda","碧波燦々千代田","水着","780","限定販売","通常","通常背景","有り","2020年9月17日",""],
	["ユニオン","重巡","ボルチモア","Baltimore","夜風Minuet","パーティー","1200","常設販売","L2D","動く背景","","2020年9月24日",""],
	["アイリス","重巡","サン・ルイ","Saint_Louis","華麗なる聖騎士","パーティー","1200","常設販売","L2D","動く背景","","2020年9月24日",""],
	["ユニオン","空母","エセックス","Essex","Craft Fairynight","パーティー","1200","常設販売","L2D","動く背景","有り","2020年9月24日",""],
	["重桜","駆逐","綾波","Ayanami","闇然礼装","パーティー","1100","常設販売","L2D","動く背景","有り","2020年9月24日",""],
	["重桜","軽巡","能代","Noshiro","夜饗の絶園","パーティー","900","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["重桜","空母","加賀","Kaga","白羽の貴華","パーティー","900","常設販売","通常","動く背景","","2020年9月24日",""],
	["重桜","空母","信濃","Shinano","満ち欠ける朧月","パーティー","900","常設販売","通常","動く背景","","2020年9月24日",""],
	["重桜","空母","赤城","Akagi","朱絹の余醺","パーティー","880","常設販売","通常","通常背景","","2020年9月24日",""],
	["重桜","駆逐","雷","Ikazuchi","払暁のイカヅチ","パーティー","800","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["重桜","駆逐","電","Inazuma","夕闇のイナヅマ","パーティー","800","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["重桜","駆逐","初霜","Hatsushimo","季節問わぬ幸せの祝宴よ","パーティー","800","常設販売","通常","動く背景","","2020年9月24日",""],
	["重桜","駆逐","有明","Ariake","時日問わぬ楽しい団らんよ","パーティー","800","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["ロイヤル","軽巡","シェフィールド","Sheffield","ブラックロウ・アウトフィット","パーティー","800","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["重桜","巡戦","榛名","Haruna","真緋のイノセンス","パーティー","800","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["ユニオン","軽母","インディペンデンス","Independence","ブランディング・I","パーティー","800","常設販売","通常","動く背景","","2020年9月24日",""],
	["鉄血","潜水","U-110","U-110","潜水鮫のカワイイ夢","パーティー","800","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["ユニオン","重巡","ウィチタ","Wichita","ジェネラル・バンケット","パーティー","800","常設販売","通常","動く背景","有り","2020年9月24日",""],
	["ユニオン","重巡","インディアナポリス","Indianapolis","サークルシティナイト","パーティー","","限定イベ","通常","通常背景","有り","2020年9月24日",""],
	["鉄血","駆逐","Z23","Z23","ハイラーテンシュヴァルツ","ケッコン","600","指輪を贈る","通常","","","2020年9月30日",""],
	["重桜","戦艦","三笠","Mikasa","艦前式裳","ケッコン","600","指輪を贈る","通常","","","2020年9月30日",""],
	["重桜","工作","明石","Akashi","白猫報恩す！","ケッコン","600","指輪を贈る","通常","","","2020年9月30日",""],
	["重桜","駆逐","有明","Ariake","有明改","改造","","近代化改修","通常","","","2020年9月30日",""],
	["ユニオン","軽母","プリンストン","Princeton","カヌートレーニング","水着","780","限定販売","通常","通常背景","","2020年10月12日",""],
	["ユニオン","重巡","ウィチタ","Wichita","ハロウィン・ドミネーター","ハロウィン","800","限定販売","通常","通常背景","","2020年10月22日",""],
	["ユニオン","駆逐","ベンソン","Benson","ウサウサ美少女☆HALLOWEEN","ハロウィン","780","限定販売","通常","通常背景","","2020年10月22日",""],
	["ユニオン","軽母","ロング・アイランド","Long_Island","幽霊さんのハロウィン生放送","ハロウィン","780","限定販売","通常","通常背景","","2020年10月22日",""],
	["ユニオン","駆逐","ラドフォード","Radford","キャンディマジック！","ハロウィン","","限定イベ","通常","通常背景","","2020年10月22日",""],
	["鉄血","駆逐","Z46","Z46","Schokolade★Schicksal","LIVE","1200","常設販売","L2D","動く背景","","2020年10月29日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","天使のMy Night","LIVE","1100","常設販売","L2D","動く背景","","2020年10月29日",""],
	["ユニオン","駆逐","ハムマン","Hammann","ケモミミパンチ！","LIVE","800","常設販売","通常","動く背景","","2020年10月29日",""],
	["ロイヤル","駆逐","ヴァンパイア","Vampire","夜姫inアイドルスタイル","LIVE","800","常設販売","通常","動く背景","","2020年10月29日",""],
	["ロイヤル","戦艦","クイーン・エリザベス","Queen_Elizabeth","A Night At The Stage","LIVE","800","常設販売","通常","動く背景","","2020年10月29日",""],
	["ロイヤル","戦艦","ウォースパイト","Warspite","Under Pleasure","LIVE","800","常設販売","通常","動く背景","","2020年10月29日",""],
	["鉄血","潜水","U-110","U-110","ガーリッシュ・アイドリッシュ","LIVE","800","常設販売","通常","動く背景","","2020年10月29日",""],
	["鉄血","駆逐","Z2","Z2","異色の日常風景","私服","700","限定販売","通常","通常背景","有り","2020年11月12日",""],
	["ロイヤル","戦艦","クイーン・エリザベス","Queen_Elizabeth","スクールオーダーズ","学園","","限定イベ","通常","通常背景","","2020年11月12日",""],
	["DOAXVV","駆逐","マリー・ローズ","Marie-Rose(DOA)","波しぶきと小悪魔サーバント","水着","900","限定販売","通常","通常背景","有り","2020年11月26日","DOAXVVコラボ"],
	["DOAXVV","軽巡","みさき","Misaki(DOA)","特別なゴールデンセッション","水着","900","限定販売","通常","通常背景","有り","2020年11月26日","DOAXVVコラボ"],
	["DOAXVV","重巡","かすみ","Kasumi(DOA)","水辺の霞光","水着","900","限定販売","通常","通常背景","有り","2020年11月26日","DOAXVVコラボ"],
	["DOAXVV","戦艦","ほのか","Honoka(DOA)","岸辺のサマーエンジェル","水着","900","限定販売","通常","通常背景","有り","2020年11月26日","DOAXVVコラボ"],
	["DOAXVV","軽巡","モニカ","Monica(DOA)","格別なエースオブハーツ","水着","800","限定販売","通常","通常背景","有り","2020年11月26日","DOAXVVコラボ"],
	["DOAXVV","戦艦","なぎさ","Nagisa(DOA)","青空と弾む気持ち","水着","800","限定販売","通常","通常背景","有り","2020年11月26日","DOAXVVコラボ"],
	["DOAXVV","空母","女天狗","Nyotengu(DOA)","紅く染まる温泉バカンス","水着","800","限定販売","通常","通常背景","有り","2020年11月26日","DOAXVVコラボ"],
	["鉄血","駆逐","Z23","Z23","活字も目の保養？","その他","","コラボイベ","通常","","","2020年12月10日","紀伊國屋書店コラボ"],
	["重桜","駆逐","夕立","Yuudachi","ドリームクリスマスナイト","クリスマス","900","常設販売","通常","動く背景","","2020年12月22日",""],
	["ユニオン","重巡","ミネアポリス","Minneapolis","聖夜のモービルドライブ","クリスマス","900","常設販売","通常","動く背景","","2020年12月22日",""],
	["ユニオン","駆逐","ジェンキンス","Jenkins","聖夜の光は星より","クリスマス","800","常設販売","通常","動く背景","","2020年12月22日",""],
	["ユニオン","駆逐","ハムマン","Hammann","聖夜のサプライズ！","クリスマス","800","常設販売","通常","動く背景","","2020年12月22日",""],
	["ユニオン","空母","サラトガ","Saratoga","聖夜艦隊のアイドル","クリスマス","800","常設販売","通常","動く背景","","2020年12月22日",""],
	["ユニオン","駆逐","クーパー","Cooper","聖夜の温かい贈り物","クリスマス","780","常設販売","通常","動く背景","","2020年12月22日",""],
	["ユニオン","軽巡","マーブルヘッド","Marblehead","雪のチャーミングタイム","クリスマス","","常設イベ","通常","通常背景","","2020年12月22日",""],
	["鉄血","空母","ペーター・シュトラッサー","Peter_Strasser","シュヴァルツ・クロノシア","お正月","1200","常設販売","L2D","動く背景","有り","2020年12月29日",""],
	["アイリス","戦艦","リシュリュー","Richelieu","常緑Rêve prophétique","お正月","1180","常設販売","L2D","動く背景","有り","2020年12月29日",""],
	["ヴィシア","戦艦","ジャン・バール","Jean_Bart","舶刀Première neige","お正月","1180","常設販売","L2D","動く背景","有り","2020年12月29日",""],
	["鉄血","戦艦","ティルピッツ","Tirpitz","松の節句と白き氷華","お正月","900","常設販売","通常","動く背景","有り","2020年12月29日",""],
	["アイリス","戦艦","シャンパーニュ","Champagne","藍彩の初夢","お正月","900","常設販売","通常","動く背景","","2020年12月29日",""],
	["重桜","駆逐","涼月","Suzutsuki","涼月、羽根つきにてお相手いたす！","お正月","880","常設販売","通常","動く背景","","2020年12月29日",""],
	["ロイヤル","軽巡","ベルファスト","Belfast","傾国の華扇","お正月","880","常設販売","通常","動く背景","","2020年12月29日",""],
	["鉄血","重巡","プリンツ・ハインリヒ","Prinz_Heinrich","花火と春絵巻","お正月","880","常設販売","通常","動く背景","有り","2020年12月29日",""],
	["鉄血","巡戦","オーディン","Odin","蒼雪揮毫","お正月","880","常設販売","通常","動く背景","","2020年12月29日",""],
	["ユニオン","戦艦","ジョージア","Georgia","薫り貴き高邁の綵","お正月","880","常設販売","通常","動く背景","","2020年12月29日",""],
	["鉄血","潜水","U-37","U-37","うたかた唄う華いろは","お正月","880","常設販売","通常","動く背景","有り","2020年12月29日",""],
	["重桜","駆逐","朝潮","Asashio","リンクスティップの雪化粧","お正月","800","常設販売","通常","動く背景","有り","2020年12月29日",""],
	["鉄血","駆逐","Z24","Z24","デモニックde正月","お正月","800","常設販売","通常","動く背景","","2020年12月29日",""],
	["ユニオン","軽巡","ビロクシ","Biloxi","宵彩る煌く蒼","お正月","800","常設販売","通常","動く背景","有り","2020年12月29日",""],
	["重桜","巡戦","榛名","Haruna","蓮華のエレガンス","お正月","800","常設販売","通常","動く背景","","2020年12月29日",""],
	["鉄血","駆逐","Z28","Z28","ごちゃまぜニューイヤー","お正月","780","常設販売","通常","動く背景","","2020年12月29日",""],
	["鉄血","軽巡","ニュルンベルク","Nuremberg","スプリング・ワンダラー","お正月","780","常設販売","通常","動く背景","有り","2020年12月29日",""],
	["鉄血","軽母","ヴェーザー","Weser","彩り煌めく黒金の綉","お正月","780","常設販売","通常","動く背景","","2020年12月29日",""],
	["鉄血","潜水","U-110","U-110","サメちゃんのハツユメ","お正月","780","常設販売","通常","動く背景","有り","2020年12月29日",""],
	["重桜","駆逐","春月","Harutsuki","麗しき迎春の舞","お正月","","限定イベ","通常","動く背景","有り","2020年12月29日",""],
	["ユニオン","空母","ホーネット","Hornet","デリシャス・ラブ！","その他","700","限定販売","通常","","","2021年1月21日","ピザハットコラボ"],
	["ユニオン","重巡","ブレマートン","Bremerton","アクションクルーズ","東煌風","1200","常設販売","L2D","動く背景","有り","2021年2月4日",""],
	["ロイヤル","重巡","チェシャー","Cheshire","音楽絢爛ケットシー","東煌風","1200","常設販売","L2D","動く背景","有り","2021年2月4日",""],
	["ヴィシア","軽巡","ラ・ガリソニエール","La_Galissonniere","ほろよい春曙の夢","東煌風","1100","常設販売","L2D","動く背景","有り","2021年2月4日",""],
	["ロイヤル","空母","グロリアス","Glorious","とらぶるプラム","東煌風","1100","常設販売","L2D","動く背景","有り","2021年2月4日",""],
	["鉄血","駆逐","Z46","Z46","切り絵のファンタジア","東煌風","900","常設販売","通常","動く背景","","2021年2月4日",""],
	["重桜","軽巡","能代","Noshiro","冬雪の薫香","東煌風","900","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["アイリス","重巡","サン・ルイ","Saint_Louis","瑰麗なる執行者","東煌風","900","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["ユニオン","空母","エセックス","Essex","キャリー=クレーン","東煌風","900","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["ロイヤル","空母","ヴィクトリアス","Victorious","女神の導き","東煌風","900","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["ロイヤル","駆逐","グローウォーム","Glowworm","なんちゃって大判事","東煌風","800","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["重桜","駆逐","大潮","Ooshio","飾ろう新春の福","東煌風","800","常設販売","通常","動く背景","","2021年2月4日",""],
	["ユニオン","軽巡","バーミンガム","Birmingham","豊年の瑞雪","東煌風","800","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["ロイヤル","軽巡","ペネロピ","Penelope","ヒーリングレッド","東煌風","800","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["東煌","軽巡","肇和","Chao_Ho","梅照春枝","東煌風","800","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["重桜","巡戦","霧島","Kirishima","墨香に浸る雅","東煌風","800","常設販売","通常","動く背景","","2021年2月4日",""],
	["ロイヤル","戦艦","クイーン・エリザベス","Queen_Elizabeth","金運のプレミアムロイヤル","東煌風","800","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["ユニオン","空母","サラトガ","Saratoga","フェスティバルinSpring!","東煌風","800","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["重桜","潜水","伊25","I25","甘酒の新春祝い","東煌風","800","常設販売","通常","動く背景","有り","2021年2月4日",""],
	["鉄血","潜水","U-410","U-410","春節の「仕掛け」","東煌風","800","常設販売","通常","動く背景","","2021年2月4日",""],
	["東煌","軽巡","応瑞","Ying_Swei","寒松雪暖","東煌風","","コアデータ","通常","動く背景","有り","2021年2月4日",""],
	["ロイヤル","軽巡","オーロラ","Aurora","吉日凰単","ケッコン","600","指輪を贈る","通常","","","2021年2月4日",""],
	["ユニオン","駆逐","ニコラス","Nicholas","放課後の約束","学園","780","常設販売","通常","通常背景","有り","2021年2月14日",""],
	["ロイヤル","軽巡","エイジャックス","Ajax","バレンタインのご褒美？","学園","780","限定販売","通常","通常背景","有り","2021年2月14日",""],
	["ユニオン","軽母","プリンストン","Princeton","ロリポップ・饅頭ランド","学園","780","常設販売","通常","通常背景","有り","2021年2月14日",""],
	["北連","駆逐","タシュケント","Tashkent","ダラダラオフタイム","居間着","880","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","軽巡","チャパエフ","Chapayev","白騎兵の休日","居間着","880","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","軽巡","キーロフ","Kirov","ブレンド・R","居間着","880","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","重巡","タリン","Tallinn","ピルスナー・ノスタルジック","居間着","880","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","戦艦","ソビエツカヤ・ベラルーシア","Sovetskaya_Belorussiya","余暇のソリューション","居間着","880","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","駆逐","グロズヌイ","Grozny","ウサギ改修計画？","居間着","780","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","駆逐","グロームキィ","Gromky","モーニングコール","居間着","780","限定販売","通常","通常背景","","2021年2月25日",""],
	["北連","駆逐","グレミャーシュチ","Gremyashchy","正午の幸せは本の中","居間着","780","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","駆逐","ストレミテルヌイ","Stremitelny","雪玉とクッションとゲーム機と","居間着","780","常設販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","軽巡","パーミャチ・メルクーリヤ","Pamiat_Merkuria","サクランボ・ブイ","居間着","780","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","軽巡","ムルマンスク","Murmansk","パゾリと雪景色","居間着","780","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","戦艦","ガングート","Gangut","ヴォッカを愛する者","居間着","780","限定販売","通常","通常背景","有り","2021年2月25日",""],
	["北連","軽巡","パーミャチ・メルクーリヤ","Pamiat_Merkuria","パーミャチ・メルクーリヤ改","改造","","近代化改修","通常","","","2021年2月25日",""],
	["重桜","戦艦","長門","Nagato","御狐の休暇日","居間着","880","常設販売","通常","通常背景","","2021年3月12日",""],
	["重桜","戦艦","三笠","Mikasa","余暇、休養、大切に","居間着","880","常設販売","通常","通常背景","有り","2021年3月12日",""],
	["アイリス","駆逐","ル・テメレール","Le_Temeraire","ドリーム・ドルチェ","居間着","780","常設販売","通常","通常背景","有り","2021年3月12日",""],
	["ユニオン","軽母","インディペンデンス","Independence","リラクゼーション・I","居間着","780","常設販売","通常","通常背景","有り","2021年3月12日",""],
	["東煌","軽巡","寧海","Ning_Hai","ダーバオの友達","私服","","コラボイベ","通常","通常背景","","2021年3月12日","世界自然保護基金コラボ"],
	["東煌","軽巡","平海","Ping_Hai","アーバオの友達","私服","","コラボイベ","通常","通常背景","","2021年3月12日","世界自然保護基金コラボ"],
	["ユニオン","重巡","ボルチモア","Baltimore","エースの旅紀行","お正月","880","常設販売","通常","通常背景","有り","2021年3月25日",""],
	["ユニオン","空母","バンカー・ヒル","Bunker_Hill","ミッション・プレイボード","居間着","880","限定販売","通常","通常背景","有り","2021年4月8日",""],
	["ユニオン","重巡","アストリア","Astoria","黒うさかーにばる！","バニー","780","限定販売","通常","通常背景","有り","2021年4月8日",""],
	["サディア","戦艦","ヴィットリオ・ヴェネト","Vittorio_Veneto","ラスペツィアの花","水着","1180","限定販売","L2D","通常背景","有り","2021年4月22日",""],
	["サディア","軽巡","ドゥーカ・デッリ・アブルッツィ","Luigi_di_Savoia_Duca_degli_Abruzzi","貴き黒のシレネッタ","水着","880","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["サディア","空母","アクィラ","Aquila","浅瀬のホリデーサディア","水着","880","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["重桜","駆逐","追風","Oite","夏陽の一意専心","水着","780","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["サディア","駆逐","マエストラーレ","Maestrale","ロンリー・ビーチ","水着","780","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["サディア","駆逐","リベッチオ","Libeccio","水兵は南西へ","水着","780","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["サディア","駆逐","ニコロソ・ダ・レッコ","Nicoloso_da_Recco","出航の前にいっぱーつ！","水着","780","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["サディア","戦艦","コンテ・ディ・カブール","Conte_di_Cavour","サンド・スカーミッシュ","水着","780","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["サディア","戦艦","ジュリオ・チェザーレ","Giulio_Cesare","日差しのAlta marea","水着","780","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["サディア","潜水","トリチェリ","Evangelista_Torricelli","日陰の彼女、日陰のある砂浜","水着","780","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["ロイヤル","巡戦","フッド","Hood","五彩のグローリアス","お正月","880","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["重桜","空母","加賀","Kaga","淡桜の息吹","お正月","880","限定販売","通常","通常背景","有り","2021年4月22日",""],
	["重桜","駆逐","綾波","Ayanami","微速戦闘姿勢","居間着","","特典コード","通常","通常背景","有り","2021年5月12日",""],
	["ユニオン","駆逐","アレン・M・サムナー","Allen_M._Sumner","チャーミングラビット","バニー","1180","限定販売","L2D","通常背景","有り","2021年5月27日",""],
	["ユニオン","軽巡","ボイシ","Boise","恥じらいのサファイア","バニー","1080","限定販売","L2D","通常背景","有り","2021年5月27日",""],
	["ユニオン","重巡","サンフランシスコ","San_Francisco","Funny Bunny！","バニー","880","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["ユニオン","戦艦","ニュージャージー","New_Jersey","リッピング・ステッピング！","バニー","880","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["ユニオン","空母","タイコンデロガ","Ticonderoga","グランドステージ・ショー！","バニー","880","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["ユニオン","潜水","アーチャーフィッシュ","Archerfish","キャッツィバニィ！","バニー","880","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["重桜","潜水","伊19","I19","ブロッサム・バニー","バニー","880","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["ユニオン","駆逐","ステフェン・ポッター","Stephen_Potter","セーフハウス・ヘア","バニー","780","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["ユニオン","駆逐","モリソン","Morrison","クマちゃんは整備中","バニー","780","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["ロイヤル","駆逐","アカスタ","Acasta","ラブリー・モノクロミック","バニー","780","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["重桜","軽巡","鬼怒","Kinu","トークンとゴースト","バニー","780","限定販売","通常","通常背景","有り","2021年5月27日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","シロクマと夏のアイスタイム","居間着","780","常設販売","通常","通常背景","","2021年5月27日",""],
	["ユニオン","軽母","インディペンデンス","Independence","インディペンデンス改","改造","","近代化改修","通常","","","2021年5月27日",""],
	["ユニオン","空母","サラトガ","Saratoga","シロクマちゃんとピクニック！","私服","","コラボイベ","通常","通常背景","","2021年5月27日","大陸版アイスコラボ"],
	["鉄血","軽母","ヴェーザー","Weser","黒曜に輝くブラックダイヤ","パーティー","1080","常設販売","L2D","通常背景","有り","2021年6月3日",""],
	["ユニオン","軽巡","モントピリア","Montpelier","プリンセス・メタモルフォーゼ","パーティー","880","常設販売","通常","通常背景","有り","2021年6月3日",""],
	["ロイヤル","軽巡","ハーマイオニー","Hermione","午後喫茶「メイドの優雅」","パーティー","880","常設販売","通常","通常背景","有り","2021年6月3日",""],
	["ロイヤル","巡戦","フッド","Hood","サンシャイン・グレース","パーティー","880","常設販売","通常","通常背景","有り","2021年6月3日",""],
	["ロイヤル","空母","フォーミダブル","Formidable","クラシック・ドレスアップ！","パーティー","880","常設販売","通常","通常背景","","2021年6月3日",""],
	["重桜","駆逐","長波","Naganami","待ち望む暖かさ","パーティー","780","常設販売","通常","通常背景","有り","2021年6月3日",""],
	["ロイヤル","軽巡","ブラック・プリンス","Black_Prince","ポップ・ザ・コルク","パーティー","780","常設販売","通常","通常背景","有り","2021年6月3日",""],
	["ロイヤル","戦艦","ヴァリアント","Valiant","ヴァリアント陛下！","パーティー","780","常設販売","通常","通常背景","有り","2021年6月3日",""],
	["重桜","駆逐","初春","Hatsuharu","灯の初春","パーティー","","限定イベ","通常","通常背景","有り","2021年6月3日",""],
	["サディア","重巡","ポーラ","Pola","水辺のハプニング？","水着","1180","限定販売","L2D","通常背景","","2021年6月10日",""],
	["ロイヤル","戦艦","ロドニー","Rodney","パレス・ブライトネス","ケッコン","600","指輪を贈る","通常","","有り","2021年6月10日",""],
	["ロイヤル","空母","アーク・ロイヤル","Ark_Royal","純白なる守護者","ケッコン","600","指輪を贈る","通常","","","2021年6月10日",""],
	["重桜","超巡","吾妻","Azuma","仕合せのホワイト・ラブ","ケッコン","600","指輪を贈る","通常","","","2021年6月10日",""],
	["重桜","戦艦","山城","Yamashiro","観光地大作戦！","私服","","限定販売","通常","","有り","2021年6月17日",""],
	["重桜","駆逐","風雲","Kazagumo","風雲は悠々と流れる","学園","880","常設販売","通常","通常背景","有り","2021年6月24日",""],
	["ユニオン","駆逐","カッシン","Cassin","カート・ショッピング","学園","780","常設販売","通常","通常背景","有り","2021年6月24日",""],
	["ユニオン","駆逐","ダウンズ","Downes","パートタイムボンバー","学園","780","常設販売","通常","通常背景","有り","2021年6月24日",""],
	["重桜","駆逐","白雪","Shirayuki","雪うさぎの飼い方","学園","780","常設販売","通常","通常背景","有り","2021年6月24日",""],
	["重桜","駆逐","浦風","Urakaze","センゴク☆バンド！","学園","780","常設販売","通常","通常背景","有り","2021年6月24日",""],
	["重桜","駆逐","霞","Kasumi","ふわりん学級","学園","780","常設販売","通常","通常背景","有り","2021年6月24日",""],
	["ユニオン","軽巡","メンフィス","Memphis","ギョーカンの流儀","学園","780","常設販売","通常","通常背景","有り","2021年6月24日",""],
	["重桜","軽母","龍驤","Ryuujou","龍驤のドラゴン狩りタイム！","学園","780","常設販売","通常","通常背景","","2021年6月24日",""],
	["重桜","駆逐","霞","Kasumi","霞改","改造","","近代化改修","通常","","","2021年6月24日",""],
	["ユニオン","駆逐","ラフィー","Laffey","お掃除の始まりと後","居間着","","特典コード","通常","通常背景","有り","2021年7月7日",""],
	["鉄血","駆逐","Z23","Z23","秘密のお世話ルーム","居間着","","特典コード","通常","通常背景","有り","2021年7月7日",""],
	["重桜","戦艦","駿河","Suruga","文化系なんだからっ","学園","880","限定販売","通常","通常背景","有り","2021年7月8日",""],
	["アイドルマスター","軽巡","天海春香","Amami_Haruka","喧騒の中の安らぎ","夏祭り","880","限定販売","通常","通常背景","有り","2021年7月22日","アイドルマスターコラボ"],
	["アイドルマスター","重巡","三浦あずさ","Miura_Azusa","盛夏の休み処","夏祭り","880","限定販売","通常","通常背景","","2021年7月22日","アイドルマスターコラボ"],
	["アイドルマスター","戦艦","水瀬伊織","Minase_Iori","秘密の夕べ","夏祭り","880","限定販売","通常","通常背景","有り","2021年7月22日","アイドルマスターコラボ"],
	["アイドルマスター","空母","如月千早","Kisaragi_Chihaya","天花の鏡","夏祭り","880","限定販売","通常","通常背景","有り","2021年7月22日","アイドルマスターコラボ"],
	["重桜","駆逐","夕暮","Yuugure","お祭りでお買い物","夏祭り","780","限定販売","通常","通常背景","有り","2021年7月22日",""],
	["重桜","駆逐","荒潮","Arashio","花火、優しいひと時","夏祭り","780","限定販売","通常","通常背景","有り","2021年7月22日",""],
	["鉄血","駆逐","Z2","Z2","夜色と鯉","夏祭り","780","限定販売","通常","通常背景","","2021年7月22日",""],
	["アイドルマスター","潜水","双海亜美","Futami_Ami","大太鼓と夏の華","夏祭り","780","限定販売","通常","通常背景","有り","2021年7月22日","アイドルマスターコラボ"],
	["アイドルマスター","潜水","双海真美","Futami_Mami","せくしー・ふぇすてぃばる！","夏祭り","780","限定販売","通常","通常背景","有り","2021年7月22日","アイドルマスターコラボ"],
	["アイドルマスター","運送","秋月律子","Akizuki_Ritsuko","サマータイム・サービス","夏祭り","780","限定販売","通常","通常背景","有り","2021年7月22日","アイドルマスターコラボ"],
	["ユニオン","軽巡","リノ","Reno","バニーリノ！","バニー","1180","限定販売","L2D","通常背景","有り","2021年8月12日",""],
	["ユニオン","戦艦","ノースカロライナ","North_Carolina","内なる力と正義","バニー","1180","限定販売","L2D","通常背景","有り","2021年8月12日",""],
	["ロイヤル","駆逐","アーデント","Ardent","マスター・アーデント？","バニー","780","限定販売","通常","通常背景","有り","2021年8月12日",""],
	["重桜","駆逐","磯風","Isokaze","センゴク☆ユニット","学園","","限定イベ","通常","通常背景","有り","2021年8月12日",""],
	["ロイヤル","空母","アーク・ロイヤル","Ark_Royal","アーク・ロイヤル改","改造","","近代化改修","通常","","","2021年8月12日",""],
	["ロイヤル","砲艦","アバークロンビー","Abercrombie","ミスチーフ・レッド","バニー","1080","限定販売","L2D","通常背景","","2021年8月19日",""],
	["ユニオン","駆逐","イングラハム","Ingraham","ドリンクもお手の物！","バニー","880","限定販売","通常","通常背景","","2021年8月19日",""],
	["ユニオン","潜水","ノーチラス","Nautilus","ちょっびり、背伸び～","バニー","780","限定販売","通常","通常背景","有り","2021年8月19日",""],
	["ユニオン","空母","サラトガ","Saratoga","プロモタレント？","その他","700","限定販売","通常","","","2021年9月2日",""],
	["重桜","駆逐","島風","Shimakaze","最速バニーの招待？状","バニー","1180","限定販売","L2D","通常背景","有り","2021年9月16日",""],
	["ヴィシア","駆逐","ル・マラン","Le_Malin","昼寝好きのラピヌ","バニー","1180","限定販売","L2D","通常背景","有り","2021年9月16日",""],
	["重桜","空母","葛城","Katsuragi","夜明輝祭","バニー","880","限定販売","通常","通常背景","有り","2021年9月16日",""],
	["ユニオン","駆逐","エルドリッジ","Eldridge","アストロ・ルナーデー","その他","800","限定販売","通常","","有り","2021年9月16日",""],
	["ユニオン","軽巡","マーブルヘッド","Marblehead","29.5日の月見タイム","その他","800","限定販売","通常","動く背景","有り","2021年9月16日",""],
	["重桜","駆逐","海風","Umikaze","もこもこふんわり","バニー","780","限定販売","通常","通常背景","有り","2021年9月16日",""],
	["重桜","駆逐","山風","Yamakaze","奇術タイムスタンバイ！","バニー","780","限定販売","通常","通常背景","有り","2021年9月16日",""],
	["ロイヤル","軽巡","ブラック・プリンス","Black_Prince","ぼんやり世話焼き？","バニー","780","限定販売","通常","通常背景","有り","2021年9月16日",""],
	["重桜","軽巡","由良","Yura","ふたりはさきゅばす？","バニー","780","限定販売","通常","通常背景","","2021年9月16日",""],
	["重桜","軽巡","五十鈴","Isuzu","オーバーヒート？","バニー","700","限定販売","通常","","","2021年9月16日",""],
	["ロイヤル","重巡","チェシャー","Cheshire","ハイネス・イン・ホワイト","パーティー","1100","限定販売","L2D","","有り","2021年9月23日",""],
	["鉄血","空母","ペーター・シュトラッサー","Peter_Strasser","ヴァイス・ウァツァイガー","パーティー","880","限定販売","通常","通常背景","","2021年9月23日",""],
	["サディア","空母","アクィラ","Aquila","緑苑のエレガントサディア","パーティー","880","限定販売","通常","通常背景","有り","2021年9月23日",""],
	["サディア","駆逐","ヴィンチェンツォ・ジョベルティ","Vincenzo_Gioberti","幼き淑女の招待状","パーティー","780","限定販売","通常","通常背景","有り","2021年9月23日",""],
	["ヴィシア","駆逐","ヴォークラン","Vauquelin","シンフォニック・オートマタ？","パーティー","780","限定販売","通常","通常背景","有り","2021年9月23日",""],
	["ユニオン","軽巡","サンフアン","San_Juan","ロンギング・プリンセス","パーティー","780","限定販売","通常","通常背景","有り","2021年9月23日",""],
	["アイリス","軽巡","エミール・ベルタン","Emile_Bertin","ゴールデン・ダンス","パーティー","780","限定販売","通常","通常背景","有り","2021年9月23日",""],
	["ロイヤル","重巡","エクセター","Exeter","栄光は祝杯とともに","パーティー","780","限定販売","通常","通常背景","有り","2021年9月23日",""],
	["ロイヤル","駆逐","フォーチュン","Fortune","晴れる日のクローステール","パーティー","700","限定販売","通常","通常背景","","2021年9月23日",""],
	["重桜","駆逐","満潮","Michishio","ふんわりリボンテール","パーティー","","限定イベ","通常","通常背景","有り","2021年9月23日",""],
	["ユニオン","空母","ヨークタウン","Yorktown","聖者の翼","その他","","SP報酬","通常","","有り","2021年9月30日",""],
	["重桜","軽巡","能代","Noshiro","恋結御伽","ケッコン","600","指輪を贈る","通常","","有り","2021年9月30日",""],
	["ロイヤル","重巡","ヨーク","York","ピュア・オース","ケッコン","600","指輪を贈る","通常","","有り","2021年9月30日",""],
	["重桜","空母","大鳳","Taihou","潮風のテンプテーション","ケッコン","600","指輪を贈る","通常","","有り","2021年9月30日",""],
	["重桜","駆逐","夕立","Yuudachi","夕立改","改造","","近代化改修","通常","","","2021年9月30日",""],
	["ヴィシア","軽巡","ラ・ガリソニエール","La_Galissonniere","黒猫とかぼちゃの夜","ハロウィン","1080","常設販売","L2D","通常背景","有り","2021年10月28日",""],
	["アイリス","駆逐","ル・テリブル","Le_Terrible","静寂、微睡、安寧の白","居間着","880","常設販売","通常","通常背景","","2021年10月28日",""],
	["重桜","軽巡","能代","Noshiro","安寧の六畳","居間着","880","常設販売","通常","通常背景","有り","2021年10月28日",""],
	["重桜","重巡","伊吹","Ibuki","無為の恬静","居間着","880","常設販売","通常","通常背景","","2021年10月28日",""],
	["サディア","戦艦","リットリオ","Littorio","カーザ・リクター","居間着","880","常設販売","通常","通常背景","有り","2021年10月28日",""],
	["アイリス","駆逐","マイレ・ブレゼ","Maille_Breze","女騎士のラストスタンド！","居間着","780","常設販売","通常","通常背景","有り","2021年10月28日",""],
	["重桜","重巡","熊野","Kumano","激オニ☆勝負パーティ","居間着","780","常設販売","通常","通常背景","有り","2021年10月28日",""],
	["ユニオン","軽巡","ボイシ","Boise","キャッスルテイルズ","ハロウィン","780","常設販売","通常","通常背景","有り","2021年10月28日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","ウィンド・キャッチャー","レースクイーン","1200","限定販売","L2D","動く背景","有り","2021年11月11日",""],
	["鉄血","重巡","プリンツ・オイゲン","Prinz_Eugen","ファイナル・ラップ","レースクイーン","1200","限定販売","L2D","動く背景","有り","2021年11月11日",""],
	["ヴィシア","重巡","フォッシュ","Foch","虹彩のランデヴー","私服","780","限定販売","通常","通常背景","有り","2021年11月11日",""],
	["ユニオン","重巡","ブレマートン","Bremerton","ハッピーデーティング！","私服","1180","常設販売","L2D","通常背景","有り","2021年11月25日",""],
	["SSSS","戦艦","新条アカネ","Shinjo_Akane","ふたりぼっちの休日","居間着","900","限定販売","通常","通常背景","","2021年11月25日","SSSSコラボ"],
	["SSSS","軽巡","宝多六花","Takarada_Rikka","ブルースカイ・ステーション","私服","900","限定販売","通常","通常背景","有り","2021年11月25日","SSSSコラボ"],
	["SSSS","空母","飛鳥川ちせ","Asukagawa_Chise","君と泳ぐ空","私服","900","限定販売","通常","通常背景","有り","2021年11月25日","SSSSコラボ"],
	["SSSS","重巡","南夢芽","Minami_Yume","窓辺に開く夢","私服","820","限定販売","通常","","","2021年11月25日","SSSSコラボ"],
	["SSSS","戦艦","ムジナ","Mujina","黄金色の遊歩道","私服","800","限定販売","通常","通常背景","有り","2021年11月25日","SSSSコラボ"],
	["SSSS","軽巡","はっす","Hass","母港リポ配信中！","私服","800","限定販売","通常","通常背景","有り","2021年11月25日","SSSSコラボ"],
	["SSSS","重巡","なみこ","Namiko","ミーツ・イン・ストリート","私服","800","限定販売","通常","通常背景","有り","2021年11月25日","SSSSコラボ"],
	["ユニオン","軽母","インディペンデンス","Independence","追い風のラッキータイム","私服","780","常設販売","通常","通常背景","有り","2021年11月25日",""],
	["ユニオン","戦艦","コロラド","Colorado","旅の旋律","私服","","SP報酬","通常","","有り","2021年12月1日",""],
	["ユニオン","重巡","ニューオリンズ","New_Orleans","アグリコールの夜","バニー","880","限定販売","通常","通常背景","有り","2021年12月16日",""],
	["重桜","戦艦","駿河","Suruga","望まぬ聖夜祭","クリスマス","1180","限定販売","L2D","通常背景","有り","2021年12月23日",""],
	["重桜","駆逐","暁","Akatsuki","トナカイニンジャ発進！","クリスマス","800","限定販売","通常","動く背景","有り","2021年12月23日",""],
	["重巡","鉄血","プリンツ・アーダルベルト","Prinz_Adalbert","閉店後の特別サービス？","メイド","1180","限定販売","L2D","通常背景","有り","2021年12月29日",""],
	["戦艦","鉄血","ウルリッヒ・フォン・フッテン","Ulrich_von_Hutten","メドヘン・トリュンマー","メイド","1180","限定販売","L2D","通常背景","有り","2021年12月29日",""],
	["戦艦","ロイヤル","クイーン・エリザベス","Queen_Elizabeth","メイド・マイ・ハイネス","メイド","1080","限定販売","L2D","通常背景","有り","2021年12月29日",""],
	["駆逐","鉄血","Z46","Z46","終わりなきホコリとの闘争","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["軽巡","重桜","能代","Noshiro","氷は少なめに？","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["軽巡","鉄血","マクデブルク","Magdeburg","お掃除？にゃんこ騒ぎ！","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["重巡","重桜","鳥海","Choukai","清心燦々","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["戦艦","ロイヤル","ハウ","Howe","クッキー・メイド・プリンセス","メイド","880","限定販売","通常","通常背景","","2021年12月29日",""],
	["戦艦","鉄血","ビスマルク","Bismarck","アイアンブラック・エリュシオン","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["戦艦","サディア","マルコ・ポーロ","Marco_Polo","ラブリー・ミリオーネ","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["空母","重桜","白龍","Hakuryu","快刀乱肴","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["空母","鉄血","アウグスト・フォン・パーセヴァル","August_von_Parseval","御使い魔女","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["潜水","ユニオン","アルバコア","Albacore","びっくり箱からサプラ～イズだにゃ！","メイド","880","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["潜水","鉄血","U-47","U-47","Urban Maid's","メイド","800","限定販売","通常","","","2021年12月29日",""],
	["駆逐","ロイヤル","イカルス","Icarus","アイアムレディ","メイド","780","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["軽巡","鉄血","ライプツィヒ","Leipzig","フロントウェイ·トレーニング","メイド","780","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["軽母","鉄血","エルベ","Elbe","見せ場訪れず？","メイド","780","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["潜水","鉄血","U-1206","U-1206","コールはメイドさんへ！","メイド","780","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["軽巡","ロイヤル","ペネロピ","Penelope","ソルティーメイド","メイド","700","限定販売","通常","通常背景","有り","2021年12月29日",""],
	["軽巡","ロイヤル","サウサンプトン","Southampton","午後のクロチェット","メイド","","限定イベ","通常","通常背景","有り","2021年12月29日",""],
	["ロイヤル","軽巡","カリブディス","Charybdis","癒やしの紅閨","東煌風","1200","限定販売","L2D","動く背景","","2022年1月27日",""],
	["重桜","空母","赤城","Akagi","朝凰来儀","東煌風","1200","限定販売","L2D","動く背景","有り","2022年1月27日",""],
	["ユニオン","駆逐","ブリストル","Bristol","東煌志怪談","東煌風","900","限定販売","通常","動く背景","","2022年1月27日",""],
	["ユニオン","軽巡","リノ","Reno","きらめく春の息吹","東煌風","900","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["ロイヤル","軽巡","ハーマイオニー","Hermione","ピュアリー・ハーブ","東煌風","900","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["重桜","空母","加賀","Kaga","鸞翔影集","東煌風","900","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["重桜","駆逐","綾波","Ayanami","Navalistic Showdown","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["重桜","駆逐","追風","Oite","墨梅の筆墨硯紙","東煌風","800","限定販売","通常","動く背景","","2022年1月27日",""],
	["重桜","駆逐","長波","Naganami","夜長に寄り添って","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["重桜","駆逐","宵月","Yoizuki","爆竹と饅頭","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["重桜","駆逐","花月","Hanazuki","春正旦・月華盎然","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["重桜","駆逐","朝潮","Asashio","舞い降りるもこもこタフト","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["東煌","軽巡","海天","Hai_Tien","詩句馨る水亭にて","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["東煌","軽巡","海圻","Hai_Chi","清き泉にて楽と舞ふ","東煌風","800","限定販売","通常","動く背景","","2022年1月27日",""],
	["ユニオン","戦艦","アリゾナ","Arizona","西方舞姫","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["ロイヤル","戦艦","ロドニー","Rodney","完璧な佳人","東煌風","800","限定販売","通常","動く背景","","2022年1月27日",""],
	["東煌","軽母","鎮海","Chen_Hai","奇響華殿","東煌風","800","限定販売","通常","動く背景","有り","2022年1月27日",""],
	["ユニオン","戦艦","ペンシルベニア","Pennsylvania","石州飛将","東煌風","780","限定販売","通常","通常背景","","2022年1月27日",""],
	["鉄血","潜水","U-73","U-73","初春の情熱ケミカルポーション","東煌風","","限定イベ","通常","動く背景","有り","2022年1月27日",""],
	["東煌","駆逐","長春","Chang_Chun","長春改","改造","","近代化改修","通常","","","2022年1月27日",""],
	["東煌","駆逐","鞍山","An_Shan","鞍山改","改造","","近代化改修","通常","","","2022年1月27日",""],
	["ユニオン","軽巡","コロンビア","Columbia","草原を駆ける","その他","","SP報酬","通常","通常背景","有り","2022年2月1日",""],
	["東煌","駆逐","鞍山","An_Shan","夕暉・伊人","学園","780","限定販売","通常","通常背景","","2022年2月14日",""],
	["重桜","駆逐","時雨","Shigure","ラッキーショコラ","学園","780","限定販売","通常","通常背景","有り","2022年2月14日",""],
	["北連","超巡","クロンシュタット","Kronshtadt","突入開始ッッ！","特殊演習","1180","限定販売","L2D","通常背景","有り","2022年2月24日",""],
	["北連","軽巡","キーロフ","Kirov","ピーキー・チューニング","特殊演習","1180","限定販売","L2D","通常背景","有り","2022年2月24日",""],
	["北連","空母","ヴォルガ","Volga","美味しいAR探偵体験","特殊演習","880","限定販売","通常","通常背景","有り","2022年2月24日",""],
	["北連","重巡","タリン","Tallinn","イエスマイレディ","特殊演習","880","限定販売","通常","通常背景","有り","2022年2月24日",""],
	["北連","軽巡","アヴローラ","Avrora","似合わぬ役は無理せず？","特殊演習","880","限定販売","通常","通常背景","有り","2022年2月24日",""],
	["北連","駆逐","キエフ","Kiev","路地裏の銀色ソナタ","特殊演習","880","限定販売","通常","通常背景","有り","2022年2月24日",""],
	["北連","戦艦","アルハンゲリスク","Arkhangelsk","フライ・アナザー・デイ","特殊演習","780","限定販売","通常","通常背景","有り","2022年2月24日",""],
	["北連","駆逐","ソオブラジーテリヌイ","Soobrazitelny","バイオロジカルメカニック","特殊演習","780","限定販売","通常","通常背景","有り","2022年2月24日",""],
	["北連","駆逐","グロズヌイ","Grozny","暗黒コーポ突撃！","特殊演習","1080","限定販売","L2D","通常背景","有り","2022年3月3日",""],
	["ユニオン","潜水","アーチャーフィッシュ","Archerfish","となりのお茶目さん","学園","880","限定販売","通常","通常背景","有り","2022年3月24日",""],
	["サディア","空母","インペロ","Impero","朦朧のライブラリアン","学園","880","限定販売","通常","通常背景","有り","2022年3月24日",""],
	["サディア","駆逐","ポンペオ・マーニョ","Pompeo_Magno","クェイバー・デイドリーム","学園","880","限定販売","通常","通常背景","","2022年3月24日",""],
	["重桜","巡戦","金剛","Kongou","風舞う通学路","学園","780","限定販売","通常","通常背景","有り","2022年3月24日",""],
	["サディア","重巡","トリエステ","Trieste","今日の弁当当番は…？","学園","780","限定販売","通常","通常背景","有り","2022年3月24日",""],
	["重桜","駆逐","大潮","Ooshio","お昼のいざない","学園","780","限定販売","通常","通常背景","有り","2022年3月24日",""],
	["重桜","駆逐","若葉","Wakaba","太陽の惠、たっぷりと！","学園","780","限定販売","通常","通常背景","有り","2022年3月24日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","Partons en voyage","その他","","SP報酬","通常","通常背景","有り","2022年4月1日",""],
	["鉄血","軽巡","エムデン","Emden","白黒のパルティータ","永き夜の招き","1180","限定販売","L2D","通常背景","有り","2022年4月28日",""],
	["鉄血","巡戦","リュッツォウ","Lutzow","永き夜のノーブルレッド","永き夜の招き","1180","限定販売","L2D","通常背景","有り","2022年4月28日",""],
	["鉄血","巡戦","ザイドリッツ","Seydlitz","闇滅の系譜","永き夜の招き","880","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["鉄血","潜水","U-47","U-47","languid red moon","永き夜の招き","880","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["北連","軽巡","チャパエフ","Chapayev","藍と燈のサマーサイト","夏祭り","880","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["鉄血","軽巡","エルビング","Elbing","幻夢のプロセルピナ","永き夜の招き","780","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["鉄血","重巡","ヨルク","Yorck","朱月の破壊者","永き夜の招き","780","限定販売","通常","通常背景","","2022年4月28日",""],
	["鉄血","戦艦","テューリンゲン","Thuringen","月下の大掃除","永き夜の招き","780","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["ロイヤル","軽巡","シェフィールド","Sheffield","バレットボーン","永き夜の招き","780","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["鉄血","重巡","アドミラル・ヒッパー","Admiral_Hipper","温泉街のひだまりにて","夏祭り","780","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["ロイヤル","戦艦","ネルソン","Nelson","青と金とサマーライト","夏祭り","780","限定販売","通常","通常背景","有り","2022年4月28日",""],
	["鉄血","超巡","エーギル","Aegir","鉄血母港のメイドラッへ","メイド","1180","限定販売","L2D","通常背景","","2022年5月26日",""],
	["ロイヤル","戦艦","ヴァンガード","Vanguard","どっちつかずマスカレード","メイド","1180","限定販売","L2D","通常背景","有り","2022年5月26日",""],
	["鉄血","重巡","プリンツ・オイゲン","Prinz_Eugen","この夜に酔いしれ","メイド","1180","限定販売","L2D","通常背景","有り","2022年5月26日",""],
	["アイリス","駆逐","ル・テリブル","Le_Terrible","陽光、海色、聖潔の青","水着","","特典コード","通常","通常背景","有り","2022年5月26日",""],
	["ロイヤル","空母","インドミタブル","Indomitable","ケダルイメイドサマ","メイド","880","限定販売","通常","通常背景","有り","2022年5月26日",""],
	["ロイヤル","駆逐","ジャーヴィス","Jervis","風になびかせて","メイド","800","限定販売","通常","","","2022年5月26日",""],
	["ロイヤル","戦艦","リヴェンジ","Revenge","奉仕騎士の快進撃","メイド","780","限定販売","通常","通常背景","有り","2022年5月26日",""],
	["ロイヤル","軽巡","ベローナ","Bellona","手袋は洗濯のために拾われり","メイド","780","限定販売","通常","通常背景","有り","2022年5月26日",""],
	["ロイヤル","空母","アーク・ロイヤル","Ark_Royal","観察はカフェデートの中で","メイド","780","限定販売","通常","通常背景","有り","2022年5月26日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","ユニコーン改","改造","","近代化改修","通常","","","2022年5月26日",""],
	["鉄血","重巡","ローン","Roon","緑と蒼の安らぎ","東煌風","1180","限定販売","L2D","通常背景","有り","2022年6月1日",""],
	["ロイヤル","戦艦","ハウ","Howe","マーベラス・ナイト","東煌風","880","限定販売","通常","通常背景","","2022年6月1日",""],
	["鉄血","戦艦","ティルピッツ","Tirpitz","氷花、一輪挿し","東煌風","880","限定販売","通常","通常背景","有り","2022年6月1日",""],
	["ユニオン","戦艦","ワシントン","Washington","スマイリーアニバーサリー","東煌風","880","限定販売","通常","通常背景","有り","2022年6月1日",""],
	["北連","駆逐","グロズヌイ","Grozny","クロリークのティータイム","東煌風","780","限定販売","通常","通常背景","有り","2022年6月1日",""],
	["ユニオン","軽巡","ボイシ","Boise","翠玉の海人魚","東煌風","780","限定販売","通常","通常背景","","2022年6月1日",""],
	["重桜","軽母","千歳","Chitose","水墨滲む麗色","東煌風","780","限定販売","通常","通常背景","","2022年6月1日",""],
	["ヴィシア","駆逐","ル・マルス","Le_Mars","スプランドゥール・デビュー","東煌風","","限定イベ","通常","通常背景","有り","2022年6月1日",""],
	["重桜","駆逐","暁","Akatsuki","ニンジャ曲芸の大一番！","その他","","SP報酬","通常","通常背景","有り","2022年6月1日",""],
	["ユニオン","空母","サラトガ","Saratoga","幸せの鐘を響かせて","ケッコン","600","指輪を贈る","通常","","有り","2022年6月9日",""],
	["アイリス","駆逐","フォルバン","Forbin","フルール・ド・マリエ","ケッコン","600","指輪を贈る","通常","","有り","2022年6月9日",""],
	["ユニオン","戦艦","ニュージャージー","New_Jersey","スノーブライドラブ","ケッコン","600","指輪を贈る","通常","","","2022年6月9日",""],
	["重桜","駆逐","島風","Shimakaze","不思議の国のホワイトラビット","メルヘン","1180","限定販売","L2D","通常背景","有り","2022年6月30日",""],
	["ヴィシア","空母","ジョッフル","Joffre","籠中白雪","メルヘン","880","限定販売","通常","通常背景","有り","2022年6月30日",""],
	["ヴィシア","駆逐","ランドンターブル","Lindomptable","「赤ずきん」の悩み","メルヘン","880","限定販売","通常","通常背景","","2022年6月30日",""],
	["重桜","軽巡","神通","Jintsuu","狼の企み","メルヘン","780","限定販売","通常","通常背景","有り","2022年6月30日",""],
	["ユニオン","軽巡","ビロクシ","Biloxi","ロミオかジュリエット？","メルヘン","780","限定販売","通常","通常背景","有り","2022年6月30日",""],
	["鉄血","駆逐","Z23","Z23","フライドポテト、そしてスマイル！","その他","","日本未実装","通常","","","2022年7月5日","大陸版KFCコラボ"],
	["ヴィシア","重巡","アルジェリー","Algerie","イエスユアマジェスティ","メルヘン","880","限定販売","通常","通常背景","有り","2022年7月14日",""],
	["サディア","戦艦","ローマ","Roma","真夜中の白鳥","リズム＆ステップ","1200","限定販売","L2D","通常背景","有り","2022年7月28日",""],
	["重桜","空母","大鳳","Taihou","下校後の甘い時間","学園","1180","限定販売","L2D","通常背景","有り","2022年7月28日",""],
	["ユニオン","重巡","サンフランシスコ","San_Francisco","It's showtime!","リズム＆ステップ","900","限定販売","通常","通常背景","有り","2022年7月28日",""],
	["サディア","軽巡","ジュゼッペ・ガリバルディ","Giuseppe_Garibaldi","黒羽のノービルメンテ","リズム＆ステップ","900","限定販売","通常","通常背景","有り","2022年7月28日",""],
	["サディア","潜水","レオナルド・ダ・ヴィンチ","Leonardo_da_Vinci","ほとりに舞い立つ","リズム＆ステップ","880","限定販売","通常","通常背景","有り","2022年7月28日",""],
	["サディア","重巡","ボルツァーノ","Bolzano","アンビシャス・ダンス","リズム＆ステップ","880","限定販売","通常","通常背景","有り","2022年7月28日",""],
	["重桜","重巡","熊野","Kumano","一夜千夜の願い","リズム＆ステップ","800","限定販売","通常","通常背景","","2022年7月28日",""],
	["重桜","軽巡","三隈","Mikuma","花詞・舞踏献上","リズム＆ステップ","780","限定販売","通常","通常背景","有り","2022年7月28日",""],
	["サディア","駆逐","エマヌエーレ・ペッサーニョ","Emanuele_Pessagno","ドタバタブリーフィング","リズム＆ステップ","780","限定販売","通常","通常背景","有り","2022年7月28日",""],
	["サディア","駆逐","アルフレード・オリアーニ","Alfredo_Oriani","踊り出すヴィヴァーチェ","リズム＆ステップ","780","限定販売","通常","通常背景","有り","2022年7月28日",""],
	["重桜","駆逐","北風","Kitakaze","鳩と奇術の夜","リズム＆ステップ","","SP報酬","通常","通常背景","有り","2022年8月1日",""],
	["鉄血","軽巡","マクデブルク","Magdeburg","きらめく休日","水着","880","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["鉄血","軽母","ヴェーザー","Weser","美波の楽園","水着","780","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["鉄血","重巡","ブリュッヒャー","Blucher","頂上からフォーリンラブ","スポーツ","900","限定販売","通常","動く背景","有り","2022年8月18日",""],
	["ユニオン","空母","エセックス","Essex","ディテクティブ・エセックス","その他","880","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["鉄血","巡戦","ブリュンヒルデ","Brunhilde","パン食いのグラーネ","スポーツ","880","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["鉄血","潜水","U-96","U-96","バーベルは何キロまで？","スポーツ","880","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["北連","軽巡","キーロフ","Kirov","ハイジャンプ・スター","スポーツ","880","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["ユニオン","空母","ホーネット","Hornet","チアリング・ジャスティス！","スポーツ","800","限定販売","通常","動く背景","有り","2022年8月18日",""],
	["鉄血","駆逐","Z24","Z24","コート上のトイフェル","スポーツ","780","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["鉄血","駆逐","Z16","Z16","必勝ホームラン","スポーツ","780","限定販売","通常","通常背景","有り","2022年8月18日",""],
	["ユニオン","軽巡","ヘレナ","Helena","純白の奇跡","ケッコン","600","指輪を贈る","通常","","","2022年8月18日",""],
	["重桜","軽巡","五十鈴","Isuzu","駿馬？と共にいざ！","スポーツ","","限定イベ","通常","通常背景","有り","2022年8月18日",""],
	["ユニオン","駆逐","チャールズ・オースバーン","Charles_Ausburne","チャールズ・オースバーン改","改造","","近代化改修","通常","","","2022年8月18日",""],
	["ユニオン","駆逐","ラフィー","Laffey","てりやきツイスターに眠気を少々","その他","700","限定販売","通常","","","2022年9月1日",""],
	["重桜","駆逐","綾波","Ayanami","コーラに努力を添えて","その他","700","限定販売","通常","","","2022年9月1日",""],
	["鉄血","軽巡","エムデン","Emden","水月のリチェルカーレ","東煌風","900","限定販売","通常","通常背景","","2022年9月8日",""],
	["鉄血","潜水","U-81","U-81","灯火に照らす満月","東煌風","900","限定販売","通常","通常背景","","2022年9月8日",""],
	["重桜","軽巡","酒匂","Sakawa","恋愛一色華乙女","メイド","1180","限定販売","L2D","通常背景","有り","2022年9月15日",""],
	["重桜","駆逐","若月","Wakatsuki","ドタバタブルースパロー","メイド","880","限定販売","通常","通常背景","有り","2022年9月15日",""],
	["重桜","戦艦","三笠","Mikasa","ロマンシングトリップ","メイド","880","限定販売","通常","通常背景","有り","2022年9月15日",""],
	["重桜","戦艦","武蔵","Musashi","月影の菫","メイド","800","限定販売","通常","","","2022年9月15日",""],
	["重桜","駆逐","深雪","Miyuki","ショッピング・ランデブー","メイド","780","限定販売","通常","通常背景","有り","2022年9月15日",""],
	["重桜","駆逐","浜風","Hamakaze","味の決め手は愛！？","メイド","780","限定販売","通常","通常背景","有り","2022年9月15日",""],
	["重桜","駆逐","谷風","Tanikaze","ピカピカお掃除","メイド","780","限定販売","通常","通常背景","有り","2022年9月15日",""],
	["重桜","重巡","羽黒","Haguro","怪我の功名ってやつ？","メイド","780","限定販売","通常","通常背景","","2022年9月15日",""],
	["重桜","戦艦","陸奥","Mutsu","御狐の誤奉仕？","メイド","780","限定販売","通常","通常背景","有り","2022年9月15日",""],
	["ロイヤル","重巡","シュロップシャー","Shropshire","シュロップシャー改","改造","","近代化改修","通常","","","2022年9月15日",""],
	["ユニオン","軽巡","ジュノー(軽巡)","Juneau(light_cruiser)","ジュノー(軽巡)改","改造","","近代化改修","通常","","","2022年9月15日",""],
	["重桜","運送","樫野","Kashino","つまずきトラブルメイド","メイド","1080","限定販売","L2D","通常背景","","2022年9月22日",""],
	["ロイヤル","軽巡","ネプチューン","Neptune","深海艦船マリンスノー","パーティー","900","限定販売","通常","動く背景","有り","2022年9月22日",""],
	["鉄血","巡戦","ザイドリッツ","Seydlitz","フラワリー・リベレーション","パーティー","900","限定販売","通常","動く背景","有り","2022年9月22日",""],
	["ロイヤル","軽巡","カリブディス","Charybdis","輝かしの麗裳","パーティー","880","限定販売","通常","通常背景","有り","2022年9月22日",""],
	["重桜","戦艦","長門","Nagato","御狐の宴衣裳","パーティー","880","限定販売","通常","通常背景","","2022年9月22日",""],
	["ユニオン","軽巡","ジュノー(軽巡)","Juneau(light_cruiser)","白鳥の花園へ","パーティー","800","限定販売","通常","動く背景","有り","2022年9月22日",""],
	["東煌","軽母","鎮海","Chen_Hai","たゆたう波間","パーティー","800","限定販売","通常","動く背景","","2022年9月22日",""],
	["アイリス","駆逐","マイレ・ブレゼ","Maille_Breze","糖分休暇するのであーる","パーティー","780","限定販売","通常","通常背景","有り","2022年9月22日",""],
	["鉄血","駆逐","Z28","Z28","森の中のパーティー","パーティー","780","限定販売","通常","通常背景","","2022年9月22日",""],
	["ユニオン","戦艦","ネバダ","Nevada","煌びやかなる宴","パーティー","","限定イベ","通常","動く背景","","2022年9月22日",""],
	["ユニオン","重巡","ボルチモア","Baltimore","スプレンディッド・ギア","レースクイーン","1200","限定販売","L2D","動く背景","有り","2022年9月29日",""],
	["重桜","空母","信濃","Shinano","寝待の銀輿","レースクイーン","1200","限定販売","L2D","動く背景","有り","2022年9月29日",""],
	["重桜","駆逐","長波","Naganami","末永く波立たず","ケッコン","600","指輪を贈る","通常","","","2022年9月29日",""],
	["ロイヤル","軽巡","サウサンプトン","Southampton","輝かしい門出","ケッコン","600","指輪を贈る","通常","","","2022年9月29日",""],
	["ロイヤル","重巡","ロンドン","London","セレモニーオブプラチナ","ケッコン","600","指輪を贈る","通常","","","2022年9月29日",""],
	["北連","軽巡","パーミャチ・メルクーリヤ","Pamiat_Merkuria","待ち受けスタイル","私服","","SP報酬","通常","通常背景","有り","2022年10月1日",""],
	["ユニオン","駆逐","ラフィー","Laffey","スリープ・アーマゲドン","その他","780","限定販売","通常","通常背景","有り","2022年10月13日",""],
	["ロイヤル","駆逐","ジャベリン","Javelin","レジェンド達成！？","その他","780","限定販売","通常","通常背景","有り","2022年10月13日",""],
	["重桜","駆逐","綾波","Ayanami","ダイナミック・キックオフ","その他","780","限定販売","通常","通常背景","","2022年10月13日",""],
	["鉄血","駆逐","Z23","Z23","エンハンス失敗？！","その他","780","限定販売","通常","通常背景","有り","2022年10月13日",""],
	["ロイヤル","駆逐","ジェーナス","Janus","怖がりのランタンナイト","ハロウィン","1180","限定販売","L2D","通常背景","有り","2022年10月27日",""],
	["テンペスタ","風帆","ロイヤル・フォーチュン","Royal_Fortune","ディープワン・デリシャス","ハロウィン","880","限定販売","通常","通常背景","有り","2022年10月27日",""],
	["ロイヤル","軽母","アルビオン","Albion","妖精姫の銀月","ハロウィン","880","限定販売","通常","通常背景","有り","2022年10月27日",""],
	["ロイヤル","軽巡","マンチェスター","Manchester","スケアリー・ナイト・ケア","ハロウィン","780","限定販売","通常","通常背景","有り","2022年10月27日",""],
	["ユニオン","戦艦","オクラホマ","Oklahoma","パイレーツへんしん!","ハロウィン","780","限定販売","通常","通常背景","有り","2022年10月27日",""],
	["ユニオン","重巡","ブレマートン","Bremerton","ゆったりリラックスタイム","居間着","1180","限定販売","L2D","通常背景","有り","2022年11月24日",""],
	["ライザのアトリエ","軽母","クラウディア・バレンツ","Klaudia_Valentz","おやすみ前リコレクション","居間着","900","限定販売","通常","通常背景","有り","2022年11月24日","ライザのアトリエコラボ"],
	["ライザのアトリエ","戦艦","パトリツィア・アーベルハイム","Patricia_Abelheim","夢と現のリラックスタイム","居間着","900","限定販売","通常","通常背景","","2022年11月24日","ライザのアトリエコラボ"],
	["ライザのアトリエ","軽巡","ライザリン・シュタウト","Reisalin_Stout","夜更かしアルケミスト","居間着","820","限定販売","通常","","","2022年11月24日","ライザのアトリエコラボ"],
	["ライザのアトリエ","重巡","リラ・ディザイアス","Lila_Decyrus","月下の邂逅","居間着","800","限定販売","通常","通常背景","","2022年11月24日","ライザのアトリエコラボ"],
	["ライザのアトリエ","空母","セリ・グロース","Serri_Glaus","星月夜に夢見る妖精","居間着","800","限定販売","通常","通常背景","","2022年11月24日","ライザのアトリエコラボ"],
	["鉄血","軽巡","エルビング","Elbing","眠れない夜の願い","居間着","700","限定販売","通常","","","2022年11月24日",""],
	["ユニオン","軽巡","クリーブランド","Cleveland","南方の旅路","その他","","SP報酬","通常","通常背景","有り","2022年12月1日",""],
	["ユニオン","重巡","ノーザンプトンII","NorthamptonII","スター・アクアティック","水着","1180","限定販売","L2D","通常背景","","2022年12月22日",""],
	["重桜","軽巡","能代","Noshiro","レスト・イン・サンシャイン","水着","1180","限定販売","L2D","通常背景","有り","2022年12月22日",""],
	["アイリス","超巡","ブレスト","Brest","蒼海の織歌","水着","1180","限定販売","L2D","通常背景","有り","2022年12月22日",""],
	["鉄血","重巡","プリンツ・ハインリヒ","Prinz_Heinrich","セーフティラビッツ","水着","1180","限定販売","L2D","通常背景","有り","2022年12月22日",""],
	["ユニオン","空母","ヨークタウンII","YorktownII","ブライトスカイ・マーメイド","水着","980","限定販売","プチ","通常背景","有り","2022年12月22日",""],
	["ユニオン","空母","ホーネットII","HornetII","大海原を駆けよ","水着","980","限定販売","プチ","通常背景","","2022年12月22日",""],
	["重桜","駆逐","風雲","Kazagumo","風雲はドキドキと待ち受ける","水着","980","限定販売","プチ","通常背景","有り","2022年12月22日",""],
	["ロイヤル","軽巡","カリブディス","Charybdis","清しの水涼","水着","880","限定販売","通常","通常背景","","2022年12月22日",""],
	["重桜","駆逐","島風","Shimakaze","小休憩のサマーアイランド","水着","880","限定販売","通常","通常背景","有り","2022年12月22日",""],
	["東煌","軽巡","ハルビン","Harbin","奔放なる水天一色","水着","880","限定販売","通常","通常背景","","2022年12月22日",""],
	["ロイヤル","軽巡","プリマス","Plymouth","清爽のイノセントドール","水着","880","限定販売","通常","通常背景","","2022年12月22日",""],
	["北連","空母","チカロフ","Chkalov","シーサイド・ワーケーション","水着","880","限定販売","通常","通常背景","","2022年12月22日",""],
	["ユニオン","駆逐","ハムマンII","HammannII","ひねくれ戦争再び","水着","780","限定販売","通常","通常背景","","2022年12月22日",""],
	["ユニオン","軽母","ラングレーII","LangleyII","バケーション・オン・タイム","水着","780","限定販売","通常","通常背景","有り","2022年12月22日",""],
	["サディア","重巡","ボルツァーノ","Bolzano","アイキャッチ・トレジャー","水着","780","限定販売","通常","通常背景","","2022年12月22日",""],
	["ユニオン","軽巡","バーミンガム","Birmingham","行き先は風次第","水着","","限定イベ","通常","通常背景","","2022年12月22日",""],
	["ユニオン","駆逐","ベイリー","Bailey","ウサウササンタさん！","クリスマス","800","限定販売","通常","動く背景","","2022年12月22日",""],
	["ユニオン","軽母","プリンストン","Princeton","トナカイさんからの贈り物","クリスマス","800","限定販売","通常","動く背景","","2022年12月22日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","天使のナーシング","ホスピタル","","限定イベ","通常","通常背景","有り","2022年12月29日","大陸限定献血コラボ"],
	["鉄血","巡戦","プリンツ・ループレヒト","Prinz_Rupprecht","ドラゴンの龍門上り？","東煌風","1180","限定販売","L2D","通常背景","有り","2023年1月18日",""],
	["鉄血","超巡","エーギル","Aegir","祥雲に昇る金龍","東煌風","1180","限定販売","L2D","通常背景","有り","2023年1月18日",""],
	["東煌","軽巡","肇和","Chao_Ho","戯れる松梅・下","東煌風","1080","限定販売","L2D","通常背景","有り","2023年1月18日",""],
	["東煌","軽巡","応瑞","Ying_Swei","戯れる松梅・上","東煌風","1080","限定販売","L2D","通常背景","有り","2023年1月18日",""],
	["鉄血","潜水","U-47","U-47","dynamic rising","東煌風","900","限定販売","通常","動く背景","有り","2023年1月18日",""],
	["北連","軽巡","クイビシェフ","Kuybyshev","銀弦の嚮導兵","東煌風","900","限定販売","通常","動く背景","","2023年1月18日",""],
	["東煌","軽母","華甲","Hwah_Jah","霊幻艦船新春夜","東煌風","900","限定販売","プチ","動く背景","有り","2023年1月18日",""],
	["鉄血","巡戦","リュッツォウ","Lutzow","お熱いうちにちょうだい♪","東煌風","880","限定販売","通常","通常背景","有り","2023年1月18日",""],
	["東煌","軽巡","逸仙","Yat_Sen","螓首蛾眉","東煌風","880","限定販売","プチ","通常背景","有り","2023年1月18日",""],
	["ユニオン","戦艦","アラバマ","Alabama","緞子金襴","東煌風","880","限定販売","通常","通常背景","","2023年1月18日",""],
	["ロイヤル","軽母","シーシュース","Theseus","春告鳥の羽根は白く","東煌風","880","限定販売","通常","通常背景","有り","2023年1月18日",""],
	["東煌","駆逐","長春","Chang_Chun","鴻运来迎","東煌風","800","限定販売","通常","動く背景","有り","2023年1月18日",""],
	["鉄血","潜水","U-110","U-110","シャーク・イン・ザ・スプリング","東煌風","800","限定販売","通常","動く背景","有り","2023年1月18日",""],
	["東煌","運送","定安","Ting_An","白玉柔憐","東煌風","780","限定販売","通常","通常背景","有り","2023年1月18日",""],
	["ヴィシア","駆逐","ランドンターブル","Lindomptable","ほやほや一日店員さん！","東煌風","780","限定販売","通常","通常背景","","2023年1月18日",""],
	["東煌","駆逐","撫順","Fu_Shun","四天王のバオズ釣り","東煌風","","限定イベ","通常","通常背景","","2023年1月18日",""],
	["東煌","軽巡","逸仙","Yat_Sen","逸仙改","改造","","近代化改修","通常","","","2023年1月18日",""],
	["重桜","駆逐","夕暮","Yuugure","海辺の遊戯","水着","","SP報酬","通常","通常背景","有り","2023年2月1日",""],
	["鉄血","軽母","エルベ","Elbe","清らかのヴァレンチンズターク","私服","1080","限定販売","L2D","通常背景","","2023年2月9日",""],
	["北連","軽巡","パーミャチ・メルクーリヤ","Pamiat_Merkuria","水星からスキをチョコにこめて","居間着","780","限定販売","通常","通常背景","有り","2023年2月9日",""],
	["重桜","重巡","羽黒","Haguro","ナイトフォール・キャッチャー","私服","780","限定販売","通常","通常背景","","2023年2月9日",""],
	["ロイヤル","空母","インプラカブル","Implacable","迷える指揮官を導いて","学園","980","限定販売","プチ","動く背景","有り","2023年2月23日",""],
	["ロイヤル","駆逐","ジェーナス","Janus","フィッティング・ラブ","学園","980","限定販売","プチ","動く背景","有り","2023年2月23日",""],
	["ロイヤル","戦艦","ロイヤル・オーク","Royal_Oak","シャイネス・オーク","学園","880","限定販売","通常","通常背景","有り","2023年2月23日",""],
	["ユニオン","軽巡","マーブルヘッド","Marblehead","アンティシペイティッド・レイン","学園","880","限定販売","プチ","動く背景","有り","2023年2月23日",""],
	["鉄血","重巡","プリンツ・ハインリヒ","Prinz_Heinrich","裏の裏番長？","学園","880","限定販売","通常","通常背景","有り","2023年2月23日",""],
	["ロイヤル","軽巡","シラ","Scylla","後輩ちゃんに溺れて","学園","800","限定販売","通常","","","2023年2月23日",""],
	["ロイヤル","軽母","アーガス","Argus","学園暁を覚えず","学園","780","限定販売","通常","通常背景","有り","2023年2月23日",""],
	["ロイヤル","駆逐","ヒーロー","Hero","隣のデモニックヒーローちゃん","学園","780","限定販売","通常","通常背景","有り","2023年2月23日",""],
	["重桜","駆逐","海風","Umikaze","Baby steps","学園","780","限定販売","通常","通常背景","有り","2023年2月23日",""],
	["ロイヤル","戦艦","クイーン・エリザベス","Queen_Elizabeth","シーサイドオーダーズ","水着","","特典コード","通常","","","2023年7月27日",""],
	["北連","重巡","クルスク","Kursk","湯煙の孤狼","温泉タイム","1180","限定販売","L2D","通常背景","有り","2023年3月23日",""],
	["北連","軽巡","ヴォロシーロフ","Voroshilov","暖雪を景色に・まごころを君に","温泉タイム","980","限定販売","プチ","通常背景","有り","2023年3月23日",""],
	["北連","戦艦","セヴァストポリ","Sevastopol","微醺どころじゃない…？！","温泉タイム","880","限定販売","通常","通常背景","有り","2023年3月23日",""],
	["ヴィシア","空母","ジョッフル","Joffre","極楽のエリュシオン","温泉タイム","980","限定販売","プチ","通常背景","有り","2023年3月23日",""],
	["サディア","重巡","トリエステ","Trieste","湯浴のイナモラメント","温泉タイム","880","限定販売","プチ","通常背景","有り","2023年3月23日",""],
	["北連","駆逐","グロズヌイ","Grozny","野ウサギと蒸し湯部屋","温泉タイム","1080","限定販売","L2D","通常背景","有り","2023年3月23日",""],
	["鉄血","軽巡","マインツ","Mainz","珈琲紗羅","温泉タイム","880","限定販売","通常","通常背景","有り","2023年3月23日",""],
	["ヴィシア","駆逐","ヴォークラン","Vauquelin","パラレルアドベンチャー","その他","","SP報酬","通常","通常背景","有り","2023年4月1日",""],
	["重桜","空母","赤城","Akagi","甜菓の路畔","お正月","880","限定販売","通常","通常背景","有り","2023年4月27日",""],
	["重桜","戦艦","三笠","Mikasa","青花小町","お正月","880","限定販売","通常","通常背景","有り","2023年4月27日",""],
	["DOAXVV","巡戦","たまき","Tamaki(DOA)","ヴィーナス・シャワータイム","水着","900","限定販売","通常","通常背景","","2023年4月27日","DOAXVVコラボ"],
	["DOAXVV","軽母","ルナ","Luna(DOA)","ビーチの女神","水着","1000","限定販売","プチ","通常背景","有り","2023年4月27日","DOAXVVコラボ"],
	["DOAXVV","駆逐","マリー・ローズ","Marie-Rose(DOA)","湯けむりのヴィーナス","温泉タイム","1200","限定販売","L2D","通常背景","","2023年4月27日","DOAXVVコラボ"],
	["重桜","空母","大鳳","Taihou","白浜のデイドリーム","水着","1180","限定販売","L2D","通常背景","有り","2023年5月25日",""],
	["ユニオン","重巡","アンカレッジ","Anchorage","ドルフィンブルー・レッスン","水着","1180","限定販売","L2D","通常背景","有り","2023年5月25日",""],
	["ユニオン","戦艦","ニュージャージー","New_Jersey","盛夏のレジャータイム","水着","1180","限定販売","L2D","通常背景","有り","2023年5月25日",""],
	["ユニオン","空母","タイコンデロガ","Ticonderoga","サンシャイン・プリンセス","水着","880","限定販売","通常","通常背景","有り","2023年5月25日",""],
	["テンペスタ","風帆","ロイヤル・フォーチュン","Royal_Fortune","海辺の掟約","水着","980","限定販売","プチ","通常背景","有り","2023年5月25日",""],
	["鉄血","軽母","ヤーデ","Jade","真夏をぺろりと","水着","780","限定販売","通常","通常背景","有り","2023年5月25日",""],
	["重桜","軽巡","酒匂","Sakawa","フォレスト・キャンディ","水着","880","限定販売","通常","通常背景","有り","2023年5月25日",""],
	["鉄血","戦艦","ビスマルクZwei","BismarckZwei","清澈のヴィントシュティレ","水着","980","限定販売","プチ","通常背景","有り","2023年5月25日",""],
	["ロイヤル","軽巡","マンチェスター","Manchester","佇む波際の一刻","水着","780","限定販売","通常","通常背景","有り","2023年5月25日",""],
	["鉄血","軽巡","レーゲンスブルク","Regensburg","闇龍と光の海岸","水着","1180","限定販売","L2D","通常背景","有り","2023年5月25日",""],
	["鉄血","駆逐","オットー・フォン・アルフェンスレーベン","Otto_von_Alvensleben","艦船と落とし穴","水着","880","限定販売","通常","通常背景","有り","2023年5月25日",""],
	["東煌","軽巡","逸仙","Yat_Sen","清茶馥郁","東煌風","","限定イベ","通常","通常背景","有り","2023年5月25日",""],
	["ロイヤル","戦艦","ネルソン","Nelson","ネルソン改","改造","","近代化改修","通常","","","2023年5月25日",""],
	["重桜","空母","加賀","Kaga","狐舞皚々","その他","","SP報酬","通常","通常背景","有り","2023年6月1日",""],
	["ユニオン","軽巡","クリーブランド","Cleveland","ゴールデン・コンダクター","パーティー","","限定イベ","通常","通常背景","有り","2023年6月1日",""],
	["ロイヤル","空母","イラストリアス","Illustrious","優しき光は音色とともに","パーティー","900","限定販売","通常","通常背景","有り","2023年6月1日",""],
	["ユニオン","駆逐","ラフィー","Laffey","レイジー・デイタイム","パーティー","800","限定販売","プチ","通常背景","有り","2023年6月1日",""],
	["重桜","巡戦","天城","Amagi","紅鳶の寸閑","パーティー","1180","限定販売","L2D","通常背景","有り","2023年6月1日",""],
	["北連","軽巡","チャパエフ","Chapayev","白騎兵のメロディヤ","パーティー","900","限定販売","通常","通常背景","有り","2023年6月1日",""],
	["ロイヤル","軽母","ユニコーン","Unicorn","幸せムーブメント","パーティー","800","限定販売","通常","通常背景","有り","2023年6月1日",""],
	["重桜","駆逐","綾波","Ayanami","紺青礼装（非武装）","パーティー","780","限定販売","通常","通常背景","有り","2023年6月1日",""],
	["鉄血","重巡","プリンツ・ハインリヒ","Prinz_Heinrich","ハインリヒ・オンステージ","パーティー","900","限定販売","通常","通常背景","有り","2023年6月1日",""],
	["アイリス","戦艦","シャンパーニュ","Champagne","久遠讃訟","ケッコン","600","指輪を贈る","通常","","","2023年6月8日",""],
	["ロイヤル","軽巡","ハーマイオニー","Hermione","朝霞の誓い","ケッコン","600","指輪を贈る","通常","","","2023年6月8日",""],
	["東煌","軽巡","ハルビン","Harbin","ペオニア・レッド","ケッコン","600","指輪を贈る","通常","","","2023年6月8日",""],
	["東煌","軽巡","海天","Hai_Tien","飛仙にあやかりて","その他","","限定イベ","通常","","有り","2023年6月8日",""],
	["サディア","重巡","ゴリツィア","Gorizia","叶わぬオフィスラブ？","仕事百般","1180","限定販売","L2D","通常背景","","2023年6月29日",""],
	["サディア","駆逐","アッティリオ・レゴロ","Attilio_Regolo","ひらめきのお城","仕事百般","880","限定販売","通常","通常背景","有り","2023年6月29日",""],
	["サディア","戦艦","アンドレア・ドーリア","Andrea_Doria","Have a safe flight！","仕事百般","780","限定販売","通常","通常背景","有り","2023年6月29日",""],
	["ロイヤル","重巡","ロンドン","London","敏腕のセクレタリー","仕事百般","880","限定販売","プチ","通常背景","有り","2023年6月29日",""],
	["ユニオン","空母","エセックス","Essex","クロスボーン・エキストラ","仕事百般","980","限定販売","プチ","通常背景","有り","2023年6月29日",""],
	["サディア","戦艦","リットリオ","Littorio","雨に唄えば","仕事百般","880","限定販売","通常","通常背景","有り","2023年6月29日",""],
	["ロイヤル","巡戦","フッド","Hood","淑女とサラブレッド","仕事百般","880","限定販売","通常","通常背景","有り","2023年6月29日",""],
	["SSSS","航戦","2代目","The_2nd","プライベート・タイム","居間着","900","限定販売","通常","通常背景","有り","2023年7月20日","SSSSコラボ"],
	["SSSS","運送","ひめ","Princess","ナイトキャップ・タイム","居間着","900","限定販売","通常","通常背景","有り","2023年7月20日","SSSSコラボ"],
	["SSSS","軽巡","宝多六花","Takarada_Rikka","マイ・ルーム・ウェア","居間着","900","限定販売","通常","通常背景","有り","2023年7月20日","SSSSコラボ"],
	["SSSS","戦艦","新条アカネ","Shinjo_Akane","シークレット・ルーム","居間着","900","限定販売","通常","通常背景","有り","2023年7月20日","SSSSコラボ"],
	["SSSS","重巡","南夢芽","Minami_Yume","モーニング・ルーティーン","居間着","900","限定販売","通常","通常背景","有り","2023年7月20日","SSSSコラボ"],
	["SSSS","空母","飛鳥川ちせ","Asukagawa_Chise","ハッピー・ランドリー","居間着","900","限定販売","通常","通常背景","有り","2023年7月20日","SSSSコラボ"],
	["ヴィシア","重巡","フォッシュ","Foch","愛寵のマジョルドム","その他","","SP報酬","通常","","","2023年8月1日",""],
	["ヴィシア","軽巡","マルセイエーズ","Marseillaise","戦闘天使のエクササイズ","スポーツ","980","限定販売","プチ","通常背景","有り","2023年8月3日",""],
	["ユニオン","戦艦","ウェストバージニア","West_Virginia","ウェストバージニア改","改造","","近代化改修","通常","通常背景","有り","2023年8月17日",""],
	["ユニオン","戦艦","ウェストバージニア","West_Virginia","シーニック・ラプソディ","スポーツ","780","限定販売","通常","通常背景","有り","2023年8月17日",""],
	["ユニオン","空母","エンタープライズ","Enterprise","スカイスケープ・ダイバー","水着","1180","限定販売","L2D","通常背景","有り","2023年8月17日",""],
	["ユニオン","軽巡","ヘレナ","Helena","光輝のトライアングルウェーブ","水着","1080","限定販売","L2D","通常背景","有り","2023年8月17日",""],
	["北連","駆逐","キエフ","Kiev","フロスティング・フェアリー","リズム＆ステップ","","限定イベ","通常","通常背景","有り","2023年8月17日",""],
	["アイリス","軽巡","ギシャン","Guichen","氷上のソルシエール","スポーツ","900","限定販売","通常","動く背景","有り","2023年8月17日",""],
	["アイリス","戦艦","リヨン","Lyon","ペア・エクササイズ","スポーツ","780","限定販売","通常","通常背景","有り","2023年8月17日",""],
	["ヴィシア","戦艦","クレマンソー","Clemenceau","ブリーズ・スプレンディド","スポーツ","1180","限定販売","L2D","通常背景","有り","2023年8月17日",""],
	["アイリス","空母","パンルヴェ","Painleve","二人の柔軟体操","スポーツ","980","限定販売","プチ","通常背景","有り","2023年8月17日",""],
	["ヴィシア","駆逐","ケルサン","Kersaint","ホーリー・ランニング","スポーツ","880","限定販売","プチ","通常背景","有り","2023年8月17日",""],
	["アイリス","重巡","シュフラン","Suffren","インパルシブ・アクシデント","スポーツ","780","限定販売","通常","通常背景","有り","2023年8月17日",""],
	["ユニオン","空母","ヨークタウン","Yorktown","光る風の明日へ","ケッコン","600","指輪を贈る","通常","","","2023年8月17日",""],

]

var kansen_nouryoku = [];
var kansen_namelist = {};
var kensaku_kansen = {除外:[],新規:[],META:[],計画艦:[],コラボ:[],通常:[]};
var kensaku_list = [];
var ranking_deta= {駆逐:[],軽巡:[],重巡:[],超巡:[],砲艦:[],戦艦:[],巡戦:[],軽母:[],空母:[],航戦:[],潜水:[],潜母:[],運送:[],工作:[],ミ駆:[],風帆:[]};
var weapon_keys = {ALL:'',無し:'',駆逐:'',軽巡:'',重巡:'',大口径主砲:'',超巡主砲:'',戦艦:'',魚雷:'',ミサイル:'',潜水艦砲:'',潜水:'',対空:'',戦闘機:'',爆撃機:'',攻撃機:'',水上機:'',航戦艦載機:'',耐久系:'',攻撃系:'',その他:'',対潜爆雷:'',対潜機:'',特殊装備:'',大砲:''};
var kantype_list= {駆逐:[],軽巡:[],重巡:[],超巡:[],砲艦:[],戦艦:[],巡戦:[],軽母:[],空母:[],航戦:[],潜水:[],潜母:[],運送:[],工作:[],ミ駆:[],風帆:[]};
var reality_list = {N:{},R:{},SR:{},SSR:{},UR:{},PR:{},DR:{}};
var nations_list = {ユニオン:{省略:'ユニオン'},ロイヤル:{省略:'ロイヤル'},重桜:{省略:'重桜'},鉄血:{省略:'鉄血'},アイリス:{省略:'アイリス'},ヴィシア:{省略:'ヴィシア'},サディア:{省略:'サディア'},テンペスタ:{省略:'テンペスタ'},東煌:{省略:'東煌'},北連:{省略:'北連'},META:{省略:'META'},ネプテューヌ:{省略:'ネプコラ'},うたわれるもの:{省略:'うたわれ'},KizunaAI:{省略:'KizunaAI'},ホロライブ:{省略:'ホロライブ'},DOAXVV:{省略:'DOAXVV'},アイドルマスター:{省略:'アイマス'},SSSS:{省略:'SSSS'},ライザのアトリエ:{省略:'ライザ'},その他:{省略:'その他'},}

//着せ替え名オブジェクト
var N8_kisekae_list = {};
//着せ替え名配列
var N8_kisekae_hairetulist = [];
//並び替え用配列
var N8_kisekae_sortlist = [];
//テーマ毎
var N8_kisekae_theme_list = {};
//ダイヤ順
var N8_dia_list = {};
//実装日順
var N8_release_list = {};
//テーマ
var skin_theme_list = {ALL:'all',クリスマス:'xmas',お正月:'newyear',東煌風:'spring',学園:'school',水着:'summer',パーティー:'party',ハロウィン:'helloween',私服:'casual',夏祭り:'festival',LIVE:'live',特殊演習:'specialexercise',スポーツ:'sport',レースクイーン:'racequeen',ホスピタル:'hospital',バニー:'bunny',メイド:'maid',永き夜の招き:'vampire',メルヘン:'fairytale',居間着:'homerelaxation',"リズム＆ステップ":'dance',温泉タイム:'hotsprings',仕事百般:'work',改造:'retrofit',ケッコン:'wedding',その他:'misc'};

window.addEventListener('DOMContentLoaded', function() {
    for(var i=0;i<kan_profile.length; i++){
        var inputstatus_deta = {
            陣営:kan_profile[i][0],
            艦種:kan_profile[i][1],
            正規名:kan_profile[i][2],
            レア:kan_profile[i][3],
            記事:kan_profile[i][12],
            声優:kan_profile[i][8],
            絵師:kan_profile[i][9],
            入手:kan_profile[i][4],
            実装日:kan_profile[i][5],
            改造日:kan_profile[i][6],
            進水日:kan_profile[i][7],
            起工日:kan_profile[i][13],
            竣工日:kan_profile[i][14],
            艦級:kan_profile[i][15],
            除外:kan_profile[i][16],
            評価:kan_profile[i][18],
            建造:kan_profile[i][19],
            突破:kan_profile[i][20],
            表記:kan_profile[i][21],
            接頭辞:kan_profile[i][22],
            リンク:kan_profile[i][23],
            番号:kan_profile[i][24],
            wpurl:kan_profile[i][25],
            blogurl:('https://pasokau.com/'+kan_profile[i][25]),
            ローカル001:('C:/Users/soujininn/Documents/ハテナ用/azpicture/'+kingdeta(kan_profile[i][0])+'/'+kan_profile[i][23]+'/'+kan_profile[i][23]+'001.png'),
            ローカル002:('C:/Users/soujininn/Documents/ハテナ用/azpicture/'+kingdeta(kan_profile[i][0])+'/'+kan_profile[i][23]+'/'+kan_profile[i][23]+'002.png'),
            ローカル003:('C:/Users/soujininn/Documents/ハテナ用/azpicture/'+kingdeta(kan_profile[i][0])+'/'+kan_profile[i][23]+'/'+kan_profile[i][23]+'003.png'),
            フェイス:('https://pasokau.com/wp-content/uploads/face/'+kan_profile[i][2]+'.jpg'),
            立ち絵:('https://pasokau.com/wp-content/uploads/skin/'+kingdeta(kan_profile[i][0])+'/'+kan_profile[i][23]+'/'+kan_profile[i][2]+'.jpg'),
            アクセス:('https://pasokau.com/wp-content/uploads/skin/'+kingdeta(kan_profile[i][0])+'/'+kan_profile[i][23]+'/'),
            ローカルアクセス:('C:/Users/soujininn/Documents/ハテナ用/skin/'+kingdeta(kan_profile[i][0])+'/'+kan_profile[i][23]+'/'),
        };
        kansen_nouryoku.push(inputstatus_deta);

        if(kansen_nouryoku[i].正規名.slice(-1) === '改'){
            //改は改造後のレアを表示
            rarecolor = kansen_nouryoku[i].レア.substring(kansen_nouryoku[i].レア.indexOf('→')+1);
            //kansen_nouryoku[i].正式名称  = kan_profile[i][2].substring(0,kan_profile[i][2].indexOf('改'));
            kansen_nouryoku[i].正式名称  = kan_profile[i][2];
        }else if(kansen_nouryoku[i].正規名.slice(-4) ===  '(半改)'){
            //半改は改造前のレアを表示
            rarecolor = kansen_nouryoku[i].レア.substring(0,kansen_nouryoku[i].レア.indexOf('→'));
            kansen_nouryoku[i].正式名称  = kan_profile[i][2].substring(0,kan_profile[i][2].indexOf('(半改)'));
        }else if(kansen_nouryoku[i].レア.indexOf('→' )!= -1){
            //改造のあるキャラは改造前のレアを表示
            rarecolor = kansen_nouryoku[i].レア.substring(0,kansen_nouryoku[i].レア.indexOf('→'));
            kansen_nouryoku[i].正式名称  = kan_profile[i][2];
        }else{
            rarecolor =kansen_nouryoku[i].レア;
            kansen_nouryoku[i].正式名称  = kan_profile[i][2];
        }
        kansen_nouryoku[i].修正レア = rarecolor;
        kansen_nouryoku[i].ソート = i;
        kansen_namelist[kansen_nouryoku[i]['正式名称']]=kansen_nouryoku[i];
    }
  
    for(var i=0; i<kisekaeskn.length;i++){

        var pattern = /[\年\月\日]/;
        var hiduke = kisekaeskn[i][11].split(pattern);
        hiduke = (hiduke[0]+'/'+hiduke[1].padStart(2,"0")+'/'+hiduke[2].padStart(2,"0"));

        N8_kisekae_list[kisekaeskn[i][4]] = {
            陣営:kisekaeskn[i][0],
            艦種:kisekaeskn[i][1],
            名前:kisekaeskn[i][2],
            レア:kansen_namelist[kisekaeskn[i][2]]['修正レア'],
            URL:kansen_namelist[kisekaeskn[i][2]]['wpurl'],
            顔画像:kansen_namelist[kisekaeskn[i][2]]['フェイス'],
            アクセス:kansen_namelist[kisekaeskn[i][2]]['アクセス'],
            ローカルアクセス:kansen_namelist[kisekaeskn[i][2]]['ローカルアクセス'],
            着せ替え:kisekaeskn[i][4],
            テーマ:kisekaeskn[i][5],
            価格:kisekaeskn[i][6],
            入手方法:kisekaeskn[i][7],
            L2D:kisekaeskn[i][8],
            背景:kisekaeskn[i][9],
            オプション:kisekaeskn[i][10],
            実装日:kisekaeskn[i][11],
            実装日変換:hiduke,
            備考:kisekaeskn[i][12],
            blogurl:kansen_namelist[kisekaeskn[i][2]]['blogurl'],
            imgurl:('https://pasokau.com/wp-content/uploads/kisekae_face/'+kisekaeskn[i][4]+'.jpeg'),
            imgurl02:(kansen_namelist[kisekaeskn[i][2]]['ローカルアクセス']+kisekaeskn[i][4]+'.jpg'),
            imgurl03:('C:/Users/soujininn/Documents/ハテナ用/kisekae_face/'+kisekaeskn[i][4]+'.jpeg'),
            タグ:('<div class="oyamycanvas"><canvas class="myCanvas" width="" height="" data-name="'+kisekaeskn[i][4]+'"></canvas></div>'),
            親クラス:'.oyamycanvas',
            子クラス:'.myCanvas',
            キャンバス横:100,
            キャンバス縦:100,
        }
        N8_kisekae_hairetulist.push(N8_kisekae_list[kisekaeskn[i][4]]);

        if(N8_kisekae_theme_list[kisekaeskn[i][5]]){
            ;
        }else{
            N8_kisekae_theme_list[kisekaeskn[i][5]]= {};
        }
        N8_kisekae_theme_list[kisekaeskn[i][5]][kisekaeskn[i][4]] = structuredClone(N8_kisekae_list[Object.keys(N8_kisekae_list)[i]]);
    }
    N8_kisekae_sortlist = structuredClone(N8_kisekae_hairetulist);

    var hokan01 = "";
    for(var i=0;i<Object.keys(ranking_deta).length;i++){
        hokan01 += (i === 0) ? ('<select oninput="N8_kisekae_sort_mood();" id="N8_sort_kantype">\n'+'<option value="ALL" selected="selected">全ての艦種</option>\n') : '';
        hokan01 += ('<option value="'+Object.keys(ranking_deta)[i]+'">'+Object.keys(ranking_deta)[i]+'</option>\n');
        hokan01 += (i === Object.keys(ranking_deta).length - 1) ? '</select>\n' : '';
    }
    var hokan02 = "";
    for(var i=0;i<Object.keys(nations_list).length;i++){
        hokan02 += (i === 0) ? ('<select oninput="N8_kisekae_sort_mood();" id="N8_sort_nations">\n'+'<option value="ALL" selected="selected">全ての陣営</option>\n') : '';
        hokan02 += ('<option value="'+Object.keys(nations_list)[i]+'">'+nations_list[Object.keys(nations_list)[i]]['省略']+'</option>\n');
        hokan02 += (i === Object.keys(nations_list).length - 1) ? '</select>\n' : '';
    }
    var hokan03 = "";
    for(var i=0;i<Object.keys(reality_list).length;i++){
        hokan03 += (i === 0) ? ('<select oninput="N8_kisekae_sort_mood();" id="N8_sort_reality">\n'+'<option value="ALL" selected="selected">全てのレア</option>\n') : '';
        hokan03 += ('<option value="'+Object.keys(reality_list)[i]+'">'+Object.keys(reality_list)[i]+'</option>\n');
        hokan03 += (i === Object.keys(reality_list).length - 1) ? '</select>\n' : '';
    }
    var hokan04 = (
        '<select oninput="N8_kisekae_sort_mood();" id="N8_sort_kisekaetheme">\n'+
        '<option value="ALL">全てのテーマ</option>\n'+
        '<option value="クリスマス">クリスマス</option>\n'+
        '<option value="お正月">お正月</option>\n'+
        '<option value="東煌風">東煌風</option>\n'+
        '<option value="学園">学園</option>\n'+
        '<option value="水着">水着</option>\n'+
        '<option value="パーティー">パーティー</option>\n'+
        '<option value="ハロウィン">ハロウィン</option>\n'+
        '<option value="私服">私服</option>\n'+
        '<option value="夏祭り">夏祭り</option>\n'+
        '<option value="LIVE">LIVE</option>\n'+
        '<option value="特殊演習">特殊演習</option>\n'+
        '<option value="スポーツ">スポーツ</option>\n'+
        '<option value="レースクイーン">レースクイーン</option>\n'+
        '<option value="ホスピタル">ホスピタル</option>\n'+
        '<option value="バニー">バニー</option>\n'+
        '<option value="メイド">メイド</option>\n'+
        '<option value="永き夜の招き">永き夜の招き</option>\n'+
        '<option value="メルヘン">メルヘン</option>\n'+
        '<option value="居間着">居間着</option>\n'+
        '<option value="リズム＆ステップ">リズム＆ステップ</option>\n'+
        '<option value="温泉タイム">温泉タイム</option>\n'+
        '<option value="仕事百般">仕事百般</option>\n'+
        '<option value="改造">改造</option>\n'+
        '<option value="ケッコン">ケッコン</option>\n'+
        '<option value="その他">その他</option>\n'+
        '</select>\n'
        );
        var hokan05 = (
        '<select oninput="N8_kisekae_sort_mood();" id="N8_sort_kisekaegimmick">\n'+
        '<option value="ALL" selected="selected">全てのギミック</option>\n'+
        '<option value="通常">通常</option>\n'+
        '<option value="L2D">L2D</option>\n'+
        '<option value="プチ">プチ</option>\n'+
        '</select>\n'
    );
    var hokan06 = (
        '<select oninput="N8_kisekae_sort_mood();" id="N8_sort_kisekaeget">\n'+
        '<option value="ALL" selected="selected">全ての入手方法</option>\n'+
        '<option value="近代化改修">近代化改修</option>\n'+
        '<option value="指輪を贈る">指輪を贈る</option>\n'+
        '<option value="常設販売">常設販売</option>\n'+
        '<option value="限定販売">限定販売</option>\n'+
        '<option value="SP報酬">SP報酬</option>\n'+
        '<option value="コアデータ">コアデータ</option>\n'+
        '<option value="チケット">チケット</option>\n'+
        '<option value="キャラスト">キャラスト</option>\n'+
        '<option value="常設イベ">常設イベ</option>\n'+
        '<option value="限定イベ">限定イベ</option>\n'+
        '<option value="コラボイベ">コラボイベ</option>\n'+
        '<option value="特典コード">特典コード</option>\n'+
        '<option value="日本未実装">日本未実装</option>\n'+
        '</select>\n'
    );
    var hokan07 = (
        '<select oninput="N8_kisekae_sort_mood();" id="N8_sort_kisekaesortid">\n'+
        '<option value="ALL" selected="selected">通常並び</option>\n'+
        '<option value="ダイヤ（昇順）">ダイヤ（昇順）</option>\n'+
        '<option value="ダイヤ（降順）">ダイヤ（降順）</option>\n'+
        '<option value="実装日（昇順）">実装日（昇順）</option>\n'+
        '<option value="実装日（降順）">実装日（降順）</option>\n'+
        '</select>\n'
    )
    document.getElementById("N8_subbox").insertAdjacentHTML("beforeend",
    '<div>'+
        hokan01+
        hokan02+
        hokan03+
    '</div>'+
    '<div>'+
        hokan04+
        hokan05+
        hokan06+
        hokan07+
    '</div>'
    )
    let selected_food = document.getElementById("N8_subbox").dataset.theme;
    let options = document.getElementById('N8_sort_kisekaetheme').options;
    for (let option of options) {
      if(option.value === selected_food) option.selected = true;
    }
	document.getElementById('N8_sort_kisekaetheme').style.display = (document.getElementById('N8_sort_kisekaetheme').value == "ALL") ? "block" : "none";
    var linkpage = (
        '<select id="N8_page_move" onchange="N8_page_request();">\n'+
        '<option value="">ページ移動</option>\n'+
        '<option value="https://pasokau.com/skin_theme_manual">使い方を知る</option>\n'+
        '<option value="https://pasokau.com/skin_theme_all">全てのテーマ</option>\n'
        );
    for(var i=1; i<Object.keys(skin_theme_list).length; i++){
        linkpage += ('<option value="https://pasokau.com/skin_theme_'+skin_theme_list[Object.keys(skin_theme_list)[i]]+'">'+Object.keys(skin_theme_list)[i]+'</option>\n');
    }
    linkpage += '</select>\n'
    document.getElementById("N8_page_link").insertAdjacentHTML('beforeend',linkpage);
});

var kingdeta = function(jin){
    switch(jin){
        case "ユニオン":
            return "Eagle_Union";
        break;
        case "ロイヤル":
            return "Royal_Navy";
        break;
        case "重桜":
            return "Sakura_Empire";
        break;
        case "鉄血":
            return "Iron_Blood";
        break;
        case "アイリス":
            return "Iris_Libre";
        break;
        case "ヴィシア":
            return "Vichya_Dominion";
        break;
        case "サディア":
            return "Sardegna_Empire";
        break;
        case "テンペスタ":
            return "Tempesta";
        break;
        case "東煌":
            return "Dragon_Empery";
        break;
        case "北連":
            return "Northern_Parliament";
        break;
        case "META":
            return "Universal";
        break;
        case "その他":
            return "Universal";
        break;
        case "BILIBILI":
            return "Collab_Nations";
        break;
        default:
            return "Collab_Nations";
        break;
    }
}

function N8_page_request() {
    if(document.getElementById('N8_page_move').value != '') {
        location.href = document.getElementById('N8_page_move').value;
    }
};
function N8_startbutton(){
    document.getElementById("N8_subbox").style.opacity = 1;
    N8_kisekae_sort_mood();
}
function N8_kisekae_sort_mood(){
    var N8_sortid = document.getElementById("N8_sort_kisekaesortid").value;
    switch(N8_sortid){
        case 'ダイヤ（昇順）':
            N8_kisekae_sortlist.sort((a, b) => a['価格'] - b['価格']);
        break;
        case 'ダイヤ（降順）':
            N8_kisekae_sortlist.sort((a, b) => b['価格'] - a['価格']);
        break;
        case '実装日（昇順）':
            N8_kisekae_sortlist.sort((a, b) => new Date(a['実装日変換']) - new Date(b['実装日変換']));
        break;
        case '実装日（降順）':
            N8_kisekae_sortlist.sort((a, b) => new Date(b['実装日変換']) - new Date(a['実装日変換']));
        break;
        default:
            N8_kisekae_sort(N8_kisekae_hairetulist);
        break;
    }
    if(N8_sortid !== 'ALL'){
        N8_kisekae_sort(N8_kisekae_sortlist);
    }
}
function N8_kisekae_sort(hako){
    var skincount = 0,dia = 0,season = 0,hokan = "";
    for(var i=0;i<hako.length;i++){
        if(
            (document.getElementById("N8_sort_nations").value == "ALL" || document.getElementById("N8_sort_nations").value == hako[i].陣営) &&
            (document.getElementById("N8_sort_kantype").value == "ALL" || document.getElementById("N8_sort_kantype").value == hako[i].艦種) &&
            (document.getElementById("N8_sort_reality").value == "ALL" || document.getElementById("N8_sort_reality").value == hako[i].レア) &&
            (document.getElementById("N8_sort_kisekaetheme").value == "ALL" || document.getElementById("N8_sort_kisekaetheme").value == hako[i].テーマ) &&
            (document.getElementById("N8_sort_kisekaegimmick").value == "ALL" || document.getElementById("N8_sort_kisekaegimmick").value == hako[i]['L2D']) &&
            (document.getElementById("N8_sort_kisekaeget").value == "ALL" || document.getElementById("N8_sort_kisekaeget").value == hako[i].入手方法)
        ){
            var l2d = (hako[i]['L2D'] == "通常") ? "" : "（"+hako[i]['L2D']+"）";
            var kakaku = (hako[i]['価格'] == "") ? "" : "/ダイヤ"+hako[i]['価格']+"個";
            hokan += (
                '<div class="N8_kisekae_boxs" data-name="'+hako[i]['着せ替え']+'">'+
                    '<div class="N8_kisekae_zero_boxs '+hako[i]['レア']+'">'+hako[i]['着せ替え']+l2d+'</div>'+
                    '<div class="N8_kisekae_zero_boxs">'+
                        '<div class="N8_kisekae_first_boxs">'+
                        '<a href="'+(hako[i]['アクセス']+hako[i]['着せ替え']+'.jpg')+'" target="_blank" ><img src="'+hako[i]['imgurl']+'"></a>'+
                        '</div>'+
                        //'<div><a href="'+hako[i]['blogurl']+'" target="_blank" ><img src="'+hako[i]['imgurl']+'"></a></div>'
                        '<div class="N8_kisekae_second_boxs">'+
                            '<div class="N8_kisekae_second_childs"><a href="'+hako[i]['blogurl']+'" target="_blank">'+hako[i]['名前']+'</a></div>'+
                            '<div class="N8_kisekae_second_childs"><a href="https://pasokau.com/skin_theme_'+skin_theme_list[hako[i]['テーマ']]+'" target="_blank">'+hako[i]['テーマ']+'</a></div>'+
                            '<div class="N8_kisekae_second_childs">'+hako[i]['入手方法']+kakaku+'</div>'+
                            '<div class="N8_kisekae_second_childs">'+hako[i]['実装日']+'</div>'+
                        '</div>'+
                    '</div>'+
                '</div>'
            );
            dia += (hako[i]['価格'] == "") ? 0:hako[i]['価格']*1;
            season += (hako[i]['入手方法'] == "クルーズパス") ? 1200:0;
            skincount++;
        }
    }
    document.getElementById('N8_contentbox').textContent = "";
    document.getElementById('N8_contentbox').insertAdjacentHTML("beforeend",hokan);
    document.getElementById("N8_diabox").textContent = "";
    document.getElementById("N8_diabox").insertAdjacentHTML("beforeend",
    '表示中のスキン【'+skincount+'】種類。<br>ダイヤ合計【'+dia+'】個。<br>お金に換算すると約【'+Math.floor(dia/7500*10000)+'】円です。'
    )
}
