
var zekan = [
['満潮','','「2018年9月ログボ」','2019年4月14日','「春の特別ログインボーナス」','実装2018年組、空白期間2年'],
['リトル・サンディエゴ','2019年5月30日','「明日の星☆新登場」','','','同期のリトル・ヘレナとリトル・クリーブランドはイベント終了後に常設入りしている'],
['シェフィールド（μ兵装）','2019年10月31日','「激奏のポラリス」','','','ミニゲーム報酬故に「激唱のユニバース」で復刻無し'],
['響','2019年12月26日','「翳りし満ちる影の華」','','','自己回復スキル持ち'],
['鬼怒','2019年12月26日','「翳りし満ちる影の華」','','','同時に改造も実装されている'],
['能代','2019年12月26日','「翳りし満ちる影の華」','','','前衛最強クラス、魚雷コンボパーツ'],
['霞','2019年12月26日','「翳りし満ちる影の華」','','','ふわりんの設定が面白い'],
['駿河','2019年12月26日','「翳りし満ちる影の華」','','','シナリオ初登場は2019年9月26日開催の「交錯する新たな波」'],
['龍鳳','2019年12月26日','「翳りし満ちる影の華」','','','優秀な回復軽空母'],
['ニューカッスル','2018年9月28日','「戦え！ロイヤルメイド隊」','2020年1月21日','「戦え！ロイヤルメイド隊2nd」','実装2018年組、ママ'],
['浦波','2020年1月21日','「母港春節」','','','吹雪型'],
['グロズヌイ','2020年2月27日','「凍絶の北海」','','','何を飲んでいるかは謎'],
['ミンスク','2020年2月27日','「凍絶の北海」','','','かわいい'],
['タシュケント','2020年2月27日','「凍絶の北海」','','','砲撃型駆逐艦'],
['パーミャチ・メルクーリヤ','2020年2月27日','「凍絶の北海」','','','改造実装されたのではよ'],
['チャパエフ','2020年2月27日','「凍絶の北海」','','','駆逐艦に強い'],
['ガングート','2020年2月27日','「凍絶の北海」','','','専用主砲でリロード短縮'],
['ソビエツカヤ・ロシア','2020年2月27日','「凍絶の北海」','','','CV.沼倉愛美'],
['龍驤','2018年12月20日','「南洋に靡く硝煙」','2020年3月12日','「南洋に靡く硝煙」','実装2018年組、初回イベントは開催期間が1週間しか無かった'],
['イントレピッド','2020年3月25日','「闇靄払う銀翼」','','','CV.ファイルーズあい'],
['カサブランカ','2020年3月25日','「闇靄払う銀翼」','','','編成外スキルで空母をサポートできる'],
['ブルーギル','2020年3月25日','「闇靄払う銀翼」','','','スキル込みで潜航力283と非常に高い'],
['リノ','2020年3月25日','「闇靄払う銀翼」','','','バランス調整で強化された'],
['クーパー','2020年3月25日','「闇靄払う銀翼」','','','耐久40%未満になると、1回だけ超強力な爆撃を行える。'],
['ブレマートン','2020年3月25日','「闇靄払う銀翼」','','','人気キャラ'],
['マーブルヘッド','2020年3月25日','「闇靄払う銀翼」','','','元地味子＆メガネっ娘という経歴がある'],
['リトル・レナウン','2020年4月23日','「リトル　ロイヤルナイト」','','','本家レナウンより便利'],
['リシュリュー','2020年5月21日','「神穹を衝く聖歌」','','','シナリオ初登場は2018年7月26日開催の「光と影のアイリス」'],
['ジャンヌ・ダルク','2020年5月21日','「神穹を衝く聖歌」','','','シナリオ初登場は2018年7月26日開催の「光と影のアイリス」'],
['アルジェリー','2020年5月21日','「神穹を衝く聖歌」','','','水着スキンがすごい'],
['ラ・ガリソニエール','2020年5月21日','「神穹を衝く聖歌」','','','はいてない疑惑'],
['ヴォークラン','2020年5月21日','「神穹を衝く聖歌」','','','ヴォークラン級バフを持っている（現状自身とタルテュが対象）'],
['ベアルン','2020年5月21日','「神穹を衝く聖歌」','','','副砲を装備できる。爆撃機装備時は航空リロード50%短縮。'],
['リトル・イラストリアス','2020年5月28日','「愛と平和の夢」','','','かわいい'],
['エスキモー','2020年6月3日','「峡湾間の反撃」','','','自己回復スキルを持つ'],
['インディペンデンス','2019年2月28日','「特別演習 超空強襲波」','2020年6月24日','「特別演習 超空強襲波」','復刻におよそ1年4ヶ月、公式絵師の供給が多い'],
['ハウ','2020年7月23日','「極夜照らす幻光」','','','戦艦編成のコンボパーツ、戦艦最強クラス'],
['パーシュース','2020年7月23日','「極夜照らす幻光」','','','開幕航空。回復スキルが優秀、セイレーン作戦のお供。'],
['ハーマイオニー','2020年7月23日','「極夜照らす幻光」','','','15秒毎に合計40発の榴弾を発射。'],
['イーグル','2020年7月23日','「極夜照らす幻光」','','','副砲を装備できる。爆撃機装備時は航空リロード50%短縮。'],
['ヴァリアント','2020年7月23日','「極夜照らす幻光」','','','2種の特殊弾幕スキルを持つ'],
['イカルス','2020年7月23日','「極夜照らす幻光」','','','魚雷発射形式を変更し、1本ずつ発射できる。'],
['U-110','2019年10月17日','「鉄血鮫とエニグマ」','2020年8月6日','「鉄血鮫とエニグマ」','復刻におよそ9ヶ月'],
['紀伊','2020年9月17日','「刹那觀る胡蝶の夢」','','','対空戦艦、主力から前衛に雷装10%アップを飛ばせる'],
['信濃','2020年9月17日','「刹那觀る胡蝶の夢」','','','初のUR建造艦船'],
['涼月','2020年9月17日','「刹那觀る胡蝶の夢」','','','自己回復スキル持ち、単体最強クラスの駆逐艦'],
['熊野','2020年9月17日','「刹那觀る胡蝶の夢」','','','ギャル'],
['千歳','2020年9月17日','「刹那觀る胡蝶の夢」','','','アズナビの人'],
['千代田','2020年9月17日','「刹那觀る胡蝶の夢」','','','アズナビの人'],
['樫野','2020年9月17日','「刹那觀る胡蝶の夢」','','','5万のマウスパッドを1893個売った'],
['プリンストン','2020年10月12日','「奔る 彩帆の青」','','','航空耐性や炎上耐性を得られる'],
['ガスコーニュ（μ兵装）','2019年10月31日','「激奏のポラリス」','2020年10月29日','「激唱のユニバース」','「激唱のユニバース」ではピックアップ無し'],
['赤城（μ兵装）','2019年10月31日','「激奏のポラリス」','2020年10月29日','「激唱のユニバース」','「激唱のユニバース」ではピックアップ無し'],
['クリーブランド（μ兵装）','2019年10月31日','「激奏のポラリス」','2020年10月29日','「激唱のユニバース」','「激唱のユニバース」ではピックアップ無し'],
['アドミラル・ヒッパー（μ兵装）','2019年10月31日','「激奏のポラリス」','2020年10月29日','「激唱のユニバース」','「激唱のユニバース」ではピックアップ無し'],
['大鳳（μ兵装）','2020年10月29日','「激唱のユニバース」','','','本家大鳳と比べ、航空出力が安定して高い。'],
['タシュケント（μ兵装）','2020年10月29日','「激唱のユニバース」','','','本家タシュケントと比べ、砲撃性能が大幅にダウンしている。'],
['ダイドー（μ兵装）','2020年10月29日','「激唱のユニバース」','','','比較的楽な条件で前衛の命中・対空15%アップ。'],
['アルバコア（μ兵装）','2020年10月29日','「激唱のユニバース」','','','本家アルバコアよりも潜航力が高くなる'],
['ボルチモア（μ兵装）','2020年10月29日','「激唱のユニバース」','','','比較的楽な条件で前衛の対空+15%アップ'],
['ローン（μ兵装）','2020年10月29日','「激唱のユニバース」','','','本家ローンよりも強いと評価されている'],
['イラストリアス（μ兵装）','2020年10月29日','「激唱のユニバース」','','','特殊航空スキルを得て攻撃的になったイラストリアス'],
['ル・マラン（μ兵装）','2020年10月29日','「激唱のユニバース」','','','「アイリス饅頭天使隊」を召喚し、爆撃する'],
['ハーディ','2019年3月7日','「輝ける峡湾の星」','2020年11月12日','「輝ける峡湾の星」','復刻におよそ1年8ヶ月'],
['ハンター','2019年3月7日','「フィヨルド・ハンター」','2020年11月12日','「フィヨルド・ハンター」','復刻におよそ1年8ヶ月'],
['Z2','2019年3月7日','「輝ける峡湾の星」','2020年11月12日','「輝ける峡湾の星」','2020年6月3日「峡湾間の反撃」でドロップ有り'],
['ペーター・シュトラッサー','2020年12月29日','「虚畳なりし限象」','','','効果時間3秒の停止スキルを持つ。'],
['プリンツ・ハインリヒ','2020年12月29日','「虚畳なりし限象」','','','生存力に優れ、攻撃性能も高い。特殊副砲攻撃という技能を習得する。'],
['U-37','2020年12月29日','「虚畳なりし限象」','','','Uボートの中では潜航力が高い'],
['ヴェーザー','2020年12月29日','「虚畳なりし限象」','','','鉄血初の軽空母、条件さえ整えれば自己回復可能'],
['ニュルンベルク','2020年12月29日','「虚畳なりし限象」','','','設定画のおしりは必見'],
['Z24','2020年12月29日','「虚畳なりし限象」','','','中二病'],
['Z28','2020年12月29日','「母港正月2021」','','','ママ'],
['フォーミダブル','2019年9月11日','「悲歎せし焔海の詩」','2021年1月21日','「悲歎せし焔海の詩（復刻）」','停止スキル使い、重装甲'],
['リットリオ','2019年9月11日','「悲歎せし焔海の詩」','2021年1月21日','「悲歎せし焔海の詩（復刻）」','アリーヴェデルチ！'],
['コンテ・ディ・カブール','2019年9月11日','「悲歎せし焔海の詩」','2021年1月21日','「悲歎せし焔海の詩（復刻）」','珍しいR戦艦'],
['ジュリオ・チェザーレ','2019年9月11日','「悲歎せし焔海の詩」','2021年1月21日','「悲歎せし焔海の詩（復刻）」','来た、見た、勝った'],
['ザラ','2019年9月11日','「悲歎せし焔海の詩」','2021年1月21日','「悲歎せし焔海の詩（復刻）」','回転率の良いシールドスキルを使える'],
['トレント','2019年9月11日','「悲歎せし焔海の詩」','2021年1月21日','「悲歎せし焔海の詩（復刻）」','ママ'],
['カラビニエーレ','2019年9月11日','「悲歎せし焔海の詩」','2021年1月21日','「悲歎せし焔海の詩（復刻）」','復刻におよそ1年4ヶ月'],
['ポーラ','2021年1月21日','「悲歎せし焔海の詩（復刻）」','','','シナリオ初登場は2019年9月11日開催の「悲歎せし焔海の詩」'],
['ヴィンチェンツォ・ジョベルティ','2021年1月21日','「悲歎せし焔海の詩（復刻）」','','','特殊弾幕で通常弾80発＋魚雷3発を撃ち出す'],
['鞍山','2018年2月12日','「四天王大冒険・鞍山編」','毎年開催','','実装2018年組、最多復刻回数'],
['撫順','2018年2月12日','「四天王大冒険・撫順編」','毎年開催','','実装2018年組、最多復刻回数'],
['U-410','2021年2月4日','「母港春節」','','','潜水支援範囲が特殊'],
['応瑞','2021年2月4日','「母港春節」','','','装備スロットが軽巡砲、駆逐砲、魚雷で構成されている'],
['肇和','2021年2月4日','「母港春節」','','','装備スロットが軽巡砲、駆逐砲、魚雷で構成されている'],
['ペネロピ','2021年2月4日','「母港春節」','','','自己回復スキル'],
['ストレミテルヌイ','','「2021年2月ログボ」','','','減速弾幕'],
['キーロフ','2021年2月25日','「暁射す氷華の嵐」','','','軽巡で最も主砲射程が長い'],
['ソビエツカヤ・ベラルーシア','2021年2月25日','「暁射す氷華の嵐」','','','特殊弾幕がかっこいい'],
['タリン','2021年2月25日','「暁射す氷華の嵐」','','','シールド＋バリアで生存力に優れる'],
['グレミャーシュチ','2021年2月25日','「暁射す氷華の嵐」','','','20秒毎に25%の確率で魚雷を発射'],
['ムルマンスク','2021年2月25日','「暁射す氷華の嵐」','','','かわいい'],
['グロームキィ','2021年2月25日','「暁射す氷華の嵐」','','','他の艦船を回復するスキルを持つ'],
['飛龍(META)','2020年12月22日','「メタラボ」','','','2021年3月18日まで開催'],
['ボルチモア','2019年7月31日','「開かれし紺碧の砂箱」','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','人気キャラ'],
['アラバマ','2019年7月31日','「開かれし紺碧の砂箱」','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','対空戦艦、特殊弾幕持ち'],
['カヴァラ','2019年7月31日','「開かれし紺碧の砂箱」','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','回復スキルを持つ潜水艦'],
['バターン','2019年7月31日','「開かれし紺碧の砂箱」','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','対空軽空母'],
['サンフアン','2019年7月31日','「開かれし紺碧の砂箱」','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','復刻におよそ1年7ヶ月'],
['バーミンガム','2019年7月31日','「開かれし紺碧の砂箱」','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','生存スキル持ち'],
['エールウィン','2019年7月31日','「開かれし紺碧の砂箱」','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','復刻におよそ1年7ヶ月'],
['アレン・M・サムナー','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','','','対空駆逐'],
['ステフェン・ポッター','2021年3月25日','「開かれし紺碧の砂箱（復刻）」','','','優秀な空襲先導使い'],
['追風','','「2021年4月ログボ」','','','おいて'],
['ヴィットリオ・ヴェネト','2021年4月22日','「讃える復興の迷路」','','','シナリオ初登場は2019年9月11日開催の「悲歎せし焔海の詩」'],
['ドゥーカ・デッリ・アブルッツィ','2021年4月22日','「讃える復興の迷路」','','','魚雷コンボパーツ'],
['アクィラ','2021年4月22日','「讃える復興の迷路」','','','装備で開幕航空か回復＆バリアに切り替えられる。'],
['トリチェリ','2021年4月22日','「讃える復興の迷路」','','','ふとももが大きい'],
['マエストラーレ','2021年4月22日','「讃える復興の迷路」','','','高性能な煙幕散布スキルを持つ'],
['リベッチオ','2021年4月22日','「讃える復興の迷路」','','','回転率の良い特殊弾幕スキルを使える'],
['ニコロソ・ダ・レッコ','2021年4月22日','「讃える復興の迷路」','','','敵軽巡にダメージ8%アップのデバフ付与'],
['天城ちゃん','2021年4月22日','「すこやかりとる」','','','ロリ化艦船10隻目'],
['タルテュ','2020年5月7日','「帰路は海色の陰りへと」','2021年5月6日','「帰路は海色の陰りへと」','復刻におよそ1年'],
]

var korabo = [
['ネプテューヌ','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['ノワール','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['ブラン','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['ベール','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['パープルハート','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['ブラックハート','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['ホワイトハート','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['グリーンハート','2018年1月26日','「別次元からの来訪者」','','','「ネプテューヌ」コラボ'],
['フミルィル','2018年11月22日','「彼方よりの邂逅」','','','「うたわれるもの」コラボ'],
['クオン','2018年11月29日','「夢幻の邂逅」','','','「うたわれるもの」コラボ'],
['ネコネ','2018年11月29日','「夢幻の邂逅」','','','「うたわれるもの」コラボ'],
['ルルティエ','2018年11月29日','「夢幻の邂逅」','','','「うたわれるもの」コラボ'],
['ウルゥル','2018年11月29日','「夢幻の邂逅」','','','「うたわれるもの」コラボ'],
['サラァナ','2018年11月29日','「夢幻の邂逅」','','','「うたわれるもの」コラボ'],
['キズナアイ','2019年4月26日','「仮想繋げし共時性」','','','「キズナアイ」コラボ'],
['キズナアイ・エレガント','2019年4月26日','「仮想繋げし共時性」','','','「キズナアイ」コラボ'],
['キズナアイ・アニバーサリー','2019年4月26日','「仮想繋げし共時性」','','','「キズナアイ」コラボ'],
['キズナアイ・スーパーゲーマー','2019年4月26日','「仮想繋げし共時性」','','','「キズナアイ」コラボ'],
['白上フブキ','2019年11月27日','「ホロライブ×アズールレーン」','','','「ホロライブ」コラボ'],
['百鬼あやめ','2019年11月27日','「ホロライブ×アズールレーン」','','','「ホロライブ」コラボ'],
['紫咲シオン','2019年11月27日','「ホロライブ×アズールレーン」','','','「ホロライブ」コラボ'],
['夏色まつり','2019年11月27日','「ホロライブ×アズールレーン」','','','「ホロライブ」コラボ'],
['大神ミオ','2019年11月27日','「ホロライブ×アズールレーン」','','','「ホロライブ」コラボ'],
['ときのそら','2019年11月27日','「ホロライブ×アズールレーン」','','','「ホロライブ」コラボ'],
['湊あくあ','2019年11月27日','「ホロライブ×アズールレーン」','','','「ホロライブ」コラボ'],
['マリー・ローズ','2020年11月26日','「バケーションレーン」','','','「DOAXVV]コラボ'],
['ほのか','2020年11月26日','「バケーションレーン」','','','「DOAXVV]コラボ'],
['かすみ','2020年11月26日','「バケーションレーン」','','','「DOAXVV]コラボ'],
['みさき','2020年11月26日','「バケーションレーン」','','','「DOAXVV]コラボ'],
['なぎさ','2020年11月26日','「バケーションレーン」','','','「DOAXVV]コラボ'],
['女天狗','2020年11月26日','「バケーションレーン」','','','「DOAXVV]コラボ'],
['モニカ','2020年11月26日','「バケーションレーン」','','','「DOAXVV]コラボ'],
]


var kan_zextupann = [];
var kansen_nouryoku = [];
var kensaku_kansen = {除外:[],新規:[],META:[],計画艦:[],コラボ:[],通常:[]};
window.addEventListener('DOMContentLoaded', function() {
  for(var i=0;i<kan_profile.length; i++){
      var inputstatus_deta = {
          陣営:kan_list[i][0],
          艦種:kan_list[i][1],
          正規名:kan_list[i][2],
          レア:kan_profile[i][3],
          装甲:kan_list[i][66],
          耐久:"",
          装填:"",
          回避:"",
          命中:"",
          火力:"",
          雷装:"",
          航空:"",
          対空:"",
          対潜:"",
          速力:"",
          幸運:"",
          消費:kan_list[i][77]*1,
          主砲装備:kan_list[i][67],
          主砲補正:kan_list[i][70],
          主砲砲座:kan_list[i][73],
          副砲装備:kan_list[i][68],
          副砲補正:kan_list[i][71],
          副砲砲座:kan_list[i][74],
          対空装備:kan_list[i][69],
          対空補正:kan_list[i][72],
          対空砲座:kan_list[i][75],
          硬直:kan_list[i][76],
          設備:'設備',
          画像:kan_profile[i][10],
          スキル:kan_profile[i][11],
          記事:kan_profile[i][12],
          声優:kan_profile[i][8],
          絵師:kan_profile[i][9],
          入手:kan_profile[i][4],
          実装日:kan_profile[i][5],
          改造日:kan_profile[i][6],
          進水日:kan_profile[i][7],
          起工日:kan_profile[i][13],
          竣工日:kan_profile[i][14],
          艦級:kan_profile[i][15],
          除外:kan_profile[i][16],
          live:kan_profile[i][17],
          評価:kan_profile[i][18],
          建造:kan_profile[i][19],
          突破:kan_profile[i][20],
          表記:kan_profile[i][21],
          接頭辞:kan_profile[i][22],
          リンク:kan_profile[i][23],
          番号:kan_profile[i][24],
      };
      kansen_nouryoku.push(inputstatus_deta);        

      if(kansen_nouryoku[i].記事.indexOf('改有り')!= -1){
          //改造後のレアを表示
          rarecolor = kansen_nouryoku[i].レア.substring(kansen_nouryoku[i].レア.indexOf('→')+1);
      }else if(kansen_nouryoku[i].レア.indexOf('→')!= -1){
          //初期レアを表示
          rarecolor = kansen_nouryoku[i].レア.substring(0,kansen_nouryoku[i].レア.indexOf('→'));
      }else{
          rarecolor =kansen_nouryoku[i].レア;
      }
      kansen_nouryoku[i].修正レア = rarecolor;
      kansen_nouryoku[i].ソート = i;
      kansen_nouryoku[i].正式名称 = kan_profile[i][12] === '改有り' ? kan_list[i][2].substring(0,kan_list[i][2].indexOf('改')):kan_list[i][2];
      //hokan += '<tr id="'+kansen_nouryoku[i].ソート+'" class="chara_list"><td class="'+kansen_nouryoku[i].修正レア+'" onclick="status_check(this);">'+kansen_nouryoku[i].名前+'</td><td>'+kansen_nouryoku[i].陣営+'</td><td>'+kansen_nouryoku[i].艦種+'</td><td></td></tr>';
      

      if(kansen_nouryoku[i].除外[1] === '除外'){
          kensaku_kansen.除外.push(kansen_nouryoku[i]);
      }else if(kansen_nouryoku[i].除外[1] === '新規'){
          kensaku_kansen.新規.push(kansen_nouryoku[i]);
      }else if(kansen_nouryoku[i].除外[1] === 'META'){
          kensaku_kansen['META'].push(kansen_nouryoku[i]);
      }else if(kansen_nouryoku[i].除外[1] === '計画艦'){
          kensaku_kansen.計画艦.push(kansen_nouryoku[i]);
      }else if(kansen_nouryoku[i].除外[1] === 'コラボ'){
          kensaku_kansen.コラボ.push(kansen_nouryoku[i]);
      }else{
          kensaku_kansen.通常.push(kansen_nouryoku[i]);
      }
  }


  kansen_kakunouko = "";
  for(var t = 0; t<zekan.length; t++){
    for(var d = 0; d<kansen_nouryoku.length; d++){
      if(zekan[t][0] == kansen_nouryoku[d]['正規名']){
            zekan[t].push(d);
            urldeta = "https://pasokau.com/"+kansen_nouryoku[d].接頭辞+'_'+kansen_nouryoku[d].リンク;
            adeta = '<img class="kanpic '+kansen_nouryoku[d]['修正レア']+'" src="'+kansen_nouryoku[d]['live'][2]+'" alt="'+kansen_nouryoku[d]['正式名称']+'"/><a href="'+urldeta+'" target="_blank" ><img src="https://livedoor.blogimg.jp/kojinn00home/imgs/c/5/c5d69403.png"/>'+kansen_nouryoku[d]['正式名称']+'</a>';
            kansen_kakunouko+=('<div style="display: inline-block;" class="sort_class">'+adeta+'</div>');
            kan_zextupann.push(kansen_nouryoku[d]);
        }
      }
  }
  document.getElementsByClassName("kan_list_div")[0].insertAdjacentHTML("beforeend",kansen_kakunouko);

  kansen_kakunouko = "";
  for(var t = 0; t<korabo.length; t++){
    for(var d = 0; d<kansen_nouryoku.length; d++){
      if(korabo[t][0] == kansen_nouryoku[d]['正規名']){
            korabo[t].push(d);
            urldeta = "https://pasokau.com/"+kansen_nouryoku[d].接頭辞+'_'+kansen_nouryoku[d].リンク;
            adeta = '<img class="kanpic '+kansen_nouryoku[d]['修正レア']+'" src="'+kansen_nouryoku[d]['live'][2]+'" alt="'+kansen_nouryoku[d]['正式名称']+'"/><a href="'+urldeta+'" target="_blank" ><img src="https://livedoor.blogimg.jp/kojinn00home/imgs/c/5/c5d69403.png"/>'+kansen_nouryoku[d]['正式名称']+'</a>';
            kansen_kakunouko+=('<div style="display: inline-block;" class="sort_class">'+adeta+'</div>');
            kan_zextupann.push(kansen_nouryoku[d]);
        }
      }
  }
  document.getElementsByClassName("kan_list_div")[1].insertAdjacentHTML("beforeend",kansen_kakunouko);

});


function kanlist_setbutton(){
    kensaku_kunilist = [];
    kensaku_typelist = [];
    kensaku_rarelist = [];
    
    for (var i = 0; i < document.querySelectorAll("#kennsaku_check input[name='kensaku_kuni']").length; i++) {
        if (document.querySelectorAll("#kennsaku_check input[name='kensaku_kuni']")[i].checked) {
            kensaku_kunilist.push(document.querySelectorAll("#kennsaku_check input[name='kensaku_kuni']")[i].value);
        }
    }
    for (var i = 0; i < document.querySelectorAll("#kennsaku_check input[name='kensaku_type']").length; i++) {
        if (document.querySelectorAll("#kennsaku_check input[name='kensaku_type']")[i].checked) {
            kensaku_typelist.push(document.querySelectorAll("#kennsaku_check input[name='kensaku_type']")[i].value);
        }
      }
    for (var i = 0; i < document.querySelectorAll("#kennsaku_check input[name='kensaku_rare']").length; i++) {
        if (document.querySelectorAll("#kennsaku_check input[name='kensaku_rare']")[i].checked) {
            kensaku_rarelist.push(document.querySelectorAll("#kennsaku_check input[name='kensaku_rare']")[i].value);
        }
    }

    var rarehanntei = function(i){    
        if(Object.keys(kensaku_rarelist).length == 0){
            //rare指定なし
            document.getElementsByClassName("sort_class")[i].style.display = "inline-block";
        }else{
            for(var y=0; y<kensaku_rarelist.length; y++){
                if(kensaku_rarelist[y] == kan_zextupann[i].修正レア){
                    //rare指定
                    document.getElementsByClassName("sort_class")[i].style.display = "inline-block";
                }
            }
        }
    }

    var typehantei = function(i){
        if(Object.keys(kensaku_typelist).length == 0){
            //艦種指定なし
            rarehanntei(i);
        }else{
            //艦種指定
            for(var r=0; r<kensaku_typelist.length; r++){
                if(kensaku_typelist[r]==kan_zextupann[i].艦種){
                    rarehanntei(i);
                }
            }
        }
    }

    for(var i = 0; i<kan_zextupann.length; i++){
        document.getElementsByClassName("sort_class")[i].style.display = "none";
        //陣営
        if(Object.keys(kensaku_kunilist).length == 0){
            //陣営指定なし
            typehantei(i);
        }else{
            //陣営指定
            for(var j=0; j<kensaku_kunilist.length; j++){
                if(kensaku_kunilist[j]==kan_zextupann[i].陣営){
                    typehantei(i);
                }
            }
        }
    }
}
